{
  "0": "Lets start of with the good things. The action sequences are well done and there are a lot of them. And the visuals are top notch. It really does feel like youâ",
  "1": "This was a heck of a lot better than what people make it out to be. I can see why people don't like this one as much as the first, but I was able to enjoy it. It does feel like it should've been a spin-off movie, rather than calling it \"cars 2\" but it's still enjoyable.",
  "2": "My 3.5 year old boy loves all Pixar movies, as do I. Cars 2 should be rated PG, not G, as it IS very violent. Guns, explosions, and killing/death are what the entire movie consists of, oh yeah and racing. We are trying to limit the amount of violence/weapons our son intakes. If you remember, even in Toy Story, Woody never had a gun in his holster, always empty. I don't necesarily mind that Pixar went this route cause it's not there job to cater to young children. I am however disapointed that the MPAA approved a G rating for this film when it CLEARLY should be PG",
  "3": "A good exciting cool car action movie with gadgets and guns,exciting chases,spy action and Big explosions,better than the original.I bet they are going to make a third cars movie for a secret villian.My favorite part is when mater says dad-gum and then the computer activates the terminator guns and shoots crazlily, it was funny.and my other part is the beginning thats the most start for a spy named Finn Mcmissle,who does gadgets,guns and car-fu.that was like my favorite action scene in the movie.My other funny scene is that mater tastes the wassabi and his tongue was burning off-screen.",
  "4": "I read the reviews here before I decided on going for the movie. Judging by the low score here, I assumed it would be a pretty flat movie but I was pleasantly surprised! Not only is this movie as good as the first, in some respects its even better. The only reason I would suspect that this movie got a low score here is that its a bit too involved to be a pure kiddy movie. Its actually got all the pizazz of a James Bond flick and plenty of laughs thrown in as well. Sure the dialog could be better in some places, but its really not all that bad a film overall.",
  "5": "Cars 2 is basically the first Cars with a sprinkle of The Fast and the Furious. This was an experiment that Pixar has never done before and I respect that. Just because Cars 2 isn't a heartwarming Toy Story 3 doesn't mean that it is bad. Cars 2 breaks the overused tradition of other Pixar films and thats why I don't think it is as bad as the critics say it is.",
  "6": "Why do people hate this movie, I mean sure its not Pixar's best but it's still great, its a funny spy movie with likeable characters, I mean how could people not like the characters. What's wrong with a spy car, a race car, and a tow truck. This movie is not Pixar's worst movie",
  "7": "Okay, it was a fairly decent movie. But the dream company, Pixar, didn't add the warmth and feeling. The first I didn't care for much, but it had that love in it. Cars 2 was aesthetically marvelous, but it felt like a small glove. The move didn't feel right. It did not have the Pixas shimmer and secret ingredient, love.",
  "8": "I love First Cars and Second Cars and I hard to say that the cooler , but both games I put 9/10 . In Cars 2 there is a good storyline and this movie is a good sequel for Cars . I am waiting Cars 3 . I watched this movie in 2013 and it was very interesting to me . In this game a lot of cool characters . 9/10 . Very good and amazing cartoon .",
  "9": "Overall, it is a good animated movie. But this is not what I expect from Pixar. Complicated plot, occasionally cheesy voice acting and surprisingly basic presentation. The animation as always is fantastic. But still, I am very disappointed with Pixar. I expect a lot more from them. I hope they will redeem themselves in their next films.................",
  "10": "Wij vonden de film hartstikke leuk! De hele klas heeft ervan genoten! We hopen op een Cars 3!! De verhaallijn had misschien iets simpeler gekund, maar Cars blijft Cars! We zijn 3 keer naar de bioscoop geweest, en zodra de film op dvd uit komt rennen mijn kinderen meteen naar de winkel!Jammer dat Cars 3 door sommige wordt afgekraakt!Zijn gewoon jaloers!Cars blijft speelgoed verkopen al 5 jaar lang, wie doet jullie dat na??!!Be proud!!And good job!!",
  "11": "Lightning McQueen (Owen Wilson) is offered a placement  to race in a new international race circuit involving the greatest style of race cars. However, there is one specific race car McQueen desires to beat, the Italian Francesco Bernoilli  The hardly see eye to eye on the race track. The International races are located at Tokyo, Italy and London. Sadly, Mater has a problem. He must take part in a mission to stop the evil villains destroying the best cars with their lasers.Mater appears to have the spotlight throughout, unlike McQueen in the first installment. We see the rusty truck as a sidekick to McQueen as he sets out to be the hero and becoming a spy along with Holley Shiftwell (Emily Mortimer) and Finn McMissile (Michael Caine) whose voice acting is superb. A few action scenes reminiscent of James Bond films appear in the film which are very enjoyable and keep the older audience from getting bored. The moral message to this film is â",
  "12": "Okay, let me re-explain what you probably know; Cars 2 is widely being considered as Pixar's worst. This is true. It's also being widely considered as a bad film. This is not true. I personally believe this is another great film from Pixar, it just plunges a little more into the Dreamworks tub. The story revolves around Mater, rather than Lightning McQueen, a mixed decision in my opinion. On one hand, Lightning McQueen is a bland character, with little personality. And Mater, while much more interesting and defined, is also extremely one dimensional, and that really shows when he becomes the star of the show. Mater is mistaken as an American spy by two secret agents, Flinn McMissile and Holly Shiftwell. Mater then takes part in many missions, while the two secret agents have no idea he's just a regular tow truck. In the meantime, Lightning McQueen is on a World Grand Prix in hopes of beating the **** Francesco. There's a bit more to the plot than this, but that's the gist of it. The film certainly looks like a Pixar film. The animation is easily Pixar's best; appearing more detailed than that of Toy Story 3, and the various race/spy scenes give the movie a chance to show what it can do. Some things look impeccably real (in the last 20 minutes of the film, take a look at the trees). The film sounds like a Pixar movie too. The musical soundtrack is performed masterfully by Michael Giacchino. Also, the voice talents have been selected carefully, just as in all Pixar films. The original voice actors are back (though due to the death of two characters, Fillmore's voice has been replaced and Doc is deceased), though most of them get few appearances. Also, John Ratzenberger (who gets a role in every Pixar film) has an infestimal role in this film: only two lines. So, the film sounds and looks like a Pixar, but it doesn't feel like one. Compared to the other Pixars, the story is weak and disappointing. Also, there is none of the heart and emotion that made the other Pixars so lovable. There's little adult-kid balance, so most parents won't be watching with their kids, which is completely opposite of other Pixars, where parents may enjoy the film more than the kids. I said earlier that this film is more like a Dreamworks movie. This is because of the lack of emotion, the shallow story, and the kid appeal. Even the humor is a little more Dreamworks oriented, a lot of it being roll-your-eyes kind of humor, and there's even some potty humor. That's not to say you won't laugh; there are plenty of amusing bits, but overall, it pales in comparison to Pixar's previous efforts. Concluding, this is Pixar's worst film, hands down. However, it's still a great film, although flawed. It's certainly not a must see like the other Pixars, but it's good enough. Just don't do this to us again, Pixar: I won't be quite as forgiving.",
  "13": "Star racecar Lightning McQueen and the incomparable tow truck Mater take their friendship to exciting new places in \"Cars 2\" when they head overseas to compete in the first-ever World Grand Prix to determine the world's fastest car. But the road to the championship is filled with plenty of potholes, detours and hilarious surprises when Mater gets caught up in an intriguing adventure of his own: international espionage. Torn between assisting Lightning McQueen in the high-profile race and towing the line in a top-secret spy mission, Mater’s action-packed journey leads him on an explosive chase through the streets of Japan and Europe, trailed by his friends and watched by the whole world. Adding to the fast-paced fun is a colorful new all-car cast that includes secret agents, menacing villains and international racing competitors.",
  "14": "I stayed there until fame Lightning McQueen , and Mater the star is wearing, but hey, the scripts change, for me the movie is very good , but say it is the worst pelicua PIXAR That being so I do not more you put a 5.",
  "15": "Like the first, this was not great but not very bad either. The transition from the \"Hot-shot comes to small town and learns life lessons\" theme of the first to a spy movie was a bit odd but there were still some entertaining gags. Mater was a great part of the first so it was nice to see him get more screen time. And it was clever to have the James Bond parody be an Aston Martin but it was a bit weak in parts. Perhaps this wouldn't be a problem if we hadn't come to expect so much from Pixar but we have. Who knows-maybe Cars 3 will be better. Maybe it'll be a third time lucky situation. But the movie does have it's charms, it's by no means bad. Just a bit disappointing compared to most Pixar films.",
  "16": "I enjoyed this film more than the first. I love that spy story where Mater involves. It's a funny film! Why too many dislikers... anyway I'm not a huge fan and I'm not really waiting for the 3 because I don't think it's necessary.",
  "17": "Pixar is the standard bearer for animated movies that appeal equally to children and adults, and this is no exception. There has yet to be a Pixar film that doesn't make more than $100 million or score a devoted following from both critics and audiences. The animation is gorgeous, the action sequences crisp, the voice acting impeccable, and the inside jokes funny. Cars 2 is not a masterpiece when stacked up against the Toy Story sequels, but it's a fun summer spectacle that will make kids think about what it means to really be yourself, even when there's pressure to change.Mater is now the protagonist, and the world is the setting; while that expands the action and the automobile humor (geisha cars, the Queen as a vintage Rolls, and Prince Wheeliam as a Bentley), it does limit the amount of time that we spend with our old friends from Radiator Springs. Caine and Emily Mortimer are perfectly cast as the British intelligence agents who mistake Mater for an American spy, but in the end, this is Larry the Cable Guy's shining moment.",
  "18": "Ratatouille, Wall.E, The Incredibles, Finding Nemo, Monsters Inc, Up: the list of beloved Pixar movies is long. One of the few that’s almost never cited is Cars. But John Lasseter’s one-dimensional and visually sub-stellar 2006 tribute to American auto culture did rake in an awful lot of merchandise money. Its reboot, Cars 2 – is equally so-so.The last film was a tribute to Route 66, the American west and a 1951 Hudson Hornet. It was set in Radiator Springs, a place that its hero Lightning McQueen (voiced by Owen Wilson) dismissed at first as “hillbilly hell” before learning to love its decent, old-school ways. In Cars 2, Lasseter and co-director Brad Lewis have gone down the export route, relocating the action to Italy, Japan and swinging London.McQueen heads to these cities to compete in a World Grand Prix organised by oil tycoon Miles Axlerod (Eddie Izzard) as a showcase for his alternative energy business. He’s accompanied by pal Mater (Larry the Cable Guy), a rusty pick-up truck, who initially embarrasses him, but later, when it turns out that a plan has been hatched to blow up the champ, saves him with feats of bravery and ingenuity.",
  "19": "I kind of like it. It's not that bad. The plot sucks but once you look past that ..yeah. Pretty fun.",
  "20": "Now this movies had (still gets)some pretty bad press and reviews, and I can see why but it's really not all that bad. Pretty good movie actually with beautiful animation, good music, interesting scenes and places, international race cars, Lightning McQueen and the it showed more of the Car world.The spy stuff and the plots involving oil, new fuel types, car discrimination and friendship might go over some kids heads but it is also rather interesting if you study it more. The only real issue that I have is with the character, Mater, himself. I am not a big Mater fan, of his personality type or humour but I can see why he appeals to kids and others, so maybe that's why he's the real star of this film.Basically the film revolves around a plot to turn people (the cars) towards a new fuel type that's supposed to be better for them, and an international race is there to promote the fuel. However, the new fuel is really just gasoline and by making the new fuel look bad, by hurting the racers using the fuel, the cars behind all this hope to turn people back to oil ( there's a huge new secret oil field discovered by these guys early o in the film)and get rich and powerful. The cars doing this are 'lemon' cars or ones who are not well made and break down frequently and get made fun of.So they feel rather angry at the world for their poor treatment.There are also spies (the good guys) from Britain, America, etc ( A rather James bond like one and a pretty purple Jaguar type)and Mater basically gets mixed up in all this whilst Lightning races against a heap of other racers, though this really isn't paid as much attention to as it should have been. It all ends with mater uncovering the lead villain, making up with McQueen after an argument and has messages like be yourself and accept others. Good messages for children I suppose. The movie made me smile and laugh with it's over the top nonsense and beautiful animation, as well as amusing my nephew and nieces. The main issue though (with many people) is still Mater and his bumbling ways, the lack of attention to the races and Lightning, plus there was some violence like the American spy getting blown up and the racers engines blowing out from a lazer but I have seen worse. Anyone remember Littlefoot's mother being injured and dying? Now that's painful and scary cartoon violence. There was also the fact that Lightning doesn't win in any major races and the other characters from Radiator Springs felt like they were put in just to fill space.plus for a movie promoting international race scenes they only went to 3 places, whilst if you look at the Cars 2 artbook you can see that various other types of races (endurance, outback and ice) were planned, in a variety of places like Russia and Germany. Why Pixar didn't focus more on or include these is beyond me. It would have appealed to many to see more races, race types and countries I think and less of the Mater/spy stuff.Still I do like the film and it isn't a depressing disappointment like Cars 3 is, so 8/10 for me. 2 of for Mater I'm afraid though.",
  "21": "This is not a bad movie, but it may be the first misfire from Pixar. Its effects are dazzling as ever, but unfortunately, it's not enough to conceal the weak and questionable plot.",
  "22": "Clear, concise, intelligent and humorous - such is Cars 2. Cars was never my favorite Pixar, but coming out of the theater after seeing the sequel, I found myself smiling over a clever, well-thought, simply entertaining film. There is no deep, emotional story, but for entertainment this is by far extremely enjoyable. The humor is intelligent (not crude, suggestive or shallow like so many other animated films), the story moves at a solid, easy to understand pace and the characters are engaging. Mater is a character that is easy to root for with his positive outlook on life and his compassion toward everyone around him. When it comes to giving a good example of a nonjudgmental attitude, Mater is hard to beat. Finn McMissile has many of the typical spy characteristics, but goes beyond what we stereotypically think of the \"James Bond\" character by showing kindness and respect toward others. He openly admits his own shortcomings/need for help, while remaining debonair through it all. He doesn't even show the womanizing side so easily associated with the \"spy world\" and instead shows his female counterpart a great deal of respect.  Kudos to Pixar for their work on these characters. There is lots of \"eye candy\" in the depth of animation and the creative little touches to background motifs that make this world truly and mechanically unique. After seeing the film numerous times on various screens, I am still catching the little details placed in the film - all of which have never been of any suggestive nature inappropriate for a general viewing audience. This film also allows us a chance to look at some of our little idiosyncrasies in a fun way and gives positive messages such as friendship, compassion and honesty. While not for everyone - a caution to families with young children due to intense action sequences and suggested deaths - for older children through adults, Pixar's continued show of intelligent film making sets it apart from all other animation companies regardless of where the awards land.  As for what I witnessed during my various visits to the theater for this film, everyone was fully engaged - laughing, cheering and generally having a good time. We all left with smiles, which I think says a lot for the film. My money will remain on Pixar.",
  "23": "I honestly don't understand why this movie has taken such a beating. Personally, it's my least favorite Pixar movie, and it does have its share of problems, but I still enjoyed it. Why? Because I knew it wasn't meant be a tear-jerking masterpiece like Up or Toy Story 3 - it was meant to be a simple, fun, summer comedy. And it succeeds at that. It doesn't have to be emotional or profound in order to be good. It's nice to take a break from all that crying for a change! (Not that there's anything wrong with Pixar movies making you cry.) Sure, it's not Pixar's best by a long shot, but just because it isn't the next WALL-E or Toy Story or Finding Nemo doesn't mean that it isn't good. Kudos to Pixar for branching out, trying something different, and proving that they still don't know how to make a bad movie! 8/10.",
  "24": "I don't understand why this has low scores?  The movie was great, watched it in 3D with my daughter and we both loved it!  The locations, cars & story was great!",
  "25": "Loved it, found it the best out of all of the other films. It has a lot of action and is just plain wonderful. I really really hope they make a new one, Cars 3.",
  "26": "Cars 2 is Pixar's worst film to date, but that doesn't mean it's bad. It is a good film, but not a lot more, as some of the comedy isn't very funny and the plot isn't exactly top of the line. My main complaint of the film however is that it feels disjointed, giving you no time to get adjusted to \"Lightning's\" storyline, while also at times not giving you enough time to really get into \"Mater's\" storyline. It's odd that they shifted the focus of the main protagonist to Mater, which, while isn't necessarily bad, some will find it very off-putting. The film is fun, and this is where it holds up, making it a 6/10, also it has a good plot twist that I did not see happening at all. All in all, it's a fun film that shouldn't be overlooked, but it should really be called something like \"Cars: it's Materin' Time!\" as the story revolves around Mater, giving a fun Spy based film with explosions and everything, but certainly no Pixar masterpiece like we should be getting given their track record.",
  "27": "Ok this movie was hilarious, stop hating on Larry the cable guy. he maybe low brow but he's funny ok? stop trying to be so sophisticated and laugh you stuck up jerks. as for the violence and death of CARS!!!! its rated PG for a reason morons, it stands for Parental Guidance, which mean you guide your child into the theater and if they don't understand something you do your best to it explain to them when the movie is over. it is your responsibility to screen what your children watch NOT DISNEY/PIXAR. they have done their part by saying. \"HEY, GUESS WHAT? THIS MOVIE IS ABOUT SPIES. SPIES SOMETIMES KILL PEOPLE. THAT'S WHY WERE PUTTING A PG RATING ON THIS MOVIE\" just get over your selves you jerks.",
  "28": "While Cars 2 is visually stunning, it is the first Pixar film to feel a bit empty at its shiny center.  Mater dominates the proceedings (a major part of the film's problem since he works better as a supporting player) unwittingly working as a spy while Lightning McQueen races in the World Grand Prix.   This is the first Pixar film that seems geared almost entirely for kids which is a bit of a disappointment.  Still, there is enough inventiveness and chuckles to makes it a tolerable vieweing experience.",
  "29": "While not the best Pixar film, still better than most animated films, and thourghly enjoyable_x000D_The haters rating it a 0 just because they want to see pixar fall is pathetic, nothing should deserve a 0",
  "30": "\"Cars 2\" does not meet the normal standards of other Pixar films, like \"Toy Story 3\" or \"Wall-E\". However, \"Cars 2\" is a major improvement from the first one. The soundtracks are awesome and resemble those of real spy movies. Overall, \"Cars 2\" is packed with action, but contains jokes that are lame and few boring, tedious scenes. Although \"Cars 2\" does not meet Pixar standards, it does a better job than other animated films. Yes, \"Cars 2\" is not the best movie, but it is a wonderful movie to watch during the summer and blow away your heat and sweat. The extra price for 3D is worth it and the visual effects are stunning! \"Cars 2\" is a disappointment, compared to films like \"Toy Story 3\" and \"Up\", but still manages to make the audience packed with action.",
  "31": "i loved this movie it was so beautiful in the lesson it taught that friends are friends and you cant expect them to change and i cant believe the critics hated it so much saying ooh it ventured from lighting mcqueen well i thought that cars 2 was great the way it was matter is the character most kids love not because he was a main character  but because hes funny over all i would give it a 90 out of 100",
  "32": "\"FINALLY! IT HAPPENED! A PIXAR FILM HAS RECEIVED A \"ROTTEN\" ON ROTTEN TOMATOES!!! WE CAN FINALLY CELEBRATE!!!\"Okay, fine, you can have your moment, guys (don't worry, that's the last time I'll bring them into this, because I don't want the joke to stale out). After years upon years of critical success, Pixar's first true \"misstep\" arrived in 2011 in the form of \"Cars 2,\" the sequel that not many were really craving in the first place, but it was made nonetheless and it became the first Pixar film to earn a \"rotten\" score on Rotten Tomatoes. Harsh, I know. All things considered, though, I personally enjoyed the film. I get why people didn't really like it (it wasn't the most poignant of Pixar films, nor was it the film with the most heart), but all in all, it was a really fun ride with some brilliant animation, exciting action scenes and good voice acting. Sure, it's silly, it's kiddy and it's not what we're used to out of Pixar, but \"Cars 2\" is still a pretty entertaining romp for the whole family.",
  "33": "This film had a very compelling story, a relatable cast of characters, and beautiful settings. The spy plot complemented the story very well, I thought the shift of focus from McQueen to Mater was done perfectly. I really liked characters like Francesco and Finn. The film begins with an exciting and suspenseful scene on an oil rig, letting us know the character Finn will be, and giving us a taste of what the movie will be like. I also like the scene with the \"Lemon Party\" It was a very crucial and important scene that was very intense serious and suspenseful, this was complemented by Maters happy-go-lucky attitude. The film ends with Mater getting knighted in honor of his efforts to save London. This had to be one of the most beautiful moments in film history. After that, Mater and the gang went back to Radiator Springs, completing the hero's journey. In my words, Cars 2 has to be one of the best films is Cinema History",
  "34": "There are some thoughts that people will think that they gonna hate the sequel, and so does the original that the audience won't like the premise of Cars. I know people likes it or hates it, but I have to say that Cars 2 was really fun to watch and it's very exciting adventure better than the first one. The only thing that I really like in this sequel is secret agents, countries, action, adventure, and new fancy places. That's all I really enjoy myself watching this. Anyways, the story is more better developed that they make a new idea for the sequel that Lighting McQueen and Mater are going to the international world cup to win the race and then there are two secret agent spies that are facing with the bad villain who wants to destroy the cars who filled with oil. The voice acting did great and I really enjoy the new characters that they can bring more fun and more exciting to be decent and cool. The animation is pretty cool and the action scenes were awesome. I really like when the cars are chasing around with guns, explosions, and high-tech gadgets in everywhere that they race. But for my opinion, that I take it back when this movie will not be exciting as now and there's more that they came from where people think it's gonna be suck, so it's nice to make a better sequel once again for making a better cars animation. They know exactly what they can do for it and those animators are having fun for it. So that case, see this movie and see how fun that this movie will take more advantage for better animation, if you think so.",
  "35": "My 3.5 year old boy loves all Pixar movies, as do I. Cars 2 should be rated PG, not G, as it IS very violent. Guns, explosions, and killing/death are what the entire movie consists of, oh yeah and racing. We are trying to limit the amount of violence/weapons our son intakes. If you remember, even in Toy Story, Woody never had a gun in his holster, always empty.  I don't necesarily mind that Pixar went this route cause it's not there job to cater to young children. I am however disapointed that the MPAA approved a G rating for this film when it CLEARLY should be PG.",
  "36": "Read some of the reviews and I'm suprised by the responses.  The movie was great in my opinion.  My young son loved it.  The audience, including myself, laughed out loud continually throughout the movie.  Overall it was at least just as good as the first movie, if not better.  As usual pixar runs away with superior animation.  There were lots of humor designed for kids and adults.  This time around the movie was more centered around Mator rather than Mcqueen.  I am going to go against the grain here and say that the plot and storyline were well laid out and put together quite well.  If you like Pixar and the first cars movie, there is no reason you will not like this movie.",
  "37": "I don't understand where all the hate comes from. This movie rocks! It's hilariously funny, it has a powerfully deep message, the characters are so lovable and relatable, and the movie is just so much fun! I thought the first Cars was better, but still loved Cars 2. Ignore the losers on Rotten Tomatoes! Cars 2 is definitely worth seeing (maybe even twice)!",
  "38": "Very good sequel to a great animated film.",
  "39": "Truly the weakest pixar movie.It emphasised on random subplots,it was entertatining but i expected alot more!!! plus there is no racing this time so...yeah",
  "40": "I saw Cars 2 expecting it to be amazing since Cars was my favourite childhood movie and it was amazing. It was the best Pixar, has the best soundtrack for a pixar and one of the best movies I've ever seen. This was the sequal to my favourite childhood film and it was amazing!",
  "41": "I thought Pixar was better than this. I thought they were above doing cashgrabs. Well, looks like they've been corupted. Cars 2 is a movie that's made only for the money, and it shows. Yes, it's got great animation, good voice acting, and fun action, but everything else is so below Pixar's and even Dreamworks's level. It's very unfunny, Mater was so annoying, the story was so boring, thrown together, and hollow, and the whole movie is just a very mediocre and boring animated movie. C'mon Pixar. You're better than this crap.",
  "42": "The movie is overly creative with a complex story-telling that is not quite for the kids to understand. I know that Pixar can do better, and I hope they will.",
  "43": "There is absolutely NO way this film is a zero. Yes, it lacks the heart of the first one, yes Mater is the main character, and yes Larry the Cable Guy is an awful comedian, but this movie is still somewhat entertaining. For the record, if you hate Larry the Cable Guy, you probably will hate the movie as he gets about 80% of the screen time. There are a lot of things that kids will not get, but both of my daughters, 7 and 4, enjoyed it. It got a few chuckles out of me, and parts of it were pretty good. I actually really enjoyed how Pixar poked a little good natured fun at the James Bond franchise while trying to weave a story kids will enjoy. Still, rent it on DVD when it comes out, don't spend your money at a theatre to see this. As to the people who say the animation is terrible, I think you might have seen a different movie. I saw it in IMAX 3D and was blown away by the animation. The street scenes, racing scenes, and backgrounds are amazing.",
  "44": "Cars 2 does not have the same flare or attachment to the story and characters as you would expect for a Pixar movie although the solid spy story and well used car puns keep this movie enjoyable. The mane problem I found with this movie is that it was so focused on it's story telling it forgot about the characters in it. While one watches this movie they will feel very distant from the characters but they will recognize the good story and it's complexities.",
  "45": "To all of you bashing this movie...REALLY!? Lighten up a bit, ok! Take a moment and think about who this movie is made for. It's not made for you, it's made for your kids. Pixar has set the bar very high, no doubt, but when it comes down to it, they're movies are made for children. I just have to laugh at how people can be angry over a movie that is about talking CARS. Are you also going to tell me that movie is just too unrealistic!? When you see this movie, you should judge it by your children's faces afterwards and not by your issues with the plot or anything else. My 5-1/2 and 4 year old boys LOVED this movie and SO DID I! We will go see it again and I have no doubt it will be even better the second time.",
  "46": "This isn't bad, it's just not that good. Way different feel to the first, and pretty much feels like a cash grab. Not for younger kids, but not really sure who would enjoy it!",
  "47": "I actually enjoyed it. It brought back memories of the first, one of my favorite movies. I enjoyed the story, voice acting, action, and humor. It was great.",
  "48": "A VHS copy of the musical \"Hello, Dolly\" is the robot's most-prized possession. \"WALL-E\", a lonely earthbound portable garbage compactor, makes a recording of the duet \"It Only Takes a Moment\" because the song moves him, inspiring the machine to hold his own hand, in imitation of the characters who have fallen for each other, from a long-ago past when the planet was habitable. Nothing green grows on earth anymore. The detritus of human civilization, bearing a color scheme that's nearly monochromatic in its brownness, is all that's left. Overrun by trash, entire populations boarded vast spaceships, leaving WALL-E behind with the endless job of minimizing waste into stacked cubes, while the planetary refugees floated around space in what are, essentially, movable countries, displaced indefinitely from their homes. But what does hardware know about love? How can something made out of microprocessors and integrated circuits develop a consciousness? At what point in time did \"it\" evolve and become a \"he\"? It's only a matter of time before robots like Eve(as in Adam &) supplant a human race made morbidly obese by generation upon generation of insentient living. Whereas \"WALL-E\" presents a dystopian take on our extrapolated planet that's easily identifiable, \"Cars 2\"(and \"Cars\"), obscures the nightmarish elements of a four-wheeled society through the audience's supposition that this largely inorganic world is an alternate one. Under closer scrutiny, \"Cars\" starts to look more and more Cronenberg-ian, in which the pornography of auto fetishism in \"Crash\" actually gets put into practice. Let's meet the Flintstones again. Similar to the animated series, with its parodic names like Rock Quarry and Cary Granite to corroborate the Jurassic Period setting, both films use car-centric names(Bob Cutlass, Brent Mustangburger) as a means of harmonizing its metal beings with this variant earth. But when it comes to places, in which Bedford becomes Bedrock,  the conversion process stalls in \"Cars 2\" stalls, leaving the names of Paris, Tokyo, and London in its original incarnation, and furthermore, the landmarks of the cities(for instance, the Eiffel Tower) remain unaltered. Where are we, exactly? In \"Planet of the Apes\", the astronaut learns that he traveled across time, not space, when he discovers Lady Liberty in ruins, decapitated and rusting, along the shoreline of what turns out to be the Atlantic Ocean. Dr. Zaius' best efforts to perpetuate the long-standing notion of simian superiority is undermined by a chimpanzee, the archaeologist Cornelius, who unearths artifacts which proves that apes evolved from man during his cave excavations in the forbidden zone. \"Cars\" shares with \"Planet of the Apes\" the same conspiracy: the suppression of evolution. While remaining silent on the subject of man, despite the cars' admission that dinosaurs existed, they give themselves away, therefore deeming full disclosure of the timeline a moot point. Unlike Dreamworks, whose \"Shrek\" films employ a lot of pop culture references, Pixar avoids such anachronisms(the post-modernism of pastiche) yet in \"Cars\", Kenny G.'s \"Songbird\" scores a cheap laugh when a car gang puts Mack to sleep with the easy-listening jazz, causing the truck to lose his precious cargo(Lightning McQueen). This instrumental, like the videotape in \"Wall-E\", proves that man existed. Quite possibly, he's the missing link. Bolstering this theory, a VW bus, an auto-hippie, without any spoofing appellation, names Hendrix, after a military jeep voices his displeasure with the metalized version of \"The Star-Spangled Banner\". This is our earth, not some near-identical equivalent, like the one in the Tim Burton remake, where the film ends with a man staring aghast at the Lincoln Memorial, augmented with ape-like features. These cars are partly human. Vestiges of their humanity can be glimpsed in their faces. In addition to the eyes, Lightning has a tongue, while Mater sports buckteeth like a hayseed. And somewhere in the recesses of their \"brains\", these evolved vehicles remember sex. In \"Cars\", Mater throws Lightning into a homosexual panic as the tow-truck uses his hook on the auto racing car's undercarriage(read; sodomy). Likewise, the spy in \"Cars 2\", as suggested by the double entendre inherent in the name Holly Shiftswell, denotes a woman who was mustard in the sack. Unlike \"Planet of the Apes\", perhaps the conspiracy is an extra-diegetic one. In \"Cars\", Sally waxes nostalgic about Radiator Springs in the fifties. This history runs concurrently with the our timeline. What if she's lying? What if the conspiracy is the film itself, in which the narrators, both omniscient and first-person are fallible? In the climactic race for the coveted Piston Cup(\"Cars\"), a blimp hanging over the stadium reads \"Light Year\". It's a clue. Exactly what year is it in this planet of the cars? Maybe these aren't Anno Domini times.",
  "49": "Amazing film Amazing film  Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film Amazing film",
  "50": "This movie is pretty much like it's predecessor in that it is full of slick visuals, light plot and sub-plot to keep children tuned-in. Unfortunately, my kids fell asleep halfway through. I enjoyed the movie. I enjoyed the pre-movie short featuring the \"Toy Story 3\" gang even more so. Go figure!",
  "51": "I have now seen the movie Cars 2 3 times and in between have refreshed my memory of Cars. Cars 2 is FANTASTIC!! It's funny, it's clever and it's the best sequel to any movie that has been produced in a very long time. I wondered where Lightning and the other wonderful characters would end up after Radiator Springs. Total props to the creative folks at Pixar! Once again the talented people there have transformed a surreal place, time and characters to a mind blowing realistic world.  To the people that have complained about taking the America out or not making McQueen the star attraction, for one, the movie is \"CARS 2.\" Not Lightning McQueen. You all must have owned a lemon when you were much younger and you are bitter and jealous. For the ones that thought Cars 2 was \"violent\" for their children to see. I will not and would hope Disney would never apologize for the grown up interactions in the movie since Cars came out in 2006. Against your will your children have grown up and amazingly so did the characters and concept of the movie. Did your child enjoy ALL of the Shrek movies? What about the Toy Story movies? How about the Suite life of Zack and Cody? Regardless of what your personal, out of date opinion is of Cars 2 is, they seamlessly integrated new characters, an interesting mission with real world facts and may have even set up the chance for a spin off. What will you do then? Tell your child nothing changes? No one grows up? Good luck. Get over your self. Kids love this movie. So what's wrong with you?",
  "52": "What?!?!?! Pixar can make a bad film?! The Apocalypse really is near! LOL. I saw this while in Minnesota with my cousins, expecting an enjoyable experience. Sadly, it felt lie I was watching one of those straight-to-video Disney films they keep making. That doesn't mean it's unbearable. The jokes are kind of amusing, and it accidentally spoofs the summer blockbuster. I think it would have been good, if only Mater hadn't been made the main character. That really reminds you of Family Matters making Urkel the main character.",
  "53": "Well Pixar has done it again. Cars 2 may not be the best Pixar has done , it is still fun to watch. Many new voice actors were brought in for this movie, Eddie Izzard, Jeff Gordon, Michael Caine, Jeff Garlin, Bruce Campbell and many others, my favorite was Michael Caine. Caine is good in most things, and this spy character he pulls off perfectly. AS with most Pixar movies the animation is top notch, and the final 25 minutes are great amounts of CG. The film does start out kind of stupid but it then gets really entertaining. My only gripe i have about the movie, is how it differs a lot from the first film, the first film was a racing movie and very heartwarming, this one is more of an action movie and spy movie than a racing movie, plus the plot is all over the place. But the comedy is still spot on with this movie, it still has all the original characters as the original, Mater, Sally, Flo, Ramone, Sarge, Filmore, Guido, Luigi, the only one not there is Doc Hudson. Now i was wondering how they were going to do Doc for the movie, if they were going to kill him off, or if they were going to get another voice actor for him like they did for Slinky in the new Toy Story. Speaking of Toy Story there is a fantastic short film before the movie that is about all the Toy Story 3 characters having a hawaian vacation. if you are looking for a decent animated film definitely check this out.",
  "54": "\"Cars 2\" Has took away from me sweet 90 minutes, Which I will never ask back.I really loved the world race thing,good job Disney.A nice experience of relaxing movie, which combines action,fantasy, and extremely fun  and epic cars world, Which I wish to visit only in my dreams.83/100.",
  "55": "You may call it a crime to like \"Cars 2\", but I truly did. While its storytelling isn't spectacular and has similar elements that has been done before, it has visuals, humor, and well written scenes that somehow make up for it. \"Cars 2\" is a kid film that isn't shallow and stupid, it's complex and full of fun energy. It could be the worst Pixar film, but it's better than nearly three-fourths of the animated films that come out today.",
  "56": "There is a little bit of fun to be had, but Cars 2 is a very messy and incoherent film that made the fatal mistake of making the comic relief from the first Cars the main character of this one.",
  "57": "I'm a huge fan of Pixar, but not of the Cars franchise. Despite that, I still think they were decent movies. The plot of Cars 2 is pretty unique and pays homage to classics spy movies. Does it fail miserably? I wouldn't say so. Despite the lack of heart of most Pixar movies, this movie is surprisingly dark for their standards. Death is common and even torture is seen. While I think it's rather inappropriate for a family movie, I'm particularly fine with such themes and I kind of enjoyed it. The plot is not that good and I can't stand Mate, but at least we got explosions for some cheap entertainment.",
  "58": "Ok i loved this movie and the last movie but heck doc hudson my favorite character was not! And yes I know he died of cancer but still its the people who wants him to be in the movie, they should have use picked a new voice actor and the cars 3 which is comming is roughly 1 year i really with doc hudson will show up he better show up! and that is the only reason why i gave this movie 8 and not 10 overall the action and violence well it was very mild and i'd say people are being irrational because the film it self is very good for example the kids who watched it when they were say 8 then cars 2 came out they will be 13 which fits perfectly but i do reccomend this film",
  "59": "The only real reason people seriously despise this movie is that it is about cars. They complain about the consumerism and the merchandising yet forget that that is what most of the movie industry is. They say it is fine that every other company has sequels, yet they go mad when Pixar makes one. Why does Pixar have to be shamed for making a sequel, now? Even with the fact that this movie is a sequel, it has great writing and character development, and the animation is luscious and fantastic; there are little details everywhere. It should also be said that people think it's some dumb comedy; did they not watch the movie? It's an action flick, and it's a smart one at that.",
  "60": "Cars 2 is a more entertaining and fun movie than the first one. I like the character developments in both of them, yet I feel they might be the same. It talks about friendship, but also has side storylines to include more characters. Memorable and fun, with good characters and a good storyline.",
  "61": "Cars 2 was a very emotional joyride that improved on the first story. It had very diverse set of appealing characters like Finn, Francesco, and all the new racers. This film had the most representation of any Pixar film. They had very colourful backgrounds that contrasted well with Mater's rusty shell. I liked the airplane scene, though short, it showed the development of Mater and McQueen's friendship. The animation quality became way better than the original Cars allowing for the animation of the many gadgets that Finn uses. Miles Axelrod, was a very cunning and well written character, the twist that he was the head lemon was hinted at throughout the whole movie and was beautifully implemented when it was revealed. And Cars 2 showed that Pixar know about ongoing racism and is not afraid to tackle it by the use of the \"lemons\". The lemons are oppressed and want to change, but the world is not kind. The social story of lemons was a very inspiring addition to the film. I recommend the people should watch this, young and old, it doesn't matter if you haven't seen Cars 1, everybody should watch this beautiful tale of action, espionage, emotion, society, and friendship. I watch Cars 2 a few times a day, that is how beautiful it is.The jokes were very funny and enjoyable, and there is a wonderful magical empowering score befitting a story like this. Mater reminds me of Steve Rogers when he said that \"I know what you're going through. everybody has been laughing at me my entire life too, but becoming powerful and rich beyond your wildest dreams ain't gonna make you feel better.\" this has to be one of the best words spoken in film history, though the some of the lemons were not swayed, I was, and I live by those words. This movie, no, this Masterpiece has made me a better person.",
  "62": "Watching Cars 2 is like being a kid again. Some say it's cash grabbing, Pixar selling out just so that Disney can sell toys, but when I was watching it all I saw was the animators' love for cars. This was made for fans and not for adult critics - how they reimagined locales and included all the different cars and vehicles. It does differ than most Pixar movies in that it's not as \"emotional\" or heart touching; I actually think other Pixar films are over rated and feel like they're always trying to force scenes to make adults cry or something. But the spy themed story was pretty complicated and very similar to say Quantum of Solace. Some people found Mater to be annoying and I thought so too at first but after repeated viewings I could understand him and his friendship with McQueen felt more real. The jokes were enjoyable and definitely smarter than animated films from other companies.",
  "63": "When there are parents and children up and walking around the theater literally during the entire movie, you know it's not holding anyone's attention.  Most of the best jokes are in the movie trailer.  We were very disappointed.",
  "64": "I'm honestly surprised by all the hatred this movie has received. Sure, it's not a GREAT movie, but is it terrible? No. It's a decent movie with a few funny moments and some spectacular animation, but it probably is Pixar's \"least best\" movie. Still worth seeing, though.",
  "65": "This movie lacked a few things like: A coherent storyline, compelling or likable characters, and, generally, everything that made most Pixar movies memorable. It was clear that many people were losing interest in the movie, kids and adults alike, as people struck up conversations, or walked about. While watching, I couldn't help but feel that this was similar to early Dreamworks Animation movies that tried to copy Pixar's style rather than an actual Pixar film. All in all, it felt like a cash grab that purposely misled customers through their ads by not telling us that Mater was the lead in this film - not Lightning McQueen as the ads portrayed.",
  "66": "Pixar's first true bomb. Even technically, it's at best of average and inconsistent quality. The first few scenes in Radiator Springs made me gasp out loud at how hurried and lifeless it looked compared to the loving attention to detail given to the first film. With cutout facsimiles of the original characters, an overly complex, confusing and dialogue besieging plot, and devoid of the heart and wit found in every other Pixar movie, I look forward to the documentary made to reveal the truth about how this awful train wreck of a movie came to be. Unbelievably disappointing.",
  "67": "Okay Pixar has let us down completely, Cars 2 is boring, occasionally funny, and just terrible story telling right in the middle of it. And um where is all the heart Cars had which got it all the good reviews. Hmm Pixar can we trust you. And most of all making another Cars means that this franchise has no place in the other world that Pixar has created. Which makes it the more disappointing. I give this film a 32% of a good movie.",
  "68": "A plot somewhat long and boring, something that would use as a punishment in case my children do something wrong. Expecting much more than this sequel, very bad pixar.",
  "69": "Car 2, a John Lasseter film. This piece of crap does not deserve to where the Pixar label.  The only redeeming quality of the film was the incredible location artwork.  Lasseter vilifies the very industry that supplies the raw materials used to make all the plastic toys they hoped to sell.  Pixar should not bother with Incredibles 2 if it will receive the same treatment.",
  "70": "Is it just me or did Pixar focus way too much on the action than on their beautiful moments they have done in the past? (Toy Story 3, Up, WALL-E, etc.) In this movie, Mater is the protagonist rather than Lightning McQueen. They're off to Tokyo, Japan. After that, the movie went down too hard. This isn't James Bond or Mission: Impossible. We don't need a sequel to Cars. We don't even need Cars 3.",
  "71": "Ok I agree that the animation is really good, but the complicated plot was definitely not made thinking of a young (little kids 3-8 year olds)_x000D_ Most of the reviews that gave them a 10 or a positive review was thinking as an adult but if you remember that this movie is supposed to be for little kids, they failed tremendously._x000D_ I was completely shock with the amount of guns and violence, seriously for a pixar's movie, how can Disney allow this?_x000D_ As a mom of 3 little boys who adored cars and their whole world and my wallet was all about cars they really messed it up. They were frightened by all the gun power of the first 5 minutes and they were lost in the plot._x000D_ Who ever made the plot (probably a James Bond Fan) totally forgot who his target  audience was, young children!_x000D_ Do NOT take your little kids to watch this movie unless they are over 8 probably or take them if you are one of those parents who could care less about the amount of violence their child's watches_x000D_The toy story short at the beginning is the only true terrific thing about the movie and the animation, the technical part.",
  "72": "This film is terrible. You may ask yourself, why did Pixar make a sequel to their objectively worst film ever? Why give Mater and Larry the Cable Guy, arguably the worst \"comedian\" ever, more screen presence? I'll tell you why. Cars has made 8 BILLION dollars in merchandise sales since it's release. Yes, 8 billion. $8,000,000,000. Really, they would be stupid not to make another one. They are, after all, a business. They're in it for the money. But they should seriously at least attempt to retain their artistic integrity. Since Cars, Pixar released not only their four greatest films, but four of the greatest animated films ever made. They broke their streak with this film. They're artistic geniuses, they're capable of so much more, yet they squander it on this trash. They sacrifice their honor in the name of the all-mighty dollar. So take your kids to see this piece of filth, buy them their Cars toys and backpacks and lunchboxes. Contribute to the artistic downfall of the greatest animation studio ever. This is a terrible film. I gave it an honest chance because Toy Story 3 was a sequel that outdid both of the previous films, proving Pixar can pull of cashgrabs while making a quality film, but this is a piece of trash. If Brave doesn't prove they can continue the quality we saw in movies like Wall-E and Up, I honestly will lose all faith in Pixar.",
  "73": "Big mess, lot of noise, the audience is not required to understand what's going on, who and how. Humans are replaced by talking cars, boats and airplanes, to get used to that half of the movie would have gone. If this movie is intended for kids, they didn't understand it, if it is for grownups they didn't like it. There is no real storyline, scattered events, non-related, just to have the two hours gone, but very slowly, boringly.",
  "74": "Terribly disappointing.  Very little attention paid to the characters or the animation.  Clearly a money grab.  Avoid this movie at all cost, the studio should pay for the crap they have delivered.",
  "75": "Very disappointing! Rambo is a kid story compared to this unbelievable Cars 2! If I knew the movie would be so violent I wouldn't take my son to watch it!",
  "76": "We didn't make it to the end of the movie.  My daughter was so bored she was running around.  We had to leave and that did not bother me.  I guess I will get it when it comes out on DVD but I am glad I did not pay for 3D.",
  "77": "Let's start with this. I'm going to guess that Pixar did not devote enough effort to this movie. Given a cursory glance at the credits, it seemed unusually short for a Pixar movie, but I could've been distracted. Remember also that the release date was move up a year from the original 2012 release date for unknown reasons. It seems that Pixar is under pressure to get movies out every year, rather than focusing on quality, which is quite honestly, a disturbing trend. It shows in the movie as well. The story is a blend of a spy movie with the normal Pixar themes of \"don't ditch your friends\" etc. The spy sections work well. The normal Pixar themes feel forced and unnatural in the context of the plot. Mater has his moments, but is not a strong enough or deep enough character to carry the movie and ended up being very annoying towards the middle of the film. The animation is as always fantastic, the sets were awesome, the water physics are getting much better, can't complain much there. That being said, Cars 2 is still a pretty fun ride. But it definitely wasn't given the attention that it desperately needed. Hopefully Pixar's just saving it for Brave, their next original movie.",
  "78": "I will say that the movie was very good and worth seeing. On the other hand, i don't know if seeing it a second time is in my close future. I heard a review saying how it is hard to make a good movie like this because cars don't have hands and using front wheels as hands is a stretch. I halfway agree with that, but i still say you can't hate this movie. Go see it once, but I don't know about a second time.",
  "79": "I'm glad the drive-in theater i saw this movie at showed this movie as a double feature with pirates of the Caribbean, because if it would've just shown pirates, I would've Demanded my money back.  This movie was a hilarious comedy good for all ages.  I saw this movie with my friend, and i'm really glad i did, because we we were laughing so hard the movie became a real bonding experience.  Mater (voice by Larry the Cable Guy) makes the movie funny, going into the ladies room in japan, mistaking wasabe ice cream and going gonzo with the voice activated disguise machine is adds to the enjoyment of the movie. Love how they brought in popular T.V. shows in with The F/v Northwestern (Crabby, voice by Capt. Sig Hansen) .  A message to those of you who didn't like this movie, \"don't get your prop in a twist,\" and go see the movie again. \"",
  "80": "It put several smiles on my face, i laughed several times, and I greatly enjoyed it!I'm not sure how people didn't like it...It isn't that I'm a die-hard Pixar fan and will like anything they put out. But, craftsmanship, quality, and an understanding for what really makes a humorous, yet not passively-aggressive-minded movie, shows through every frame of this movie. I'm so confused as why people don't like it. It's brilliant!If anyone from Pixar is discouraged by these ratings, and happens to be reading this, just keep doing what you've been doing. Don't let other people tell you who you are ;]",
  "81": "This could be the first Pixar movie that disappointed us. Just like all Pixar films, the visuals and effects are stunning, but we have an under-plotted and messy story to go with it.",
  "82": "while theres not alot of character development in here it is still a site to see......................................................................",
  "83": "As a pixar loved, I loved the first cars (well technically all of them), but the second was a BIG MESS! What happened here? boring characters, predictable spy plot and a lot more!_x000D_Try harder, Pixar.",
  "84": "I'm not sure I hate this film because I just hate racing film, or this whole thing, but this is definitely the worst Pixar film so far.",
  "85": "The worst Pixar movie ever. This is Pixar's bottom of the barrel and I hope they never ever do a disaster like this anymore. I'd already said it: spin-offs or sequels with the comic relief from the previous movie as the protagonist are destined to be BAD and this movie proves me right, it's no exception.The plot has absolutely nothing to do with the previous movie and focuses on a \"James Bond\" kind of spoof, what a brilliant idea, Pixar. There's nothing emotional, there's nothing exciting, interesting, there's no cute message, there's no conflict, there's nothing \"Pixar\" in its writing, the magic this company has is absolutely missing in this and it's nothing than an hour and a half waste of time. This is not a movie that was made to tell a story that people from all ages can enjoy and get something from, this is a soulless product that was made because Disney and Pixar want to sell more Cars toys and make a movie just with the money in mind without caring about anything else is the worst thing any filmmaker can ever do, it's the most deadly sin in cinema.Cars 3 is a far superior movie (Still not a great movie) and it's what this movie should've been in the first place.",
  "86": "a loving comedy but its dumb why pixar u dazzle us with ur crative mind but not anymore i rather say go see KUNG FU PANDA 2 then this. this should be uses as a punishment than a gift",
  "87": "Every great album has dynamic contrast... just like Pixar's now 20 year + output. Don't let the naysayers fool you. Cars 2 is an amazing action movie with heart and smarts and so much soul. There is so much depth in this movie. I don't know how anyone could miss it. The movie does rehash some action, comedy and spy movie conventions, but what it also does is keep you invested in the characters - especially Mater. I never knew I could care so much for a rusty old tow truck! I think that anyone with an open mind to culture and diversity will embrace Mater as the lead, and invest in his character arc. In my opinion, the critics who are giving this movie poor reviews are not only missing the point, but are being left in the dust by John Lasseter's craft. Not every movie has to be Wall-E (which I ADORE) or some pretentious, art-house bag of air to have innovation, heart, soul and intelligence. Cars 2 is another milestone for Pixar. Go see Cars 2 and be a kid again... and an adult.",
  "88": "As a major Pixar-Disney film lover, this film crushed my heart into a million pieces.  I openly hated the first Cars film, but convinced myself this was Pixar's way of apologizing and making up for it.  Going into the film with incredibly low expectations (for both my memory of the first and poor reviews critically) the film was still worse than I would had anticipated.  The characters are one-note, we never see anything endearing about these characters or really get to know them on a personal level.  They do not have the instant lovable quality of any other characters which is not just because they are cars, Wall-E made robots look cute and cuddly after all.  For a studio as progressive as Pixar I found the portrayals of characters in the film to be stereotypical and unfair and bad representations of the countries in this film (as the plot takes place and features characters from around the globe.)  Mater is the single worst character in Pixar's history and it is a slap in the face that they made him an even larger part in the sequel, which is no doubt the worst film in Pixar's history, it should have been scrapped or made straight to dvd.  I have faith in them still, as I loved the Toy Story short before this atrocious film.  Fingers crossed for Brave and all their future ventures.",
  "89": "Terrible Terrible ! I Adored Cars 1 , But this oh myy.. Can they really have Cars MURDERING each other in kids movie ? Im sitting there with my 4 year old tot and cars are murdering and carrying weapons , barking death threats oh my gosh it was just WOAH ! Well who are we to talk , Pixars making MILLIONS AND MILLIONS off merchandising . Wait.. Oh ya ! Thats why Cars 2 was released. Oh the money (:",
  "90": "I don't think I have ever or will ever again give a 1 out of 10 but Cars 2 deserved it. I mean Troll 2 and The Room were at least funny when they were bad. This film made me want to vomit. Larry The Cable Guys dumbed down stupid jokes are only funny for a little while then they just become borderline retarded. Don't ever waste your money on such a horrible film.",
  "91": "cars two was a better sequel . everything is just like  the 50's like james bond  . but people and critics hated  it it is 99 % true it does suck  .   but i hope there's not a cars 3 . larry the cable as matter is gay  that's not an a opinion it is true",
  "92": "I liked the original Cars movie.  This one is amazingly boring.  I didn't laugh once the entire movie.  The kids in the theater were restless as well.  Very hard to follow, especially for kids.  It looks spectacular, of course, but does not deliver on content.  There is a lot of action and explosions, but lacking the heart of other Pixar films.  This is the first Pixar film I haven't liked (although \"Up\" was barely acceptable for me).  There is a 5 minute short before the movie featuring the Toy Story characters, and it is better than the feature film!",
  "93": "cars 2 no me gusto y no se por que hicieron una secuela  a su precuela cars de 2006_x000D_no me gusto esta pero si la primera  y no merece secuela cars 3 es aburrida",
  "94": "[adult review]I am a huge Pixar fan.  The only Pixar movies I don't like are the original Cars and of course their worst movie ever, Wall-e.  That said, I didn't like Cars 2, but I disliked it less than the other two aforementioned movies.  Overall I'd say this movie scores 1 from an adult perspective.[child review] to be fair this movie is really just for kids.  And viewed from that perspective is an entirely great movie.  Lots of action, bright colors, and funny characters.  From the child's perspective I'd estimate this movie would hit around about an 8.  Thus, my score is the average of the two rounded down to the nearest number.",
  "95": "It is a real shame to see Pixar finally release a bad film after such a wonderful streak of excellent animated films that are perfect for both adults and children alike.  Cars 2 was just a completely unnecessary idea and obviously only exists for Disney to sell more toy cars to children.  It's a shame, too, because Pixar is better than this.  Cars 1 was average at best and by far the worst of Pixar's outings, yet they are forced to push out a sequel to it instead of more deserving films like The Incredibles.  This film just shouldn't have been done and hopefully there will never be a Cars 3 because I don't want Pixar's legacy to be tainted further.  Avoid this one.",
  "96": "There are many things that are just wrong with this movie. This movie was unwarranted. The first movie ended at a good note and didn't need any following, plus the story they went with is unnecessary. I don't know about most people, but I didn't need to see a movie where the characters travel to a World Grand Prix, which is pretty much a story line that could have been used as an epilogue for the first movie. The spy story line was fun for the first scene but quickly transformed into a pointless story line for the only purpose of giving Mater more screen time and creating situations that he can act \"wacky\" in. The movie also attempts to cover up the fact that it was made for money by making some half-assed message about friendship. However, the animation is great, which is no surprise for Pixar, so the whole movie is far from being ugly like some other animated movies (Gnomeo and Juliet for example). Some parts are enjoyable, and I wasn't quite depressed until I got out of the theater and stopped trying to create excuses for the film because it's Pixar. I hope Brave and Monsters University is better than this.",
  "97": "I consider myself a great Pixar fan, I have loved every movie since Toy Story but in this one, I can just say: I **** HATE MATER!!!    .",
  "98": "Part 2 falls flat on its face, the story plot is too deep for young minds, too much gun play for a childrens movie, my wife and I walked out about half way through.  Probably one of the worst movies I have seen in a long, long, long time.",
  "99": "As an ardent fan of the first Cars, I'm shocked at what an absolute mess this movie is. I expected to be a bit disappointed; I didn't expect to leave the theater shaking my head. By far the worst film ever released by Pixar, this one officially breaks their magic streak. They took all the heart and artistry of the first movie, and just chucked it out the window on their way to cashing in on all the merchandising possibilities. Owen Wilson may as well have not even shown up, because McQueen is relegated to a minor character in this film, as Mater becomes the centerpiece of a ridiculous (and almost completely unfunny) spy plot. Many reviewers have commented this was aimed at younger audiences than the first film, but no children's animated film you will see this year (or possibly ever) does more to glorify gun violence._x000D_Occasional glimmers of humor and clever touches are eclipsed by a bewildering, written-by-committee plot that tries to do too much and accomplishes too little._x000D_Upon leaving my 5 year-old son asked me \"What was that movie about...?\" I honestly couldn't answer him.",
  "100": "Pixar finally broke out of the Pixar mold. Toy Story, Monsters, Bugs LIfe, Cars, etc, were feeling like the same basic story just with a different looking set of characters. Inside Out still has some of the classic Pixar moves, but they added some nice original moves to make this feel like something new._x000D_ While I give it a 10, it is not perfect, but it is one of the best animated movies in years. Yes, the ending is predictable, but how they got to that ending is not. It is a well thought out universe with characters you can love._x000D_ If you love Pixar movies, this is a must see. If enjoy animated movies, very good chance you will really enjoy this. If you love mindless violent animated humor, skip this.",
  "101": "After a slightly disappointing run for Pixar in the last few years with movies like Monsters University and Cars 2, the power house of animation gives us their most thematically complex film since Wall-E. In Inside Out , the life of an eleven-year old girl named Riley is shown to be controlled by five voices inside her head: Joy, Sadness, Disgust, Fear, and Anger. They control her emotions and affect her memories, but Riley's life is thrown out of control when she moves to San Francisco. Her core memories, the most important ones, are thrown out of the control center as well as Joy and Sadness, so they have to journey back to put Riley's life back on track. The plot itself doesn't contain any big twists or even a villain. It's a seemingly simple tale with huge ambition. Showing what's going on in someone's head is a difficult feat, but Pixar achieves this in such a creative and original way. The ideas presented in Inside Out might fly over younger kids' heads, as there are some rather complex themes here: you can't be happy without experiencing sadness or anger or disgust or fear. They are natural parts of life. The film even deals with depression, identity, and self-worth. Inside Out is undeniably the most enjoyable, hilarious, and entertaining film that incorporates such heavy themes. It's certainly not a movie you will ever forget.",
  "102": "Inside Out is amazing. The amount of emotion, insight and catharsis on offer in this animation puts most serious adult films to shame. This is a film that truly makes you laugh and cry... Often at the same time. Pixar have set a new bar for themselves with this masterpiece.",
  "103": "If I had to either choose this movie or Star Wars: The Force Awakens, it'd be a difficult thing because they both are obviously great movies and they're one of the best movies of 2015. Inside Out is a definite must-see and you're really going to love it! Be sure not to miss this or Star Wars: The Force Awakens whenever they come out on respective Blu-rays. Best animated movie of 2015!_x000D_ This movie has favorable characters and a favorable story. As everyone of us are controlled by emotions, it's same to say that Riley is controlled by her emotions just like us and without Joy and Sadness, she changes throughout the movie. My favorite emotion is Joy because Joy is happiness and so is this score I gave to this movie._x000D_ Oh, don't mind the haters. That takes a while for Anger to appear and get mad. If you want to give this movie a negative review, no problem. Don't do it here, do it on my 0's. It's better that way.",
  "104": "This is  really cute film.  The story is engaging.  The voice acting is strong.  The animation is great.  This is not the first story idea where aspects of a person were broken down.  But it is the best one yet.",
  "105": "Do you ever look at someone and wonder, \"What is going on inside their head?\" Well, the reality is the answers pretty dull. It's just a big brain sending messages across your body to determine your actions. But in the minds of the creators at Pixar the answer has no limits, with every persons head containing a fully functioning world, where small beings create and store every idea and memory we have in life. And at the centre of this world is a control panel, similar to something like the deck of the Enterprise, which is controlled by our emotions that lead us through every decision we make in our lives._x000D_ Inside Out follows a girl named Riley (Katilyn Dias) and the five emotions that lead her every action- Sadness (Phyllis Smith), Fear (Bill Hader), Anger (Lewis Black), Disgust (Mindy Kaling) and Riley's most important emotion that has shaped all of Riley's core memories that make her the person she is, Joy (Amy Pohler). They all care for Riley and one another like one big family, always looking to give Riley the best life she can have. This includes everything from remembering to avoid Broccoli to maintaining Riley's goofy attitude to remain her parents happy little girl._x000D_ But Riley is entering a difficult period in her life of great change. She is moving to a new home in San Francisco, leaving her friends behind, and her father has become too busy with work to look after her the way he used to. This causes the emotions to conflict on the best way to deal with it, with the ensuing chaos causing Joy and Sadness to get lost in the furthest reaches of Riley's mind and forcing them to go on a journey to return to the control room, or Riley might never be happy again._x000D_ In some ways the film is a nice reminder of how even after 20 years, Pixar has stuck to what made them so engaging to audiences to begin with. The journey that Joy and Sadness go on is a great buddy travel movie, that's in a similar vein to Buzz and Woody in 'Toy Story'. And just like 'Toy Story', Pixar has continued to remain focused on developing memorable characters that will help shape many childhoods, with the likes of Joy's energetic personality and simplistic but lovable design bound to stick in our heads the same way that Buzz Lightyear did when 'Toy Story' was first released._x000D_ But in other ways the film is a reminder to show how far both Pixar and CGI animation has come, with the worlds Pixar's movies take place in going from the constraints of a child's bedroom to creating an entire world within the mind of a child. And the world that they create is something truly special. Other films have taken place in a person's mind in the past with their own distinct styles, from the epic mind bending action of 'Inception' to the fragmenting chaos in 'Eternal Sunshine of the Spotless Mind'. But no other film has ever approached the inner workings of a mind with the same creativity as Pixar has._x000D_ The film includes as much as it could of developing how a mind works and what an 11 year old girl would be thinking about, incorporating it as either a great gag or as a way the world is designed to function. There's a literal train of thought that's able to carry memories across Riley's mind, a place called Déjà vu that keeps popping up, and even a dream centre that operates like a movie studio to give Riley something to watch at night. Even small sayings like getting a song stuck in your head are incorporated in to the film in some of Pixars funniest running gags to date. Plus I'm relatively certain that anyone who's seen the film will be humming Triple Dent Gum for the rest of their lives._x000D_ As always, at the films heart remains the human drama that has kept Pixar movies so relatable over the years. In one of the most touching scenes, we watch as Joy turns on one of Riley's treasured childhood memories of her skating to pick up her spirits and slowly begins to skate with her in perfect synch. It's a beautiful moment where we're shown both the close bond that Riley and her emotions share, whilst reminding us all on the way we all hold on to out childhood in a way that only Pixar can._x000D_ It's moments like this that can be universally related to, mixed with Pixar's stunning animation and their ability to create such original worlds that ensures Inside Out is another addition to Pixar's constantly growing collection of treasured classics.",
  "106": "This was very good...but there was a bit in the middle where it seemed like the same reoccurring problems kept happening on their journey.   That part got repetitive.   Also, there are a lot of very emotionally sad things that happen through out the movie.  More sad things than happy things.  I would say that this movie is 60% sad and 30% happy and 10% indifferent.  Its good for adults ..but for kids....its mostly sad.   Example: losing a childhood thought is very sad for kids to understand.  Overall its a good movie.",
  "107": "A colourful, vibrant, brilliantly animated, and exceptionally moving film, Inside Out is one of Pixar's most creative and well-executed efforts in years; this is owing to its fleshed out characters and excellent voice acting from Amy Poehler. Easily the best film of the year. A+",
  "108": "My favourite movie of the year. A simple as that. Sorry for not being more specific, but I can't, it is that great. All of it. The story, the animation, the idea, the way they deliver this idea (that it is not precisely new), the lessons, the feelings, everything. Pixar has outshined many of their (we know, excellent) work. This sits easily between the best of Pixar, Disney and all-history animation movies.",
  "109": "Inside Out is a very funny, charming movie.  It does have a few issues around it’s plot and a couple of it’s characters, but I would argue it’s worth the price of admission.  Pixar haven’t been this imaginative in a long time.  It’s a really cool world and I would definitely not call this an Osmosis Jones rip off!!  It has too much of it’s own identity in order to do that.  It’s really cute, really charming and it might actually get a bit of emotion out of you.  This is also not one just for the kids.  The adults will get something out of this.  Special props to Amy Poehler, Phyllis Smith, Lewis Black and Kaitlyn Dias who are all particularly good in their roles.  This won’t be for everyone and I imagine some people may struggle with this film, but I would say if you are willing to endure, it’s worth it.",
  "110": "'Inside Out' is the 15th feature from Pixar Animation Studios, and is directed by Pete Docter who also directed 'Monsters Inc' (2001) and the Oscar winning 'Up' (2009)._x000D_ 'Inside Out' focuses inside the head of a little girl named Riley, inside we meet the \"little voices\" and they are five different emotions. You have Joy (Amy Poehler), Sadness (Phyllis Smith), Fear (Bill Hader), Anger (Lewis Black) and Disgust (Mindy Kaling). They all control how Riley should feel and decide when it's an appropriate time for her to feel that emotion._x000D_ Joy is the main emotion here, she is always concerned for Riley and wants her to have a good day, every day. The way Joy feels connected to Riley reminds me of the way Woody feels connected to Andy in the \"Toy Story\" franchise. She always wants the best for her, and when Riley feels something, Joy feels it too._x000D_ 'Inside Out' is filled with some beautiful and colorful animation, a heart-wrenching story and some sympathetic characters. It's one of the best Pixar films since 'Toy Story 3' (2010). Whereas 'Cars 2' (2011), 'Brave' (2012) and 'Monsters University' (2013) failed to live up to expectations._x000D_ There isn't a lot of comedy in this movie which can be worrying if you are a parent or guardian that's planning on taking your children off to a trip to the cinema. They would probably find 'Minions' (2015) more cheerful and silly, 'Inside Out' is mostly for adults to enjoy, there is nothing wrong with that, but children will no doubt find this movie very distressing._x000D_ Pixar Animation Studios is very good at making their films enjoyable for adults, in that when you watch films like 'Toy Story' (1995), that film basically says \"We are all connected to our toys, remember when you were a child and had that one special toy?\", or 'Monsters Inc' (2001) would say \"When we were all kids, we all had those dreams of monsters creeping up in our bedrooms\". Pixar is good at tapping into an adult's childhood._x000D_ But I don't want to sound too negative to this movie, maybe kids will enjoy it, all I am saying is, 'Inside Out' is in many ways a classic. A film to be remembered in years to come, I could see sequels and spin-offs based on this movie alone. It's definitely an Oscar winner for \"Best Animated Feature\", it is touching, inventive and just a gorgeous looking movie.",
  "111": "Hands down one of the best Pixar films in a very long time. The one and only thing I was confused about is the audience it is indented for. I felt like it is unlikely that young children would be able to fully understand the meaning of the film and that the film is mostly intended for a bit of an older audience.",
  "112": "OMG, This film is fantastic! Nobody I know, unliked it. I like that this film talks about psychological topics, like depression. I would watch it 1000 times! Can't wait to see it on TV.",
  "113": "Genius is an over-used and therefore devalued word, but Inside Out is what it looks like._x000D_ Watch it here for free http://www.watchfree.to/watch-2a2ec6-Inside-Out-movie-online-free-putlocker.html",
  "114": "Even though the ideas, writing, and comedy is professionally written and fresh, I do not like the concept that people are governed solely by emotions. Maybe that's just me being nit-picky. Other than that, the movie had very dramatic twists, lively and colorful environments that made up for any other things for me to pick at.",
  "115": "This movie is a big step in stories from Pixar, this is totally out of the box, well writen and thought. A great group of characters and one the best animation movie these years.",
  "116": "A PERFECT movie! Finally they say it's okay to be sad when things change. I think this movie spoke more to adults than children.",
  "117": "For such an original idea, the movie was surprisingly cliched and predictable, but cliched and predictable doesn't mean it wasn't fun. There are a ton of humorous little details squeezed into this film, and the overall idea of emotional balance isn't a bad one. The visuals are quite solid, and the characters are enjoyable enough for what they are, even if they are mostly a bit two-dimensional._x000D_ Still, it is cute and I was entertained the whole way through, so that's gotta count for something.",
  "118": "Delightful! I truly think this is the best animated movie ever. But that is just me. Some people may not find it so entertaining or satisfying. It's a family movie not doubt. It is smart, funny, deep, original, sad, disturbing at times, complex for such genre. All in all, high quality stuff. I recommend it wholeheartedly.",
  "119": "Fantastic animated film which actually is one of 2015´s best, period. So intelligent and bright. Great for kids, amazing for adults. A very strong 8.5 out of 10 from me.",
  "120": "Heading into this movie, I had high expectations, since it is Disney/Pixar, but I also thought that I wouldn't thoroughly enjoy it, for it would be too juvenile. But I was wrong. This movie had tons of adult humor from beginning to end, in addition to several teary moments which will warm anyones heart. I strongly recommend this for all families to see together at some point--and bring the tissues!",
  "121": "I took 4 kids (3 girls & a boy) aged between 6 & 9 to see Inside Out. At the halfway point I was a little concerned that the movie was pitched a little too old for them. I need not have worried - they all came out talking about how much they enjoyed it_x000D_ As an adult, I think Pixar nailed this one 100% - I don't recall a movie that sucessfully tells a story on so many levels. Funny and clever with a couple of tear-jerking moments that left a big lump in my throat_x000D_ Highly recommended",
  "122": "Pixar's best film yet! They flirt with the idea with emotions and what's going on in someone's head, It's smart and unique. Riley (Kaitlyn Dias) is eleven years old, she loves hockey and she's from Minnesota. Her world turns upside down, when she moves to San Francisco with mom and dad. Riley's emotions led by Joy (Amy Poehler) try to save her from this life changing event; the stress of Riley moving is bringing sadness (Phyllis Smith) to the forefront. Joy and Sadness are far behind Riley's mind, trying to get to headquarters meanwhile, Anger (Lewis Black) Fear (Bill Hader) and Disgust (Mindy Kaling) are struggling without Joy and Sadness. Inside Out gets under my skin in an emotional way, which Pixar does with it's films, it does something different. At the end of the film you will be happy and interested. Grade A+",
  "123": "Inside Out se une a mi lista TOP 10 de los mejores estrenos de este año y también se une a la lista de las mejores películas animadas de todos los tiempos. Pixar llego a tener sus bajas (Cars 2 o Brave) pero con Inside Out vuelve a la grandeza, una poderosa historia inocente, divertida, dramática e innovadora para chicos y grandes (recomiendo ver esta película con la familia, sobre todo padres e hijos) La animación, la historia, todo es increíble, sin duda alguna el próximo OSCAR para mejor película animada es para Inside Out (y tal vez entre a \"mejor película\") Un espectáculo visual divertido y conmovedor",
  "124": "Its really good considering the terrible things they recently do.. Its pretty fun and im assuring you its going to be best pixar movie in this year. Probably my favourite cartoon movie this year..",
  "125": "From the great minds at Disney/Pixar comes an animated comedy about all of our humble minds and the little voices in our heads, when 11 year-old Riley’s life takes a dramatic turn, the little creatures that control emotions do their best to help while embarking on perilous adventure through the fantasyland that is the human psyche._x000D_ After the recent disappointments of the repetitive and one dimensional ‘Minions‘ and ‘Home‘, Disney & Pixar have once again set the standard for modern animation with a film that works on multiple levels and across generations, only this time the result is a delightfully written tale particularly effective for mature audiences, as individuals or families._x000D_ The extensive writing team plus directors Pete Docter & Ronaldo Del Carmen manage to weave together a wonderfully inventive story that’s simultaneously a family comedy/drama, coming-of-age story and a fantastical adventure featuring creatures that personify human emotion within a fantastical world, which very cleverly makes tangible the complex notion of the human mind and how, quite literally, the “inside” fundamentally affects the “out”._x000D_ ‘Inside Out’ does a commendable job of using complex psychological concepts like the subconscious and the intricacies of memory within an engaging narrative about the power and changeable nature of human emotion, all by framing them within characters that you’re rooting for from start to finish (both inside and out) and using humour with pathos while cleverly & hilariously implementing emotional references that everyone will relate to._x000D_ No doubt this movie makes liberal and “creative” use of psychological concepts, even creating some of their own and it’s simplistic when it comes to the notion of emotional balance… and yes the film has an inherently sunny disposition and sentimentality that may not be for some, but it’s never over-the-top and always creatively handled with the result being surprisingly touching, ‘Inside Out’ may yet turn out to be a great way of teaching children (and adults) about their emotions as they grow the same way that Dr. Seuss’ book taught kids life-lessons while providing a moral compass._x000D_ The Bottom Line…_x000D_Clever, creative and engaging on many levels, ‘Inside Out’ is a wonderfully inventive adventure of the human psyche and surely another instant animated classic to add to the growing list from Disney & Pixar.",
  "126": "The movie Inside Out is visually for kids, but the story is more for adults understanding their children. Finding the kid in themselves again._x000D_ Connecting to relationship that gives us happiness and the same time sadness. Invest to the right people. What I like about it, the have a logical representation of time processing in a decision making. That's when we understand, why we do the things we do. This evaluation process, is skipped by immediate reasoning._x000D_ Only few people will take time to emphatize. Prioritize other's feeling before them. This is what we loss when we are busy growing-up for the wrong selfish reason._x000D_Railey a twelve year kid, took the responsibility to deny herself the feeling of sadness; to make lighten-up her parents' burden. A conflicting feeling for a kid to take. I think she'll grow-up a humanitarian.",
  "127": "It's sweet, it's funny, all of the characters are amazing and the depth and complexity of the story is mesmerizing. Even if the animation isn't up to par Inside out is up until now the second best animated movie ever. The whole story is great, the interactions between Fear, Anger and Disgust are hilarious and Joy's and Sadness's journey is sad and brilliant. Another fantastic thing about it is how emotions, dreams, long-term memory and everything else in Riley's mind is portrayed. This film was amazing and fun to watch.",
  "128": "The return to Pixar golden age. Inside Out is original and brilliantly animated (as you would expect for a Disney film). It also has a beautiful and subtle soundtrack, which contributes to bring up the insane amount of emotion and honesty the movie displays._x000D_ Even so, its best features rely on powerful imagery, cleverness and conceptual discussions: it is one of those movies you can watch several times and discover new things again and again. In a couple of moments, the movie might be excessively abstract and thematically challenging for small children (something I have never seen in a Pixar movie, their movies respect and don't underestimate kids as other animations. But in this one, subjectivity has reached new levels). However, it's nothing that can really harm the overall experience for them: at most, parents will like the movie more then the children.",
  "129": "This is one of the best movies for kids -- ever. This movie takes emotions head-on, and the utility of providing kids some kind of a mental map of how their emotions work is empowering and potentially life-changing. The movie is not perfect: emotions might play a huge role in our lives (especially kids), but they are not the only things that control us (though to be fair, the movie does not make the characters simply robots controlled by their emotions), and there are are a few minor stereotypes. However, the merits of Inside Out far-and-away outshine these foibles. Plenty of meaty issues to talk about, and even hints at more to come in kids lives. Shows emotions co-operating (and sometimes competing) to try for the well-being of their characters, and shows that everyone has emotions and that emotions can be complicated and nuanced. I can imagine that teens will pretend that they are not interested, so target audience would be 5 or 6 up to about 12. But if you can get your teenager to go, they will probably (internally) resonate with many of the issues and the way they are handled. My kids loved it.",
  "130": "Apart from being the best Pixar film since 2010, Inside Out is also the best animated movie in years. After Toy Story 3, Pixar started going downhill... Cars 2, yuck! Brave, meh. And Monsters University was mostly enjoyable. But Inside Out is truly Pixar's return to form. Lets hope The Good Dinosaur is just as good!",
  "131": "So far, this has been the best movie of 2015. It takes an old concept (tiny people inside someone's head controlling them) and creates something totally original and creative from it. The voice acting is brilliant (particularly Lewis Black)  and the story is intriguing. It might be a bit intense for very small children but if your kid liked Pixar movies like Up and Monster's inc. then they should be fine with this one. A fantastic film from the greatest animation studio in the world.",
  "132": "While it has an uncomfortable stereotype moment, it can be ignored for the rest of the film  which has a well developed narrative,  good characters and characterizations, and is intelligent and moving to watch.",
  "133": "I'm thankful for these two directors, Pete Docter and Ronnie del Carmen, especially for Pete Docter for clearly showing the emotions and different expressions to children, because it's the emotions that children need to understand. When a child in her/his childish ages understands the different feelings of anger, happiness or kindness through family, friends or even animals then it was the best time for the cinema to create this movie and inform the parents about  their children's feelings. Thank you for the animators for choosing such a great colors, especially for the character \"Sadness\". And thank you for the directors and the writers and all of the staff that helped to create this movie.",
  "134": "Pixar is finally back on its game._x000D_ I surely haven't cried so much since Green Mille and never have I ever thought that I will ever cry over a character named 'Bing Bong'._x000D_ Not only that this movie teaches as family values, importance of friendships but also the fact that sometimes, you need to be sad for you to be happy.",
  "135": "I love this movie more than anything. It is my favorite thing in the world. I believe that this movie is the greatest movie of all time. It is greater than The Godfather and Citizen Kane. It has great characters and a great story. It is just a perfect movie.",
  "136": "Si no fuera por Pete Docter,Inside Out no podría haber salvado a pixar de las criticas. En este maravilloso y creativo filme,Pixar demostró que a pesar de que hayan hecho pesimas películas como Cars 2 pueden tambien lograr hacer brillantes ideas con resultados positivos. Y en Inside Out demostró que tambien pueden crear grandes obras maestras,con la necesidad de una idea original,personajes memorables,una gran animación y una moraleja. Inside Out tiene de lo mejor de las películas de pixar: Personajes,chistes,una idea,un conflicto,drama y un final perfecto. En el filme tiene Grandes Personajes como Bing Bong y una solida relación amistosa de Alegría y Tristeza como Woody y Buzz en la saga de Toy Story. En definitiva,es una de las mejores películas del 2015. Merece su recomendación (Al igual de Shaun the Sheep Movie) y una nominación al Oscar a Mejor Película",
  "137": "This movie was splendid. It immediately catches your eye with the main protagonist, a 12 year old girl named Rylie, who has lived a ordinary life. The movie turns her emotions into actual individuals, who control her and make sure she has a good life. The movie is immediatly met with conflict, Joy trying to control everything, Sadness changing everything, and the other emotions not being able to work properly without them. This movie is emotional, heartwarming, and can be enjoyed, in my opinion, by all audiences.",
  "138": "Every once in a while we are presented with a perfect film, and if it's an animation then chances are it's a pixar creation. Inside Out is one of these, right up there with the best. Original, funny, sad, it's simply brilliant. Highly recommended, a must see, no exceptions.",
  "139": "Pixar is finally and literally welcome back! This could not see a good film with that quality, since the days of Up and Toy Story 3. It is not like the disappointing Cars 2 or The Brave (the latter very cute and educational but not has the same \"poetry\" of the other Pixar masterpieces.).He made me move, laugh and think at the same time! Finally!_x000D_ Sorry me for my writing in english, I'm italian. :D",
  "140": "This movie was a biggie for me. First we got the awesome creativity of a child's mind and how beautiful a movie can get and Pixar proves it. Second, it introduces the characters that are enjoyable and somehow adorable that in some occasions, you just to give them a hug at the end. And third, the emotional ride that Pixar is good at, they know how to make someone feel like crying even when you're the big macho. All I gotta say is that Inside Out is a blast and actually one of my all time favorites. GOOD JOB DISNEY.",
  "141": "I just feel they showed in a beautiful way that emotions are all important and that when you are a child your emotions are less complicated and as you grow they become more complicated. It is a creative and inventive way to picture our heads. I didn't like the development. I thought it was going to be more interesting and they have so much to tell that I thought it was poor. The movie has one of my favourite concepts of all the movies I have seen. I loved.",
  "142": "After the release “Cars 2” Pixar has seem to lose its track with critics. Children may still love the films that had come after but adults and critics had some split ideas for the following film “Brave”. That film was enduring as it dived into the relationship between the queen and Merida. However, the story line did rely on some free spirited princess cliches that are a staple of Pixar’s parent company. The “planes” films are “Cars” spin off that have been universally panned by critics and it was very clear that these films were only meant for the youngest of audiences ( i.e. toddlers to six year olds). So when the trailer for Pixar’s latest outing came to theaters, many movie lovers (myself included) people were concerned with how this film was going to turn out. However as soon as the opening credits were over and the film proper had begun, it was very clear to me that Pixar had finally gotten back on its “A” game. “Inside Out” is not only a fun film that can be enjoyed by people of all ages, it is also a great insight on the nature of emotions and how all of them are nessacry in the development of a growing person._x000D_One of the first concerns that I personally had was that the emotions would only have one note personalities. For example, joy would be the generic quirky hero, fear would be the “geek”, Disgust would be the premdomina, sadness would only be able to express sadness and have it be it, and to have anger be the “hot-head” of the group. However, much to my surprise the writers have given the emotions their own distinct personalizes that have other elements of the other emotions. For example, Disgust shows a few instances of happiness when Reilly (their host) would have a chance to be happy with her move to San Francisco. It is only appropriate that the writers would have Reilly go through a move which would cause her to have an emotional breakthrough.  Moving is a position that many young viewers could relate and it is an emotional experience for children and adults. Moving is leaving everything that someone loves behind in order to live in a prosperous future. The change is very hard for young Reilly as she struggles to comprehend that the house that her family moves into is not really her dream house. With this drastic change, the emotions start to fight amongst themselves about what is best for Reilly. This makes for a compelling story since the negative emotions like anger and fear and even disgust really want to do what is best for their host._x000D_As the plot progresses, joy and sadness are separated from the rest of the emotions, they meet with Reilly’s old imaginary friend named Bing Bong who was forgotten by her as she grew older. As soon as he had come onscreen, I thought to myself “he is going to find a way to betray Sadness and Joy and then try to take over the mind so that he would be the only friend that Reilly would have. However, the film had made the choice to not throw in a last-minute villain, the film makers had decided to choose a more tragic route for the character. The character disappears towards the end of the film forever which symbolizes the end of childhood and that the emotions need to continue to prosper in the future to maintain Reilly’s emotional balance. It is for the better that the film doesn’t have a main villain, the girl going through her emotions is a strong conflict as it is. The surprise twist toward the end of the film shows the importance of negative emotions as well as positive emotions. The film teaches children (as well as adults) that negative emotions are needed for a balanced life. People cannot experience joy without going through the sadness. A negative experience could be seen as a challenge to help with self- improvement_x000D_There is a running gag in the film about the girl and every character in the film remembering a commercial jingle that keeps popping up in their mind. The gag is not only hilarious but it is also an interesting bit of social commentary. The commercial jingle is a slight reflection of how far people go to promote their product. The jingles were made to be as catchy on purpose so that the target audience could remember their product. Another interesting piece of social commentary was when the cells were dumping the memories that Reilly deems as unimportant. Some of those said memories were the presidents of the United States such as John_x000D_Quincy Adams or Andrew Jackson. This brief segment of the film is a reflection of the ongoing short attention span that the younger generation has towards academia. The newer generations are more prone to being distracted by forms of media and showing less of an interest in studies._x000D_As a final note, “Inside Out” is a proud return to form film by Pixar that not only has a good piece of social commentary but it is also a reflection on hoe all emotions are needed even if they are negative. In a time of extremist opinions that are especially found on the internet, people can learn from this film",
  "143": "Pixar finally return to the form that had them succeeding in every film (except Cars movies) before 2011. A film that takes a concept many might feel a bit sensitive to tell to kids and makes a beautiful and emotional story with it. Sensational.",
  "144": "Beaming with emotion, charm, and wonderfully brilliant animation, Inside Out is unique, and is filled with interesting characters, gorgeous set pieces, pop culture references, and thought provoking themes.",
  "145": "The Best Pixar film ever. It might not be for other people, but this inspired me so much, and my life changed because of this. I love the theme that we need sadness sometimes in our lives to get a new hope and courage in harder situations. A True Masterpiece.",
  "146": "It seems most people enjoyed this movie. I, however, found it incredibly annoying.",
  "147": "Do you wanna learn about your mind in a more entertaining and still efficient way? Disney and Pixar have a great answer for you: five charismatic characters who, together with other interesting faces, control the cute Riley and teach us how our mind works. Inside Out explores all the mysterious and funny places of our head in order to show us that everything works together. Being happy is important but being sad, angry, disgusted and scared are part of our lives too and make us who we are. This is an amazing film not only for kids but to everyone else. It's common to forget essential things like the one that and being reminded of it in such an amusing and touching way is priceless.",
  "148": "If you like animated movies, do yourself a favor and see this movie._x000D_It's flawless in that it has awesome humor, happy joyous moments, sad moments where you want to cry, moments where you want to cheer and moments where you feel like the protagonist._x000D_I have nothing bad to say about this movie, and I was in a theater with a kid screaming for half of it.",
  "149": "With a smart, funny, sad, visually stunning and also nostalgic production, Pixar's surprisingly original \"Inside Out\" proves that Pixar movies can only get better",
  "150": "Pixar has not only created an original, charming, emotional, beautiful, and even nostalgic film, but, in my opinion, they have created a masterpiece. This is not only the best Pixar film ever, but the best film of this year, one of the best animated films ever, and it is already one of my favorite movies...ever. From its characters, setting, score, and emotion, Inside Out is the closest thing that I've seen to a perfect movie in a very long time. Whether you are a kid, teen, adult, or elder, you will adore and connect with this film.",
  "151": "This movie is one of the best Disney/Pixar for a while, the movie hit me right at the feels more then Toy Story 3, its funny, nice for kids (well not the butt scene) and finally for the first time after Cars 2 and Frozen, the lesson is easy to know and fits in with its nice animation, speaking of animation, the characters and their animation are god damm amazing, very colorful and very detail and for once it looks and feels like a Disney movie unlike Cars 2 (If you like Cars 2 and get mad at me, look its ok but why try to put guns in a lesson kids movie detail? anyways) its one of best movies of 2015 before Star Wars Episode 7: The Force Awakes, it really need to get awards for great animations, great lovable characters, great plot, and great voice actors.",
  "152": "Pixar continues to set the gold standard in imagination.  This film is great on almost every level and manages to capture a spirit only Pixar can.  It belongs in the pantheon of greatest animated films, or at the very least greatest Pixar films.",
  "153": "In a time when Hollywood mindlessly churns out reboots and remakes, Inside Out stands alone in its sheer originality and inventiveness. Inside Out is one of the most intelligent ideas Pixar (or any filmmaker for that matter) has ever put to screen, and possibly their most accessible film to date. Even when I felt some individual characters in the film begin to cloy, that feeling quickly dissipated, as I was soon blind-sided by their charm only seconds later. As with the universally acclaimed Toy Story 3, Inside Out clips along at a relatively fast pace, but never feels hollow, and is often hilarious throughout. Every moment of this film is truly a joy (no pun intended) to behold.",
  "154": "Pixar is unarguably one of the premiere animation studios around, yet everything since Toy Story 3 has been rather mediocre. I had almost lost hope in the studio at all. I mean, I grew up with Pixar – I remember seeing masterpieces like Finding Nemo, The Incredibles, and Up in theaters (ok I saw them all in theaters) but they were honestly really a big part of my childhood and I couldn't tell if I was growing out of them or if they were simply not as good. I am relieved to say that the latter is true. If nothing else, Inside Out is a breath of fresh air in a musty room and revitalized my hope for the hope of Pixar Animation Studios._x000D_ Riley is a girl that could have easily been me. I moved quite a bit in my childhood and I really related to all her personal struggles and the disdain she felt with the attempts to run away. She had haywire emotions, but who knows! Maybe we all do once in a while._x000D_ Joy:This movie was inexplicably happy and visually stunning. I can't recommend it more for anyone of all ages. Not only does it provide remarkable insight into the way our own minds may work, but it has a compelling plot with extremely lovable and complex characters. I was enthralled the entire 92 minutes even though in the end we all knew it would turn out to be alright. The journey is the most important part, after all._x000D_ Sadness: I'm so used to being the age of the children in these movies that it was so odd for me to almost relate to the parents more than I did to Riley. The only part of the movie that I can think of being sad at all is the loss of Bing Bong. It kind of symbolized letting go of the past and moving on to more important things. I related to this and I found that this movie is relatable for practically everyone of all ages._x000D_ Fear: I'm terrified to live in a world where everything is serious and movies like Inside Out don't exist. Movies like this one are so important to me because it reminds me of the past and reassures me that the future will be great. It lets me know that everything's okay and I think that's so important._x000D_ Anger: The unfair treatment and rap that animated films seem to get. I can guarantee you without a sliver of doubt in my mind that Inside Out is one of the best movies of the year and deserves to be up there nominated with all the other knockouts for Best Picture at the Oscars._x000D_ Disgust: The fact that I don't have these emotions in my head? For all I know, I might but I can't see them! I'm not disgusted with any part of the movie, sorry Mindy Kaling. I still love you. The ending of the movie even managed to avoid disgusting clichés and for that I have nothing but my sincere applause.",
  "155": "To be honest, I was pretty sure I'll always remember Pixar for Toy Story (well, i didn't like Up at all), which was really worth its fame. But hey, here we go! I got 'Inside Out', which is now one of my favourite animated movies, filled with emotion. I can tell a lot good things about this movie, but \"Major emotion picture\" describes it best. It's filled with emotions, not just verbatim. I was crying both with laughter and true sorrow, I was smiling and frowning. Actually, I felt as if I was right there, next to Sadness and Joy, next to Riley – little, lonely girl, next to her parents with too many problems to explain their daughter, next to confused Fear, Anger and Disgust. Next to everybody, but also inside them. And out of the movie.",
  "156": "A fantastic film depicting the great process our mind goes through lifetime. Inside Out never leaves the intensity of exploring our own paradigms from childhood to adolescence It is a masterful cinema to be considered for ages.",
  "157": "I saw Inside Out (3D) at the Thursday night showing.  What an Outstanding Movie!!!  It deals with a little girl's emotions, and the movie is deep and emotional.  It's one of those rare movies that sticks in you're head after you leave.  It is for children and adults alike.  Pixar definitely has another BIG Winner.",
  "158": "Inside Out is a funny, heartwarming, and deep journey into the human mind. Pixar has a filmography that's hard to match, and things will remain that way if they keep putting out films of this caliber. As per usual the story is well crafted, and inventive, but the most impressive thing is the use of humor to help the moments of true drama. By that I mean the film has a relatable humor, that anybody can laugh at and have a good time with, so when the film decides to get serious it hits the audience even deeper. This something Pixar's always been good at, but this movie has some of the most touching moments since Up. On top of the brilliant use of humor, the visuals are stunning, the voice acting is perfect, and the characters are surprisingly well crafted. In the end Inside Out is one of Pixar's best films in the last 5 years, and is worth seeing on the big screen.",
  "159": "Inside Out is arguably of the studio's best films yet to date. Original, ingenious, and sentimental, the studio has return with a smart and winning comeback after its 1 year delay of producing animation flicks since its last work (Monsters University). This proves that Pixar's magic is still fresh and will make animation cinema a delightful treat for the young and the matured. Great job Pixar for revitalizing your delayed record of fantastic animated movies._x000D_ Rating: 9.5 / 10",
  "160": "Is there any thing wrong that could be said about this film? It was beautifully animated, had a wonderful and creative story, and it was even humorous. But then again, this is the content one should already expect from Pixar. Even as an adult, seeing Inside Out for the first time gave the same feeling as seeing Toy Story for the first time as a kid. This will definitely go down as one of Pixar's best.",
  "161": "one of the best pixar׳s movies and the smartest they ever made!_x000D_the animation is amazing like only pixar can do_x000D_the film is a Huge emotions roller coaster_x000D_a most see!",
  "162": "Pixar's golden age was practically all their movies from Toy Story to Toy Story 3. With the exception of Cars (which got Mildly positive reviews) all Pixar movies gained critical acclaim, with two films even getting nominated for best picture (UP and Toy Story 3) But after Toy Story 3, there was Cars 2. The movie that broke the chain of good movies. After that there was Brave, a dissapointment, and Monsters University another pretty bad movie. Pixar seemed to have lost its charm. Until this movie. Inside Out has all the amazing things of a Pixar movie plus more. All Pixar movies are visually stunning (even Cars 2), but this movie takes it up a notch. Never have I seen a movie create a completely new world so perfectly. Not only were the enviroments amazing, but the characters were great. The last time I felt this way about characters I had just met was Up. Of course in UP I cried in the first 8 minutes (which I usually dont do in movies so thats saying something) and in this movie I cried towards the end. If this doest get nominated for best picture there will be issues. My rating would be a 98/100 (9.8/10), but Im going to round it up to a 10. Pixar, youve done it again",
  "163": "This film is not only Pixar's comeback, it is one of the best films the studio has ever created. Extremely powerfull messages that will stick with you for a long time, the concept is one of the best an animation movie could have, the music is fantastic, the voice acting is outstanding, the animation is breathtaking, and the story is perfect. Pixar's rough days are way behind it. (P.S Bring the tissues)",
  "164": "Inside Out is a beauty. The newest film from Pixar following the emotions of an 11 year old is, by far, the most creative movie the studio has made so far. You will not be disappointed when watching this movie.",
  "165": "I\"m not a big fan of animated movies, but wow, this one gets you emotionally.  Much of the movie reminds me of the early scenes in UP, when they look back on the old couple's life.  That REALLY got me.  This movie has it's share of zany fun, but there's plenty of heart-wrenching moments - I could feel the waterworks flowing around me in the theater. It definitely makes you \"pay\" a bit fore the emotional payoff toward the end.  It drew me in so much that I was a little shocked when the credits rolled.  That's it? It's over?  Sign of a good movie, for sure.",
  "166": "Inside Out is the most creative movie Pixar has ever did. Just every idea, every area in his girl's head is brilliant and wonderful. The lesson it teaches is wonderful, and is one for parents and kids alike. Also this movie is entertaining for parents as well. The writing is smart, the jokes are clever. It has that Disney/Pixar sadness in it and it is used in full force. Which makes the movie's ending that much happier. Inside Out easily ranks up there with UP, Finding Nemo, and the Toy Story Films. Pixar is back, baby!_x000D_Final Score 9.5/10 (Rounded to a 10/10)",
  "167": "A dazzlingly sublime idea is executed with rare consummate skill. The film takes us inside the head of a young pre- pubescent girl and, more specifically, her emotions; joy, fear, sadness, disgust and anger. In so doing it unlocks a world that one would have been hard pressed to imagine. Although possibly too complex for very young children they will never the less engage with the colourful and likeable characters. Adults, however, will love it and gaze in awe and wonder as a story and screenplay unfolds that exudes intelligence and imagination. Even pathos gets a genuine look in here which is not often the case in animated films where emotions are often overly manipulated and almost forced out of you. The whole thing is just jaw droppingly hypnotic and provides a definite upward swing in animations fortunes where the offerings of the last couple of years have, generally, been pretty dismal._x000D_Supporting this little gem is an even smaller one, an approximately seven minute short called ‘Lava’. The story, completely told via a lovely and witty little ballad about a lonely volcano, is just delightful.",
  "168": "It's rare that a summer movie stays in my head days after leaving the theater, but \"Inside Out\" has done that brilliantly.  It's a beautifully crafted movie that bursts with creativity and humor, centered around some insights about how we think and react to the worlds in which we live. It's not just a movie for kids.  It has challenged me to think about how I parent my daughters and what I teach them about their feelings and emotions. And it's also prompted me to think about my own challenges in balancing joy, sadness, anger, and fear.  It's a wonderful movie for both kids and adults.  Best film I've seen all year, by far.  I think this one will endure for years to come.",
  "169": "Well after a slightly bumpy road with some of their latest films, I'm more than happy to say that Pixar makes more than welcome return to form with this being one of their best films in a long time! Everything about it is just so perfect! From the gorgeous animation to the lively and very funny voice cast! Amy Poehler is perfectly delightful as Joy! Phyllis Smith, Bill Hader, Lewis Black, and Mindy Kaling as Sadness, Fear, Anger, and Disgust respectively were all perfectly cast as well. The overall story is also highly imaginative, unique, and completely entertaining from start to finish! Overall, not only is this easily Pixar's best in a very long time, but it's also the best film I've seen so far this summer, or all year for that matter! And yes I will admit, I did shed a few tears near the end.",
  "170": "This movie was outstanding. First off, let's just say that this movie is very unique. Featuring all the feelings was very creative of Pixar, and the crux of the whole film. Next, because they featured the emotions within Riley's mind, the development was unusually heavy and deep. You know why they brag that this movie is made by the guys who made up? Because the Up guys really put their hearts into it. That 10 minute relationship between Carl and his wife? Here, it's turned into a full-feature child-parents relationship, but also with Riley and her relationship with the new area she moves to._x000D_ Of course, uniqueness and development are only the tip of the ice berg. The movie is tension-filled, leaving me on my edge of my seat, tearing my hair out, yelling: \"Nooooo! NOOOOOOOO!!!\" (Especially near the climax scene where the emotions narrowly don't make it!) The fact that it's realistic and the lands Joy and Sadness travel to fall down one-by-one, showing that Riley is losing her core self and losing who she truly is--becoming a robot, becoming out of touch with her emotions--oh dang; that's truly suspenseful and horrifying! And shall I mention (BIG spoiler--You are warned here and now--BIG spoiler)-- Bing Bong sacrifices himself in order to make Riley happy--but it's not just about Joy. No; it's not about Joy leading onwards, optimistic no matter what. It shows that people have duality of emotions. It's realistic- - and the multitude of emotions, instead of simply one emotion (or no emotion at all in the case of the movie's crucial pinpoint), there are a load of emotions within the movie._x000D_ Obviously, this movie is not just deep and touching. Let us end this review on a lighter note--this movie has excellent comedy as well. The main comical subject is the aforementioned Bing Bong 9in my opinion), which makes his death ever so-more heart-wrenching. But other than that, the humor is quite intelligent. The helicopter guy, Angry's flame, goofball land, they all add a good amount of laughs and heart-warming moments to this film. So in conclusion, this movie is amazing. It's one of pixar's best, if not the best-- failing only second arguably to the Toy Story series. (And even that is arguable). If you haven't watched it, you definitely should. It has made it into the top ten of my best movies ever watched. :D",
  "171": "This movie is getting a lot of praise and it's well founded. A fun animation style is coupled with the most clever humor I've ever seen in a movie. It drags on the progression in the middle for the sake of plot, but there's enough to enjoy in the minutes that it doesn't hamper it much. It's a fun adventure with lovable characters and inspiration ally unique ideas. In storytelling and laughs.",
  "172": "Disney Pixar shows us why they are the king of animation with Inside Out, a truly wonderful film and it easily the front runner for a Best Animation academy award and even a Best Picture! Inside Out is the best film Pixar has put out in the five years and what a comeback it is! This is visually dazzling, heartfelt film and filled with so many memorable characters. Inside Out is destined to be an instant classic. Kids will like this movie, adults will LOVE this movie! It is also one of the best films I've seen so far this year, its only competition being Mad Max Fury Road.",
  "173": "Excelente Pelicula_x000D_ Realmente el trabajo de PIXAR digno de alabar, una pelicula que sera un clasico_x000D_ Me deja sin palabras._x000D_ Espero una segunda parte",
  "174": "Well after the love/hate thing with Frozen, I can safely say Inside Out was one of the best works Pixar has made. Not only does this movie teaches the young ones about importance of having family and their support, but it's also a reminder for teens and adults. Since the movie is about such subject, there are many emotional scenes. It made this 21 years-old dude tear up._x000D_ Hats off to you, Disney and Pixar. You guys did it again!",
  "175": "Saying Pixar's ‪Inside Out‬ the best Disney Pixar or Best Picture of the Year is truly an overstatement; but it truly is a marvel and never have I witnessed an audience cried or laughed so hard as much as this film. Inside Out had everything, from great script to perfect casting. The film takes you on a journey from inside a young girl's mind which are controlled by five emotions as she deals with moving away from what she has known and grew up. The sheer details and imagery is breathtaking. Pete Docter is a brilliant human being and really knows how we all feel and go through in life.",
  "176": "Very interesting and different from many other Pixar films. The humor is alright. It also lacks an emotional punch, unlike 'Toy Story' or 'Up' just to name a few. But that's not a major flaw as it's very creative, has well developed characters, smart, and it's relatable, as most of us have been through these emotions and experiences. We do and once had gotten angry, frightened, sad, disgust, and have joy. Pixar really showed these experiences with Riley by having joy for her family's moving, disgusted by her house, frightened by the foods, sadden for not having friends, and angry by running away. We also see Riley's imagination or Goof Land fading away as she ages which is a nice detail._x000D_Pixar's on the right track and hopefully they stay on that track.",
  "177": "Inside out is imaginative, visually stunning and absolutely as must-see this year. Besides that, the short film preceding the movie is good enough to justify price of admission by itself.",
  "178": "My review on inside out_x000D_This exceeded expectations and more. Pixar is back with this one (until they make cars 3 of course). The fiftieth movie in the Pixar saga is an instant classic. This is the funnies Pixar movie sense find memo and is the third best in the franchise. Only find memo and monsters inc. top it and that's saying something._x000D_The movie focuses on the emotions of humans. How emotions start, how they grew, and now they evolve. The movie is simply brilliant. This is the most or second most smartest movie ever. (Only movie to maybe top it is spirited away). The whole process that these emotions go through it amazing. They sleep, they have emotions themselves, etc._x000D_The world they live in is the most impressive part of the movie. How each core memory has its own world, how dreams have their own world, and even how imaginations have their own world. This all constructs who we are as people._x000D_They story is of how the core memories getting messed with and then sent away with joy and sadness. They have to get back to headquarters in order to ha panniers and Riley's (main character) whole existence. Though it won't be easy as they both will have trials and potential disasters to overcome._x000D_It's a movie with great emotion as the forefront. It leaves you sad and happy (irony and mind blown). It's a great insight into what happens when someone gets depressed. The subtle things are also done so well. The little details in the worlds, the things they say, the things they do, etc, all add up a movie that is by far the best move of the year._x000D_Overall I'm impressed that Pixar took a step back and really but their heart and soul into this movie. It shows on the screen. This is not just another great movie from a great studio, but a triumph of what the human mind can do and accomplish. 9.7/10",
  "179": "Pixar has done it again. This is one of, if not THE best Pixar film since The Incredibles. The amount of heart and soul the actors and the animators and everyone else worked on the film put into the movie is how every great film is created. It will make you remember the grand days of old for Pixar and will leave you with a grin on your face, parent and child alike.",
  "180": "An 11-year-old girl is uprooted from her happy life in the Midwest to a new home in San Francisco, an experience that causes a flood of new feelings. The Pixar gimmick is that her emotions are run by 5 characters in her mental \"Headquarters:\" Joy (Amy Poehler), Fear (Bill Hader), Anger (Lewis Black), Disgust (Mindy Kaling) and Sadness (Phyllis Smith). This group and their rapid-fire reactions drive the movie and the comedy. When things get bleak, the trip turns peculiar and the story loses steam. The visuals are colorful, but not as dazzling as we've come to expect from Pixar. This creative slant on growing up and the complexity of feelings is an ambitious subject. While it's energetic, fun and sweet, it's emotional impact failed to connect with me. NOTE: Stay thru the early credits to enjoy the cleverest moments in the film.",
  "181": "Finally! After being stuck in a rut, Pixar is back with Inside Out. Original, funny but surprisingly poignant, its a return to form for the studio after too many sequels. What's so great about it is the story line, and a somewhat mature theme about your emotions. One of teh best film of 2015.",
  "182": "A Pixar's conceptual masterpiece! A great story with a little bit of everything, emotional, intense and entertaining. But there is a big chunk i the middle of it",
  "183": "AMAZING. Probably one of the smartest Disney movies I've seen. The characters are fun, the story will leave you crying, and the funny parts are smart. I wish that it came earlier because it's not just that everything would work out. Not everyone is going to end up a princess in a castle or a hero with a medal.",
  "184": "Pixar , stop making people cry. What a marvelous movie. I honestly thought Pixar had lost it's mojo, but then comes Inside out. This movie is visually stunning and conceptually brilliant, to say the least. I can't find enough words to describe this gem of a movie. 'Joy' and 'Sadness' voiced by Amy Poehler and Phyllis Smith respectively steal the show and how. And the Pixar short 'Lava' preceding the movie, I Lava You.",
  "185": "A wonderful family film with a delightful script, compelling storyline and beautiful artistic direction. The characters are brilliantly brought to life by Poehler and the supporting cast, and like all Pixar films, there is so much here for young and old audiences alike. I'd suggest that very young children would struggle to maintain interest; however, from around seven and up this should please everyone. 8.86/10",
  "186": "I actually saw this on opening night, but I put my review late. The movie was intensely entertaining and actually I have like every Pixar movie I have seen. The animation was gorgeous and the characters were likable. The ending was pretty sad, but overall, I enjoyed it.",
  "187": "It may be a ways away from the pantheon of Pixar's far better films - i.e. \"Finding Nemo,\" \"Monsters Inc.,\" \"Toy Story 3,\" etc. - but \"Inside Out\" still contains a hefty amount of that imaginative glory that made the studio what it is today.",
  "188": "Pixar has peaked sadly, with this film. It's simply the most brilliant concept they've ever accomplished, confirming that Pixar consists of the most human filmmakers around, more human than actual humans on the screen. The psychology is consistent with how emotions develop from child to adult, as memories and emotions become more complex and not just one-dimensional. I will be outraged if this does not win the Oscar for best animated feature. It's the most original Pixar has been in years. An absolutely outstanding film.",
  "189": "Along with other reviewers... I don't understand the high praise either.... This could have worked as a 30 minute short.  My seven year old said the best bit was the end credits, no joke. So this ranks down along with the weaker Pixar offerings.  It's also not a feel good movie either.. Infact it's out and out emotastic.  I hope this makes a ton of money because i don't like Disney inhouse beating Pixar, which has been true since Tangled. If Pixar carry on making weepies then they are gonna have to do a lot of catching up. Come on Pixar!  I take my kid out to have a good time!  Which reminds me... Inside Out is a talkie, probably contains the most dialogue out of any Pixar movie, probably why my daughter was bored. It really didnt feel like the movie was for kids at all.  As it stands... I'd score this movie a 7/10 but since my daughter didnt love it it... Its a six.  Better movie for us adults.",
  "190": "Inside Out is arguably the best Pixar movie since Toy Story 3; it brings a refreshing look that reminds us just what type of studio Pixar is. I was actually surprised by how mature some parts of this movie were. To make a shallow comparison, Inside Out is like Adventure Time in that it can awaken that childlike wonder and joy that you might lose in your daily life, while still making you mull over incredibly deep concepts. I think this is a movie that both adults and kids can watch, that it doesn't just cater to the whims of children, but rather respects, in a very much Toy Story way, how a child's view of the movie might develop as they grow up._x000D_ As we've come to expect from Pixar, this movie is visually stunning. The close-up shots really capture emotion well in an animated film. The story takes you inside the head of a pre-adolescent girl, Riley, and personifies her emotions in a movie that is truly a breath of fresh air. Inside Out reminds me of the Pixar I knew as a kid, the studio that had amazing, original ideas and presented complex issues and a beautiful way. We come into a very difficult stage in Riley's life, and we are reminded just how easily your world can fall apart when you are so young. Inside Out really shows you the stress we all endured at that point in our lives, how youth can seem so fleeting and that at times it may seem like we've forgotten what joy was._x000D_ Lastly, this movie made me cry. While not exactly the \"tear duct sledgehammer\" that Up was, Riley's character is strikingly relatable, which makes the movie hit deep in its own way. I rarely give movies a perfect score anymore. I rate movies on a adjectival system, meaning each number 1 through 10 has an adjective associated with it; a 5 is mediocre, a 6 is okay, a 7 is good, you get the idea. To me, a 10 is a masterpiece, a movie that beautifully does what it set out to do; while a 10 may not be perfect, it will definitely be remembered and looked to as a model. To me, Inside Out fits this description. I would recommend this movie to anyone who still has a little kid inside of them.",
  "191": "After reading all the excellent reviews for this movie I was very disappointed with what I watched. I do not understand its meaning and I certainly did not find it funny. It featured some of the plainest and most boring characters ever and for Pixar's standards it is very poor.",
  "192": "Was definitely not expecting Inside Out to be this good. PIXAR's two most recent ideas---Brave and Cars---were not much of a success with both me and other fans. Inside Out is a delightful return to the PIXAR we once knew: light-hearted fun with deeper meanings for adults. Surprisingly, Inside Out is a real tear jerker with likable characters and an interesting premise. I'd definitely watch it again when I could!",
  "193": "As an adult, there have been animated movies I actually enjoy.  The Incredibles, Finding Nemo, Monsters Inc, and Toy Story come to mind.  This movie is being rated as if it's on the same level and to be perfectly honest it's not even close.  The story is so flat and unbearably boring that my wife and I literally walked out of the theater.  Will kids like it?  I have no idea.  But if you are an adult and are thinking about watching this movie, do yourself a favor and rewatch a classic instead.",
  "194": "I'm with the other negatives here in that I think the critics and movie-goers were seduced by the over saturated color - an orgy of color, actually. The story's conceit - personified emotions - just doesn't hold together well at all, it was too ambitious and destined to fail when implemented. Now this may work for kids who can't understand such things but adults should be slamming this. Just a big disappointment.",
  "195": "Although the movie had a elements that allowed for laughter and possible tears, I didn't exactly find it as amazing as everyone had hyped it up to be. I may only be young, but even elements of the story I couldn't relate to at all. Especially since I have moved and lived in America. It had moments of being too juvenile and it may have been for a younger audience, but I'm only 14 and I know that most teens will have gone to see this movie, also parents. As for the characters, I found Joy and Sadness to annoying. At times I wanted to claw my face out because sadness was borderline depressed and joy just needed to understand that you can't have the spotlight. It should have explored the islands more, which doesn't actually count as a spoiler cause it is featured in the trailer. Overall I just found it disappointing, especially for a Disney movie. It is different, with a really arty idea, just possibly not executed to he best ability I know Disney can do.",
  "196": "The best, imaginative and creative movie I have ever seen in Disney Movie History. Inside Out shows a great teaser trailer last year and when the movie is released, you feel like you wanted to watch it again and again.",
  "197": "That Pixar could write an adventure story about a standard cognitive crisis in the mind of a little girl is incredible._x000D_Touching, heartfelt, and just plain funny: this movie is great.",
  "198": "A very imaginative and interesting movie but, in my opinion, its not a \"10.\"  As others have said, some of the other Pixar movies are overall better movies - Toy Story, UP, Finding Nemo - to name a few...  In this movie, the plot loses its way in the middle and end; and, some of the characters are not as well-developed as I would have hoped...  Also, some of the movie may be too complicated for kids to easily follow and thus could get somewhat  frustrated by the show.   Still don't miss this - the approach and creativity is wonderful and worth seeing.",
  "199": "Dose anyone remember that TV show back in the 90's called Herman's Head, no? well your going to think this is a original story but really it's ripping off a story line that already exist._x000D_ The story to Inside Out is about a girl called Riley who is just like any typical young girl - dealing with the ups and downs of life - but on the inside, things are much different. When her father gets a new job in San Francisco and moves the family from the Midwest to the West Coast, \"Headquarters\" the place in Riley's mind that contains her emotions, goes into overdrive. Joy, Fear, Sadness, Anger, Disgust - each one plays a role - and with a new city, home and school - there is going to be some major conflict._x000D_ \"The most original animated ever made\"._x000D_ \"It's both funny, original and better than Up\"._x000D_ \"Inside Out is Pixar's original film yet\"._x000D_ NO..._x000D_ Everybody is going nuts over this movie calling it as \"A masterpiece\", and \"One of the best animated films of all time\". Now since I did like this movie as I do think this is a solid Pixar film, but I wouldn't go that far to call it a flawless masterpiece as people are calling it as the movie does have flaws. I feel like this is going to be one of those movies were people get really hyped over at the first like everybody is giving it the same rating and giving it the same love as everybody else, and if you say anything bad about it or you pick out a flaw in the movie people will rip you a part, but after a while when the hype dies down that's when it's okay to say that it's sucks or you didn't like it because everybody is coming out saying they think different of it. This happened before with movies that got hyped to death such as: Toy Story 3, Frozen, Gravity, The Avengers 1&2 and Avatar. But who's this movie may still get love after a while and it may seem like I'm hating on this movie which I'm trying not to come off like that as I think this is a good movie, but to me I like stepping out of the box and not try to join the hype as some people doing as I think a lot of people block out negative or any problems when they watch a movie just because A: They were looking forward to it or B: They wanted the next big thing. To those who are not convince that I don't hate this movie let me drill this in your head, I like this movie, I don't hate it. It's better than Cars 1&2 and Brave. But to me it's not a original masterpiece even when this story has been use already, but still this is a good movie. Okay I got that out there._x000D_ Let's talk about the positive's: The animation in this movie is so beautiful and really colorful and that colorfulness really suited the tone perfectly giving it a kid colorful welcoming feel to it. I can already see this movie is going to win best animated movie at the Oscars that's how good the animation in this movie. Pixar never disappoints when it comes to animation to they movies, even the ones I didn't like so much at least I can look at the visual's and be amazed of the detail put into it. And in this movie once again Pixar impress me with the animation._x000D_ The movie towards the end which I'm not spoiling it but I think everybody who's seen the movie or even heard someone talk about it as brought up that the movie does have a sad scene that made everybody cried like little babies just like me. Damn you Pixar for making me cry, you always play with my emotions when it comes to watching your movies. But good job through for making me feel something for this movie as I will go into that later._x000D_ This is a good kids movie and even the adults will enjoy it because most adults like most Pixar films and when it comes to emotional scenes it get's to them. This may be everybody's new favorite of all time or the year, but as I said before that feels like I said it about 100 times already, I like the movie, it's enjoyable, but I think it's time to talk about the flaws and one of those flaws is about the story and some of the characters._x000D_ The problems: Every critic and every person as brought up that the story is original and Pixar is back at it's best, but hold on a minute as this story been done before? The concept has been done before but in different ways, but even when it's a little bit different it still feels the same. I know some people may not seen Herman's Head or any TV special's that's focusing on what your emotions are what it dose in your head and them as character's. This doesn't really make the movie bad and it doesn't mean you can't enjoy it, but I think you should take some consideration before praising a movie and calling it original even through it's not. Can you handle the truth?_x000D_ The other thing that isn't original is the character's, now they not badly written character's or anything like that, to be honest I think they were enjoyable to watch on screen but just like what I said about the story the character's didn't feel anything new and it feels like they been taken off by other characters from cartoon's, TV shows and other animated movies. It's all for the new original merchandise that will sell like mad after everybody sees the movie. That's how business works in Pixar, they just want loads of money that's what it's all about. Now if you think I'm a dick for saying that about Pixar then well your going to hate me even more after I bring up the pointless squeal's they came release that nobody wanted but they made it anywhere because all of the merchandise. Remember Cars, you remember when people didn't really like it and then Pixar did Cars 2, and that's because of the box office hit it was and the amount of merchandise was sold. Same with the other Pixar films. I just can't stand it when these film producers people choose money over art, it's just a big insult to cinema, and yeah it's a great way to get money off from people and all this money thing I told you about many not bother you as you just want a good movie and yeah Pixar as made great movie I mean one of my favorite movies from Pixar was Toy Story and Up. But I don't think Pixar is back as they next movies are just squeal's that we as a audience never asked for just because it's all about the f**king money._x000D_ These a scene in this movie where Riley plays hockey and she's been doing it for a while now, but out of nowhere she forget's how to play and no she didn't get disinterested or unmotivated, she literally forget's how to play hockey and she's already on the ice as the game just started. She didn't lose her desire to play, she just forget's. What really would have made this movie original if the movie was just about her emotions play with her depression affect's a person, now that will show that Pixar as the balls to do that and take a step forward and break new grounds by doing that, I mean this is about her emotions and she is going through tough times. But instead the movie focus on these character's in her head that are just a copy and cut out of other character's in past movies, TV shows and cartoon's. I know it's a kids movie and they don't to make it too depressing even when it kind of is towards the end but what's the point making a movie about somebody's emotions while that person as I said before is going through tough times. Come on at least some movies have the balls to do that and not just go \"Oh wait a minute we shouldn't step back a bit\"._x000D_ I was never bored and it's a good time watch. If you loved the movie then good for you, if you liked the movie I'm with you on that one. To those who hated the movie it's okay, you don't have to like every movie that people like and praising. Be different, be unique. As for me I will recommend it to people who love animation or just movies itself, as Inside Out is a good movie.",
  "200": "This Movie & The Original Are My Childhood.I Can't See Why People Don't Like Cars ll.",
  "201": "At least one of the best animation movie from the best animation western studio. It is not only fun to watch, but also it has a beautiful way of explaining you and kids something abstract and difficult as personality. More of such masterpieces please.",
  "202": "Disney continues to impress with this clever and creative creation. An ambitious animation that truly could have gone disastrous, but ended as a critical and box-office masterpiece._x000D_ ‘Inside Out’ might at first glance look like a childish 1.5 hour-‘Minions-sequel’. But that’s just what the kids will see, meanwhile we older individuals will embrace this amazingly visualized plot where emotions and everyday problems are experienced. Everything from within is seen from a new perspective, and it truly is a ride of joy, emotions and surprisingly much action-sequences. The concept works for everyone; both the humor, the relatable and enduring aspects. The characters are just as relatable, there’s much development to them too and they are so well envisioned in a such beautiful-animated way. It’s like magic._x000D_ To take our ordinary life and put it out in different characters with specific emotions; that’s an ambitious idea, even for Disney! But they managed to come up with this extraordinary world that works so well, and that totally makes one crave for more popcorn! It might be one of the most flawless movies of 2015, with its stunning focus on imaginative and deep characters. The first 15 minutes of the opening shots might be a bit too fast and it could have been a bit less rushed – if you look at such small critical details. It also got some very minor fact-based reaction-dialogs. But the rushed opening later on did slow down considerably, and truly managed to grasp the depth of the characters and the clever plot that never stopped being inventive! So to keep it short; ‘Inside Out’ is without any doubt another great animation by the Disney-Pixar corporation, and that got a lot to tell about family, emotions, everyday life and every individual’s own mind. Go watch it._x000D_ Personal rating: 8.5/10_x000D_Critical rating: 9.5/10",
  "203": "This is one of the best movies i have ever seen. Go watch it yourself. Now. I won't spoil anything, experience it yourself. I have never seen a movie so close to my heart. Go. Watch. Now.",
  "204": "Best Pixar film since Up, maybe even since Wall-E. The story is fantastic and it has all the charm of a Pixar classic. The story may not be easy to understand for very young children but they'll undoubtedly love the fun, relatable characters. The running gag of the Triple-Dent Gum commercial is absolutely hilarious too. Must-see.",
  "205": "The most clever pixar's movie ever made. The plot's formula is the same comparing to previosly animations, but here is a scientifical and educational vein never seen in another piece.",
  "206": "While I personally enjoyed \"Cars 2,\" \"Brave\" and \"Monsters University,\" I will say that Pixar did seem to be stuck in a rut at the begin of the 2010s. Sure, I may have enjoyed the films, but it just felt like, given their critical reactions, fans just weren't enjoying Pixar's new films as much. \"Inside Out\" has been hailed by many as a \"return to form\" for Pixar, and they aren't kidding: \"Inside Out\" might actually be one of the greatest animated films of all-time: a wonderful concept gets executed brilliantly to create a film with excellent writing, fantastic and memorable characters that are well-acted, plenty of humor and heart, and some of the best animation I've seen in any film to date. \"Inside Out\" is a must-watch animated film that shouldn't be missed by anyone. If you haven't seen it...well, what are you waiting for?",
  "207": "Inside Out is a fine addition to Pixar's canon of great animated films due to it's relatable plot and near-perfect execution of a wildly original plot.",
  "208": "It resembles what Pixar is about and what Disney is about. This one particularly refers to emotions and feelings, and it integrates them in a children's movie with original characters that were never seen before in animated movies. The importance of the film lies on yourself, the way of how you construct yourself emotionally through a personality that identifies you; if you know who you are then you know who do you want to be, and there is always going to be a family in there to support you. It's all about the message, and in this case, it present a really valuable teaching for the kids that watch it.",
  "209": "Inside Out's conceptualization of mind is fantastically beautiful and successful. The five emotions (Joy, Sadness, Fear, Anger and Disgust) take you to a journey of wonderful imaginations of creative minds that showed their talent again with their newest animation. Inside Out surely is an emotional punch with a well written story and phenomenal visuals. This is a MUST SEE animated film.",
  "210": "Is Inside Out the “best children’s film ever made”? No._x000D_Inside Out Is a marvellous return to form by Pixar with some extremely inventive ideas and characters and design, but it doesn’t seem to work as cohesively as other Pixar behemoths like The Incredibles, Toy Story, Wall-e, etc._x000D_The story seemed a little too mish-mashed, dropping from one idea to another. Don’t get me wrong, the real psychology and ideas used within the film are great but it seemed like they didn’t try to keep a flow going, just rush from one to another. The characters were distinguished right from the start and made for some comic moments, but their design seemed a bit off for Pixar; maybe I’m being harsh but a little too glittery? The story itself seemed a little linear in where it was going, but made for some fun circumstances along the way that everyone could enjoy._x000D_The comedy in the film seemed to not be as consistent as other Pixar films, with the funniest parts being at the end of the film (and the abstract thought portion of the film). This made it a little disappointing in that aspect but the film made up for it in how colourful and imaginative it was. I believe that they should’ve played with the main gimmick of the film a little more to induce more comedy; it stayed a little too much in the girls head._x000D_Albeit the discrepancies in the film Inside Out comes with enough inventiveness and revitalisation to show that Pixar is a force to be reckoned with in the animation business. A thoroughly enjoyable film but NOT the greatest children’s film that you could see. This is the beginning of Pixar’s return to form._x000D_7.5/10_x000D_Also anyone notice this: The main controlling emotion in the girls brain was obviously Joy BUT the main controlling emotion of the mother is Sadness and the main controlling emotion of the father is Anger. Did Pixar really just put in a kind of subtle joke that the father is abusive and the mother is unhappy in the marriage or something like that? Jesus Pixar…",
  "211": "Recently, Pixar (and sometimes Disney) have been making some good (but not amazing) films, like Brave, Cars 2 and Monsters University. Wreck-it-Ralph, although great, was only made by Disney. (Pixar was not involved with it.) Inside Out, Disney and Pixar's new animated film is not only a return to high quality for Pixar, it's also an amazing movie, close to being my favourite film of all time. The story is about emotions inside your head who decide how you act and what you say. We take a look at Joy, Sadness, Anger, Fear and Disgust - the five emotions of 11-year-old Riley, who has just moved from Minnesota to San Francisco and is having a tough time living in her new home. In Riley's head, all of her memories are stored, including five 'core memories' that power a different part of her personality in the form of islands. When Joy and Sadness try to keep the core memories positive, they get sucked out of headquarters and fall into Long Term Memory. With Anger, Fear and Disgust controlling Riley, she has no happiness or sadness, so Joy and Sadness must get back to headquarters before Riley loses all of her personality. Amy Poehler voices Joy (you may remember her from that squeaky role as Elanor in Alvin and the Chipmunks 2: The Squeakquel and its sequel, Chipwrecked), Phyllis Smith voices Sadness (you might remember her from her role of Phyllis Lapin-Vance in The Office), Lewis Black voices Anger (he is the funniest emotion in the whole film), Bill Hader voices Fear (he also voiced Flint Lockwood in Cloudy with a Chance of Meatballs and its sequel) and Mindy Kaling voices Disgust (who you might remember from voicing Taffyta Muttonfudge in Wreck-it-Ralph). Everyone does a great job at acting, but Amy Poehler, Phyllis Smith and Lewis Black stand out in particular. It's great how on their way back to headquarters, Joy and Sadness go through the process of a number of different things that happen to us, such as how dreams are made and where all our imagination lives (in Imagination Land, which was also a 3-part South Park episode). Inside Out is one of Disney and Pixar's best films to date. I might even go as far as to say it's the best film they've made. Oh, and why is this review late? America got Inside Out first on June 19th. Over here in the UK however, I had to wait until July 24th to see this. Was it worth the wait? Definitely.",
  "212": "I think we can all say that Pixar and the people behind 'Inside Out' have shown how guaranteed you are when you begin watching one of their latest animated feature. Its a story about a girls transition with her parents losing their home, moving on -- not just homes, but childhood to adulthood. Acceptance of sadness and an easily emotional tearjerker ending for the child in all of us. I grew up on Pixar, so I am a little bias, that's really no reason why anyone can't enjoy such an effectively emotional fireworks of colors 'Inside Out' can bring out of its feature. Finer, then porcelain animation, powerful story of fantasy and returnable enjoyment of another classic from the studio that has brought you the last animated film you watched and felt like thanking them with a review.",
  "213": "As a father of two girls who were once 11 years old (five years apart, thankfully), I speak from experience when I say delving into the mind of a pre-teen is no easy task.  While the execution might not be perfect (and while it didn’t make me cry), Pixar gets so much right with Inside Out, it will forever be a solid entry in their canon and a film worth revisiting at home.",
  "214": "As for movies, Pixar has been most of the time a mixed bag -- sometimes producing excellent animation movies like Up and Toy Story, others like Cars 2 (a not so good movie) and just solid movies (Brave). Though you have to give it credit for creating films like Wall-E, Ratatouille, The Incredibles, Finding Nemo, all of which were successful, some more than others. Now, about this genre animation thing, I've been pretty bored. Yeah, I have grown up since I watched animated movies, but that doesn't mean these pictures can become stale, boring and flat-out unoriginal. \"Up\" is pretty stupid if you look at it, however it's one of my favorite Pixar's output to this date, and I can't fathom how anyone could dislike it. I knew someone on the Internet who deeply despised it, and called the film \"sentimental, manipulative and nonsensical\". Jesus Christ, it's just a kid's movie, of course it's going to be silly and stuff, because it's for family entertainment. No one needs to be this harsh on a movie made only to appease children. But getting back to the original debate, I thought Pixar's old formula was getting too humdrum for my taste. Yesterday \"Inside Out\" proved to be a delightful trip for start to finish, and that is all thanks to its creativity. Corny little creatures inside of one's mind, with lots of scenarios like subconscious, islands of memories, dream production, among others is something that no one has ever seen. Along with some genuinely hilarious lines, the premise proved itself worthy, and the distinction the writers made with the characters was spot-on: Joy, Sadness, Anger, Disgust and Fear. It has got all the emotional mechanisms to drive Riley's growing personality forward. In this movie, everything is messed up. Riley goes to another city and is forced to say goodbye to her friends and home, which she loved. With her first day in school, Riley is put in the edge of breaking, and meanwhile Joy and Sadness get stuck in her long-term memory section. It's up to Joy to get back to headquarters and help Riley be happy again._x000D_ Now, you can extract from that brief synopsis some familiar tropes, previously and repetitively established in other Pixar's films: the focus on a child, necessity of teamwork, bla bla bla. What is surprising is that Pixar picks those monotonous rehashes and puts them in a cleverly written script (courtesy of Peter Docter). The jokes hit more than they miss, especially when you have such originality surrounding the film. The scenes in Riley's parents head were hilarious, with the father thinking about the ballgame and the mother having her mind focused on handsome playboys. In other words, it's packed with emotional and comedic stuff, and I appreciate it. I just wished they could have spent more time on Riley's parents mind._x000D_ Excellent, and only further enhances Pixar's already successful track record. This is a movie for all ages._x000D_ Final Score: 9/10",
  "215": "Not as good as some of the classic Pixar films such as Toy Story, Monsters Inc and Finding Nemo but there is still enjoyment to be had with this movie. There are lots of laughs and fun times happening in this movie that it keeps you into it but not as good as some of the other Pixar movies have done in the past. Its not the worst or the best Pixar in any sense just around the middle. I didn't laugh as much as I thought I was going too, however many of the kids and adults around me laughed a lot more. Animation is stellar in this movie and stays up to the Pixar standards. An enjoyable movie for both kids and adults but don't be expecting a life changing movie here.",
  "216": "Funniest movie I have seen in a long time. I was in tears because I was laughing so hard. Then I was in tears because things got a little sad. Then I was in tears because it was extremely funny again...... Apparently i cried through the whole movie :)",
  "217": "Inside Out is very original and there is so many revolutionary things going on in this film that it is hard to list them all off. It once again provides the depth that Pixar is known for. The characters are very well done and the voice acting is perfectly chosen. It really is a movie that you just have to watch yourself and it will blow you away. This plot is a very difficult one to convey onscreen and somehow Pixar did it again. We will have to see if they will be able to replicate the success with the Good Dinosaur later this year.",
  "218": "Inside out is a interesting film that gives you perspective and makes you think about how you portray your emotions and deal with life choices. The film follows a young girl named Riley and her eternal \"Control Station\" in her head that controls her Happiness ,Anger ,Fear,Sadness and disgust. Each is represented by a different character and each have voice actors who fit perfectly. It's extremely interesting to see how each emotion reacts to every situation and how you may relate to some or predict others before they happen. The humor is quite good as well, It's not like the movie was trying to make you laugh but you can find humor in lots of situations. Inside Out at times feels like a movie that adults may enjoy more then kids but that's mostly to the deeper meanings behind most jokes in the movie. Inside Out is a movie more enjoyable to watch the less you know about it so try and keep what you know about the movie to a minimum. Anyone who loves Pixar/Dreamsworks etc will enjoy Inside Out regardless and is also a movie I can see people coming back to in the future.",
  "219": "This movie really struck a chord as I too unwittingly moved at a young age and went through much of the turmoil that this movie's protagonist experienced.  I even slept on the floor the first night we arrived at our new home.  One of the best of the Pixar films.  Although I am disappointed at some of the cuts they made in the film.  Go to YouTube and you'll see what I mean.  Anyway, it's a great film and I assume that when I buy the Blu-Ray the missing scenes and moments will be there.",
  "220": "One of the most brilliant ideas for a movie I have seen. It has a great story, awesome humour and an incredible deep understanding about growing up and human emotions. Its the rare case were you can mix sad and matured themes with humour in a genuine way. The matured themes are growing up pains, a relocation to a new (unfamiliar) place and family troubles caused by it. The brilliant part is that you have a visualisation of the emotions in the head of each person working in a control centre. With Joy, Sadness, Fear, Anger and Disgust you have a great cast. Also the concept of memories, subconscious and ideas are well done. I am still amazed how so matured and sad themes mix with great humour in a way that non harms the other. I usually hate tragicomedies and while I think it is not one it leans in this direction. Like I said the humour works perfect. All jokes work and I am amazed about the creativity. I cant name not one other movie that took a concept and used it to this near perfection. Then there is the story. It is so relatable. The parts for growing up and moving to a new location are absolute true. If you experienced this too you will agree. All implications are natural and there is again no flaw. I cant say not much more about this without spoilers but you should know by this time that this is an awesome movie. Overall I am deeply impressed by this movie and I wish I had seen it as child because some thinks here would have helped me. This is the gold standard for creativity and a masterpiece for the ages. Definitely watch the scenes after the movie for a salvo of great jokes",
  "221": "The concept of Inside Out was interesting - what was even better was its execution. At the end of the movie I just wanted it to be a few hours longer, so I could keep watching it. - Absolutely loved it._x000D_There are some parts that I was a little annoyed with and I felt was dragging a little bit, but overall._x000D_Bravo on the great movie Pixar!",
  "222": "This movie is so good IT HAD ME IN TEARS with lovable characters and a uniqe story line with a strong meaning to the story that nothing else has its a good movie go check it out",
  "223": "Pixar kicks start the film with a beautiful opening score and slowly introduces the emotion characters throughout the platform of a simple normal growth experience of an 11-year-old girl. The plot is familiar but the creativity and conceptualisation of Pixar to tell the story from inside the mind of a girl using five different emotions - joy, sadness, anger, disgust and fear have brought their latest picture to secure the Oscars. Not only focusing on the emotions, the story further expands into memories (short/ long-term and core memories), imagination, dreams and forgetfulness in a fantastic landscape to construct the feeling, mind, reaction and soul of the main character. This original approach connects well both the adults and children, emotionally engaging, entertaining, visually colorful and inspiring. The level of intellectual and emotional daring are consistent until the end of this major emotion animation, reminding audiences the balancing of all these five feelings that leads to the human's capability of love and affection.",
  "224": "I thought that this film looked amazing and really took me on an emotional rollercoaster ride. The voice work is fantastic and the use of colour to evoke emotional response is at times intense. I've suffered from clinical depression for several years now, and the emotional manipulation that this film put me through really triggered a lot of sadness and fear within me that I know far too well. Whether that's a good thing or bad thing remains to be seen, but if a film can affect me in that way, I'd say it's pretty good. Whatever the case, I think that “Inside Out” is a good example of psychological education.",
  "225": "never has a movie before, let alone an animated film, made me feel surprisingly honest with my self and the struggles while growing up. Inside Out, highly regarded as the best movie in years, is sure to become a classic.",
  "226": "Melhor animação que poderia existir em tempos. Pixar mais uma vez mandando ver com sua originalidade que só ela tem. Em tempos de minions, essa é a animação da história.",
  "227": "To be honest when I first saw this I was thinking i was going to hate it, that'd it just be another cliche animated adventure, and I was actually hating it during the beginning but by an unexpected twist it takes a somewhat dark turn to what usually is refrained from children movies. That's when the movie truly shines when it goes into the dark depressing reality of life and how it's always going to change with many things going to be forgotten. The story is simple a girl named Reilly has a happy ordinary life with her family and these little emotions in her head keep her happy thanks to the lead emotion Joy, but the family suddenly moves and now she and Joy must come to terms that things have to change, Joy is basically the protagonist and her voice acting is amazing, as I've said she's mainly the leader amongst all the other emotions but during the adventure has to learn the importance of the emotions and how they should share in the duty to shape Reilly's life. Sadness is her exact opposite (and it's easy to tell why) and no one really knows why he's there but at the end he pulls through with everyone learning about his importance. Other characters however aren't really that important but still entertaining to watch._x000D_ Overall a masterpiece that can be enjoyed by kids, adults, critical thinkers, and artists._x000D_ (Spoilers ahead the review stops here)_x000D_The moment I knew I loved this movie was when Joy and Bing Bong fell into this abyss, and when all hope seemed lost they found a possible way to escape, however some very subtle foreshadowing was occurring and Bing Bong began to fade away saying to Joy he feels this next try will work, the scene was cliche all around but execution was flawless, while riding the magical 'spaceship' powered by music he sacrificed himself by leaping off allowing Joy to make it while he faded away with a farewell to Joy, this scene screamed thousands of undertones about that loss of innocence where things of the past will eventually fade, what follows is just silence that brought me on the verge of tears, it perhaps wouldn't effect a child but for a young adult like me it hit hard to look back and remember the things I've lost and forgotten...",
  "228": "Pixar made a great movie, Inside Out is an awesome Disney animation. As Pixar always does, inside out has ma very creative and unique story, you'll surely leave the theater with another vision. The film is great fun with happy and sad parts, a small downside is that unlike other Disney movies, you do not laugh often. The soundtrack is great and matches the film in many parts. The animation is amazing, you see every strand of hair and every particle on the screen, is very well done. Iside Out is another stunning work of Disney and Pixar worth watching with a great story and great animation. 9/10",
  "229": "you got me this was a lot better movie after all these years ....kids love it ..............the story was off the chain every one should rate it 100 % the imagination , animation is very good and teenagers should also watch it ............the most important thing this is a family movie kids will understand how to react with what and also respect to the elders and parents",
  "230": "\"Inside Out\" has beautiful animation and some great characters although there are a few hiccups with the story, this is still a must watch for any Pixar fan young or old.",
  "231": "esta pelicula es la  mejor de disney pixar es inposible que reciba algo no positivo es una completa maravilla y deberia tener secuela al ser la mejor de 2015",
  "232": "Director Pete Docter knew what he was doing as he pulled the animation studio away from the pool of mediocrity that has been under a drought for two years._x000D_ Released in 2015, this movie started out as a different idea called NEWT. It began work in 2008 and was planned to release the movie in 2012 but was canceled in 2010 as the plot was too similar to RIO. The next year, they gave the scrapped idea to Pete Docter who then thought of a new idea about emotions. These emotions became the movie of Inside Out which is an outright wonderful movie and a sincere apology of how PIXAR was below par over the last few years with the Cars 2 clunker, the sub-par Brave, and the unoriginal Monsters University._x000D_ The film has the same thing as UP with the first 10 minutes of growing up and then the rest being adventurous with a heartfelt finish. There are 5 emotions in Riley who guide her through life. Sadness, one of the five emotions wants to control her and ends up knocking every single core memory. Joy catches all the core memories but she and Sadness are accidently into long-term memory with the core memories. This is the most creative plot that I have ever seen from PIXAR_x000D_ This film succeeds in every way possible from its voice acting to its creativity. The idea itself is very creative. It’s a way of describing the brain in a unique way. Memory balls, abstract thought, memory dump, and more. It’s crazy that they have Dream Productions for movies played for dreams. There is also a console for controlling Riley for what she is doing. I definitely have to give PIXAR credit for having this movie be so creative._x000D_ What actually is impressive is that the voice acting for the five emotions themselves are totally in character. Amy Poehler plays as the peppy Joy. Phyllis Smith plays the depressing Sadness. Lewis Black plays the grumpy Anger which is my favorite. Mindy Kaling plays the be clean emotion of Disgust. Finally, Bill Hader plays the easily scared emotion of Fear. There are many great voices in this movie but these emotions really stayed in character._x000D_ What’s even more impressive is the laughable humor there is. I think it’s the funniest PIXAR flick since Ratatouille. There are so many jokes in this movie that even adults will find a good sense of humor. It’s an awesome skit with some of the best dialogue made into this movie._x000D_ Inside Out isn’t just really fun to watch, it’s also really smart and truly heartfelt as the movie continues on. I sniffed over on this more as Riley’s personality disappeared. It reminds people of how tough life at times can certainly be. Like UP, you will have to bring your tissues._x000D_ I don’t really have to explain the animation. It’s the same with PIXAR’s previous 14 flicks. Bright, colorful, vivid, exuberant, and eye popping. There is one flaw but it is minimal. One thing is that he 3D was useless since it added no depth, but the flaws are easily swamped by how amazing this movie really is._x000D_ Inside Out is the best PIXAR movie in years. It’s currently my favorite movie this summer and one of my favorite films this year. It’s glorious, humorous, and highly emotional. Plus, stay for the end credits. It is really funny to see other people's emotions inside. Call PIXAR back on track and have it win best animated movie of the year in the 2016 Oscars. By the way, Inside Out will easily win best animated feature and it will be possible for this movie to be up for best picture, but it will most likely won't win best picture._x000D_ P.S.:  Our local critic gave this movie an A grade so there is no reason to skip the movie._x000D_ UPDATE: On July 5th, I saw the movie again with my aunt, my grandpa, and my cousin.  They all liked it giving grades of A+, B+, and a B.  This is the consensus that I made up with this experience:_x000D_ \"This movie is not Up, but it isn't Brave either.\"_x000D_ (Before the film, there is a heartwarming short film called Lava. It’s about how two volcanoes fall in love. It was sweet, charming, and cute.)",
  "233": "a truly inspiring, emotional, and moving but simple movie. very strong plot and have a good psychological education value. nicely wrapped soundtracks, and amazing animation. good for a whole family!",
  "234": "Inside Out was Pixar's first amazing movie in a long time. With the out pour of horrible or bland Pixar movies just years earlier I think this was Pixar's reinvention and they knew it. It's story to it's characters is nothing short of fantastic and unforgettable. As they for sure use cheap emotional moments to make all of us cry I can still full heartedly say that this is one of Pixar's best movies to date.",
  "235": "pixar appealed this movie to all of us in this movie with showing whats it like to grow up and how you feel_x000D_and in a way only pixar can make you feel .",
  "236": "Mind-blowing! Pardon the pun, but it's definitely applicable. Such a great story with a little bit of everything, it'll make you think about how our minds really work. There's something for everyone, though I feel like it skews a little more to the adults than the kids. I'm pretty sure this just unseated 'Up' as my top Pixar movie...it was definitely worth the wait!",
  "237": "Would \"Inside Out\" be enjoyed by kids?  I don't know; I'm in my late twenties and childless.  I can say that my husband and I enjoyed the movie.  At various points we teared up, chuckled, and outright cried.  The pacing stalled in the middle, but it got back on track.  There were a couple of turns at the end that left me a bit puzzled, but overall the movie worked quite well.  It was fascinating and impressive to see a fun kids' movie about cognitive concepts, and I hope it may help children and adults be able to see other ways to look at the relationships between emotions, self, and behavior.  \"Anger is in control of me right now\" is a lot easier and less threatening to change than \"I am angry.\"",
  "238": "This movie, while I don't think it's as good as the critics are saying, I still enjoyed it enough to give it a solid 8. The presentation is as good as you would expect from Pixar, the voice acting was great ( I personally liked Anger the best,) the story, while a bit predictable, is still fun to see unfold. Overall I can see why critics gave it the score they did, and I wouldn't be surprised if this movie gets an Oscar nod or two.",
  "239": "its an OK movie for it being a kids movie. The plot was really easy to understand and predict. its a good watch if you got kids._x000D_ The only thing id have to say/ask is was this movie about a lesbian/trans-gender kid cause everyone in the movie had same sex emotions. guys had guy emotions and girls had girl but the kid had girl and guy emotions.",
  "240": "Pixar created another great original movie with \"Parks and Recreation\" Emmy-nominated star Amy Poehler as the main character Joy. 'Joy' could be the word to describe this phenomenal movie. It's great for all ages and deserves all the acclaim its receiving. Oscar buzz is swarming this movie, as it should.",
  "241": "A ravishing rendition and depiction of the ups,downs, and, challenges that most of us-children & adults face in our everday lives, which builds up our personalities both inside-out.",
  "242": "inteligente, simples, lindo, essas palavras definem essa obra prima da pixar, nos últimos anos a pixar estava fazendo filmes normais, nada de impressionantes, mas com divertida mente ( inside out ) a pixar está de volta. parabéns pixar",
  "243": "Inside Out is the newest Pixar movie and also one of their best ever,which clearly means that this movie is something special._x000D_This movie is about Riley,an 11 year old girl from Minnesota who loves Hockey and lives happily with her mom and dad.But everything falls apart when they move to San Francisco,where she has to deal with a new house,and new school where she needs to make new friends and her emotions Joy,Sadness,Fear,Anger and Disgust guide her through these life changing events.Though,affected by these changes,Sadness makes a few mistakes that end up with her and Joy,into the far reaches of Riley's mind and with only Fear,Anger and Disgust left to the head quarters to guide Riley and to try and maintain positive thinking._x000D_First off to begin with,the emotions and their voice cast in this movie is all around perfect.Starting with Joy,voiced by Amy Poehler,Fear by Bill Hader,Disgust by Mindy Kaling,Anger by Lewis Black and Sadness by Phyllis Smith.They all do a masterful job in here,giving the right voice \"emotion\" to their emotions._x000D_Pete Docter is the director of this movie,he previously directed Monsters Inc,which I truly love,and Up,which is my all time favorite animated movie.This guy is a genius at this.He has mastered the art of the animation so well now that everything he does,its perfect._x000D_I really liked the way the world inside the mind was presented.I think they found new and interesting ways to show that to us and to impress us.The animation is gorgeous as every other Pixar movie ever,but what makes this movie great,it is the story,that its special and amazing.It is also very funny and will most certainly brings tears of joy (literally) to those who watch it._x000D_Kids should see this movie,because they will have fun and marvel at the animation,and laugh at the jokes in it.They will also learn about emotions and about what makes us human as a whole.But quiet frankly,in my opinion this movie is targeted more to adults,because of its thematic and interesting plot and I am pretty sure that adults will get the best of this movie,which is a weird thing to say about an animation,but then again,this is Pixar and you can except anything from these miracle workers._x000D_I honestly cried like 3 times in this movie,which is to be expected from this director,after that truly sad and masterpiece of a movie that he made before this,Up,and from what I heard,a lot of people cried also which is an astonishing achievement for the crew._x000D_I read an article on how Psychiatrists around the world are really loving this movie,which can clearly tell you just how amazing and well thought Inside Out is.They are saying that kids should definitely see this movie and that it can teach them a lot about emotions which is a hard thematic discussion to have for adults with their children._x000D_This is a stunning and original movie,also by far the best Pixar movie since Toy Story 3,and in my opinion,in Top 3 of all time Pixar movies.Everyone should watch this movie and I hope that it gets nominated for Best Picture,as Pixar's two earlier movies (Up and Toy Story 3).",
  "244": "A grown man can cry at the movies, yes he can, this is the proof. A delightful Pixar animated film, with amazing characters, fantastic voice acting, gorgeous animation and a rich poignant story. Everything in the film has its place, it is smart, clever, hilarious and also sad and depressing. But everything comes together in a perfect mixture to give you a heartfelt Pixar masterpiece about growing up and moving on that makes Toy Story fear it will loose the best animated movie of all time crown it has been monopolizing since 1995.",
  "245": "Inside Out is a very well done animation that appeals to both kids and adults. It creates a unique take on how the mind works, but probably not the most accurate. But, it's a Pixar movie. Who cares about realism? Inside Out has the 5 base emotions as characters. These characters are Joy, Anger, Sadness, Fear, and Disgust. These characters all have like-able qualities about them and are very rememberable. Inside Out is another example of how Pixar can be extremely creative and adventurous. 9/10",
  "246": "Over 20 years and 15 features, the Pixar brain trust has devised enduring and ingenious means of exploring dystopia (Wall-E), aging (Up, the Toy Story trilogy), the artistic impulse (Ratatouille), and the nature of greatness in an age that doubts it (The Incredibles). Inside Out, Pixar's well-oiled new feature, boldly ups the ante on the studio's penchant for high-concept family entertainments: Most of the film takes place in the mind of an 11-year-old girl, and its central crisis revolves around the fungibility of memory. Director Pete Docter envisions the human mind as a sort of ongoing board meeting, where five primary emotions engage in the immediate tasks of impulse-governing and crisis-management in front of a vast backdrop of core values and archived memories, which constitute our consistent yet constantly evolving identities. Inside Out's plot is little more than an excuse to tour this massive expanse of what turns out to be rigorously demarcated emotional terrain; as such, Docter's film often feels both wonderfully complex and weirdly reductive at the same time. That formula, though, seems as sound an embodiment of the human brain as any other._x000D_ Inside Out begins alongside the life of Riley (voiced, as a tween, by Kaitlyn Dias). As she begins to make sounds and express feelings, Riley's brain spawns new emotions, and first comes Joy (Amy Poehler), who makes Riley giggle as the newborn looks, gauzy-eyed, at her parents (Diane Lane and Kyle McLachlan). Joy, a densely packed mass of radiant particles, is subsequently joined in Riley's control room by Fear (Bill Hader), Anger (Lewis Black), Disgust (Mindy Kaling), and Sadness (Phyllis Smith), who genially and alternately take the reins of a panel that transforms Riley's reactions into gestures and, later, sentences. These reactions transform, one by one, into memories, which take the form of tiny, translucent orbs. They roll, like bowling balls, onto neat shelves stocked with moments, all color-coded to match the presiding emotion of each memory. At age 11, Joy is the dominant force in Riley's mind, but her relentless cheer is imperiled when Riley's parents uproot her from Minnesota to San Francisco, as her father pursues a startup venture and the family moves into a narrow, shabby fixer-upper._x000D_ Despite these gestures to Silicon Valley and gentrification, Inside Out's values and concerns are reassuringly timeless. Riley isn't beholden to neuroscience or contemporary debates about creative genes and parenting strategies; she's an athletically inclined pre-teen trying to, with Joy's encouragement, make the best of an abrupt transition. Her struggles begin when, back in the control room, Sadness begins to obtain some unique powers. With just a touch, formerly happy memories become tinged with pain, and Sadness herself becomes morbidly fascinated with exploring her potential. Joy, rendered by Poehler as a slightly gentler, but even more chipper, version of her control-freak Leslie Knope, cannot abide Sadness's incursions. (Smith does an outstanding job of conveying the variegated hues and motives of melancholy.) After Sadness commandeers Riley's first day at her new school, in the form of a devastatingly uncomfortable introductory speech to her classmates, the two battle over Riley's sacred core memories. In the process, Joy, Sadness, and all of Riley's most pivotal remembrances are sucked out of the control room and into the expanse of Riley's brain._x000D_ From here, Inside Out maneuvers with impressive but heavily plotted fluidity between three planes of action: Fear, Anger, and Disgust are left to play the primary motivators for Riley's behavior; Riley herself becomes despondent, attempting to commit the ultimate genteel childhood crime of running away from home; meanwhile, Joy and Sadness tour Riley's brain as they try to make it back to headquarters. By dint of its conceit, Docter's film unfurls with a busy determinism that can be tiring, recalling the overwrought travelogue of Up's middle act: Anger never gets mad without first announcing that he's going to get mad, and Joy and Sadness's sojourn through the territories of Riley's mind follows a regressive arc. It begins in a quaint, quintessentially Pixarian factory setting (day-wage workers erase phone numbers to make room for new information) and ends in a despairing junkyard of forgotten tidbits, where one bland supporting character (Richard Kind's Bing-Bong, Riley's former imaginary friend) martyrs himself in order to vault Joy and Sadness back to their rightful home in the child's mind.",
  "247": "What a movie! I was so close to crying! Absolute masterpiece btw just watched it and i have to say that it's as good as Frozen! and that i think is saying alot! 10/10 Deserved!",
  "248": "Inside out is a fantastic film by Pixar!. I loved how visually beautiful inside out was the colours were vibrant and was lifted by the fantastic animation along with it., the film really spoke to me it was a tale about a child going through depression and they explained in the most kid friendly way possible which is a good thing because this is a means of speaking to children about depression. my only minor flaw is that when joy and sadness leave headquarters there was really no consequence to it she got angry her dad once that was it._x000D_Overall: Great film for all ages",
  "249": "One of, if not the best Pixar movie or all time. The idea is very clever, it makes your think about what emotions run your head and how do your emotions help you. Inside Out also has a lot for adults to think about, like how The Incredibles made adults think as well. When Bing Bong is \"forgotten\" it shows Riley letting go of childhood and that she's growing up and it shows kids that we can let go",
  "250": "Inside Out is a revelation. Pixar did a very hardworking process on the film. It takes you on a voyage to the human rain and that is so cool. When you have emotions, they're in your head. Emotions can be like people in your head. Your the boss of your own emotions because it's your body. Be joyful with this movie. It can help you learn about the brain and emotions especially physiology, neurology, and psychiatry. Learning is fun when you watch Inside out. Disney and Pixar can show you the efforts of building your own imagination. Imagination is beautiful because it's full of possibilities and ambitions. Way to go Disney and pixar.",
  "251": "This is one of the most emotional, adorable, and down right hilarious films of all time. I think I'll lose it if they don't make a sequel. This is going to be the next Frozen.",
  "252": "An absolutely revolutionary insight into philosophy and unanswered questions that might remain so for years to come. Don't be fooled or put off by its soft animation and childish colours; this film is Pixar at its finest, yet simultaneously a new approach for a film plot altogether._x000D_Inside Out has just the right amount of content, running time, fun and depth for all audiences to enjoy it. I'm still thinking about this film several weeks after I've seen, which only proves my, and hundreds of others' point that this is a MUST SEE.",
  "253": "Buluş çok başarılı, çizimler süper ve etkili ancak duygusal ve aile kurumunun yeniden kuruluşu konusu bir miktar tartışmaya açık. Kavramlar çok derin değil yüzeysel işlenmiş bu nedenle iki puan kırdım... Ancak izlerken eğlendiğimi söylemeliyim. Özellikle küçüklere zihnin işleyişine dair başarılı bir anlatım olmuş tartışmaya açık bölümleri olsa da...",
  "254": "Original movie! The Return of Pixar! This movie is in our hearts. A movie with an excellent screenplay and moral. Besides, the movie forgets ugly movies like Cars 2. This movie deserves to be nominated a the Oscars for Best Animated Feature Film until for Best Picture (like Up, Toy Story 3 and The Beauty and the Beast).",
  "255": "A decent movie, with a lot of heart. Fun, exceptionally imaginative, touches on heavy ideas while presenting a story that kids can enjoy. The downfall is that it doesn't delve deeper into the ideas of mental health to make any sort of statement. This movie could have been a great teaching tool for teaching children not to judge those who suffer mental illnesses, and instead it just makes it seem like a problem that's easily resolved. An unfortunate stigma that many with chronic illnesses must endure on top of struggling with their health.",
  "256": "It wasn't incredible. Don't get me wrong the movie was awesome but not all that I hoped for it to be. To me the trailer and the premise od the story are way to different for me to like it. To me it feels like im watching two different things. And the characters arent well balanced either. There was no suspensive feeling and the way they handled things just made it all to confusing. You can obviously tell the emotions of each characeter, yeah, but inside out made some of the emotions seem blunt and unneeded. This movie did a horrible job on fufilling it's purpose but overall it wasn't bad.",
  "257": "It was okay, but not anything close to what the critics hyped it up to be. Some parts were boring and felt unnecessary, so you have to have a bit of patience. It was very emotional at some parts and not very funny. The only funny part was from the trailer so everyone had already seen it. It wasn't really directed towards a certain age group. It was to deep and not fun enough for kids, and to strange for teens and adults. The idea was good but the movie just felt like a stretched out ten minute Pixar short. Overall it was alright, but had the potential to be a great, fun family movie.",
  "258": "Inside Out is Disney's and Pixar's recently released film that unfortunately fell short of being another masterpiece from the minds of Pixar and Disney. Now don't get me wrong the movie was amazing! Beautiful animation, perfect voice acting, emotional story line, but that's the problem here. When people see movies from Pixar they expect the emotions to be evenly balanced between being 50% funny and 50% serious, but in Inside Out ventures out into a subject that requires a very knowledgeable understanding of the depth of the topic, but since it's their first time trying to get that serious, they did that to the best of their abilities and left a very big and important tone for the viewers to absorb, and that tone is not a stranger to anybody because we all go through these thing every day, and you know what? Change, is very dangerous and beautiful thing that is inside us all, and Riley was going through a very big change that threw her onto paths and roads less taken, and on second thought, Inside Out might as well be another Pixar masterpiece not for the animation or the voice acting, but for it's heart wrenching tone that people are looking for ways to coexist with in their lives, and in this film that tone is sent and received to everybody watched the film.",
  "259": "A fun movie with lots of emotions and life lessons, but also whimsical fun. Great for the whole family._x000D_ The graphics do not dissapoint, there is exceptional detail throughout the movie. A pleasure to watch.",
  "260": "Disney never gets animated movies wrong and well they did it again,it wasnt the best movie out there but it is the best movie in 2015 so far and also I wonder if disney had a had a hidden message of mood disorder",
  "261": "Despite not being as original as everyone is saying, this film is still very inventive and nothing like Pixar has done before. It reminds me of the days when Pixar weren't just sequel making for profit, and when their films were clever and enjoyable for the whole family. I'm a big fan of most of Pixar's films (Excluding Cars 2), so I knew I was going to enjoy this one in some sense. And boy, did I ever. If you're looking for a film to take your kids to, I recommend this one. They will enjoy it and you will too!",
  "262": "Inside Out succeeds in that it has good animation, a fantastic voice cast, is heartfelt and very creative. This marks a different term for Pixar that is steering in the direction of more smart and witty films. It's films have always been that way but this is much different. The Incredibles had humour that was at most times for the adults. Inside Out has humour that kids and adults will both enjoy. Monsters University failed in that as most of the humour was geared more towards children. Another thing I loved about this film was that it was so colourful, believable (yes believable) and really made you question what you know. I was sitting in the theatre thinking, how do the emotions have other emotions when they are the emotions themselves. But then I remembered, it's a cartoon. I shouldn't say cartoon. It's an animated feature. Now for the reason iI rated it 8 and not 10. Inside Out is short, and at times it feels rushed. In that rushed time it introduces many characters, and many which are obsolete and not needed. It also feels like the heartfelt ending is also a little rushed and did not give me the feeling I got from watching Monsters Inc. But, every film has it's flaws. Overall, Inside Out is a must see and is something that I think everyone can appreciate.",
  "263": "It's isn't as if I purport to be some archetypical tough guy, but I'm just not one to cry in the theatre. Inside out got me though. Boy, did it get me.",
  "264": "Loved the movie.  These Pixar movies are always cute and fun and that was certainly true with this one.  Nice plot and fun for the entire family.  I would reccomend",
  "265": "This movie is perfet, feelings emotions that spark is no longer today, 10 for Disney and pixar, in truth you are small or adult disney masterpiece calara you to the heart",
  "266": "Inside Out, it was an incredible and emotional film with very good characters and an incredibly moving story that brought me a tear, and its backgrounds are very well managed, a very good movie of the Pixar house.",
  "267": "Amazing and very original movie!    Good job Pixar! Must to watch!",
  "268": "This is one of Pixar's greatest movies ever. No matter what age you are you will feel all the emotions described in the movie. The message the movie gives at the end, if you pay attention to it, can really help a person who's going through an emotional phase as well. Could be the best family movie of the year.",
  "269": "Never a movie has made me dry my tears from my face, and my eyes got wet with up to 3 different emotions. For me, this movie is just perfect, not as a colourful movie for children, but as a piece of art._x000D_In 94 minutes, they aren't just able to make me cry and feel a lot of different emotions, they also recreate our minds in a brilliant way, mixing different psychological theories. And they still have time to make a deep view through what our society has decided about what is good and what is bad to feel, showing the real value of each feeling and the bad consequences of forcing ourselves into showing always a smile when it's actually out of context. It deserves, at least, a nomination to the \"big\" Oscar. 10/10",
  "270": "Just three words............................................................................................................................................................................................................................................PRESS THE BUTTON!",
  "271": "With a modern and fresh take on the growing up concept. Inside out is a humble story with a lot of details behind it._x000D_This story gives you a gentle surprise as you sit down to watch it while guiding you through an incredibly interesting and fun new world of adventures in imagination land leaving you wanting more. With a hint that there will be.",
  "272": "This film is lovably Pixar. it's brightly coloured and original and charismatic whilst also smacking you in the face with sadness and making you cry like a little girl in the theatre._x000D_ but unlike Toy Story and Up and Pixars other emotional rollercoasters, Inside Out seems to go over childrens heads a little._x000D_ All of Pixars narratives are moralistic or underlying a major theme in some way and Inside Out is no different, but with Inside Out it seems to be too subtle and too articulate and complex for the average child to fully understand and appreciate._x000D_ But that does not lessen the enjoyment of the picture overall, and I highly recommend you watch it... just bring some tissues.",
  "273": "Loved this movie and I cried but I'm giving it a 6 because I expected more. It felt a bit one-sided so to speak. I was expecting more character and that the story would cover several years of her life struggling with depression. Other than what was it? 1 week?",
  "274": "Just like with basically every other Pixar movie, this one is amazing. Its a great concept that they really pulled off. Best kids movie of the year for sure!",
  "275": "Enjoyed this film with a sophisticated 13-year old.  Although there were slow bits, generally the movie moved along with wit and suspense.  Great imagery, smart dialogue and a psychologically adept interpretation of the inner workings of our emotions.  At the end we agreed that it was a fine film, and \"not for children\" - too sophisticated!",
  "276": "Another Pixar masterpiece. Inside Out is visually stunning and meaningfully captivating. The idea of tacking the topic of emotions and succesfully put it into an animated family movie is brilliant. It starts with a typical introduction of the characters that ingeniously transforms into a wild and touching plot. As soon as Riley's family move out of their hometown and have a new life in San Francisco the emotions in Riley's head try to figure out how to work with this drastic change. Joy is vibrant and full of life that leads the other emotions so that Riley will be happy and somewhat isolating Sadness out of the picture. As soon as things turn against them. Joy and Sadness are given a journey that will make them understand each other's purpose. Meanwhile the other emotions try to control Riley and end up making her emotionally confused. Towards the end Joy discovers that Sadness has a great part in the development of Riley. The message of the movie is clear. There won't be joy without sadness. Another lesson that Pixar instills in the minds of children, but surprisingly adults can also relate to this movie. Parents can relate and understand how their children feel and how great of a part Joy and Sadness play in our lives. This movie is one of the best animated movies ever crafted. It shows a great lesson and discovery in its viewers. Absolutely heartfelt and meaningful. It leaves you thinking about it and its very mature but important topic. Pixar outdid itself again. Releasing something close to the heart something viewers haven't felt since the first Toy Story.  It is a compilation of all of Pixar's movies in one bright and heart piercing beauty.",
  "277": "A film that all parents should see. It shows the feelings of the growth stage of the young, showing clearly and in a fun and sentimental way as it affects them.",
  "278": "I think Pixar has found it's way to make really great movies again. Not saying their previous work is bad, but the lack of originality was an issue. Inside Out is Pixar way to say that they have plenty stories to tell.",
  "279": "One of my favourite Pixar films to date that provides a comedic insight into what makes a human being. It is funny, engaging and fully enjoyable. Pixar's best since The Incredibles.",
  "280": "I will say the truth: I've never seen this film before, but I already saw it in a trailer. But Disney/Pixar's \"Inside Out\" can change the life of some viewers, mostly for teenagers, because the story of a film is about a teenager named Riley and how does she lived her life as a teenager, like ordinary teenagers in real life. This movie has a lot of moral lessons, humors, dramatic scenes, and many more. This movie is perfect for the people around the world, most especially family.",
  "281": "\"Inside Out\" personifies five emotions (Joy, Sadness, Anger, Disgust and Fear), making them and the film not only enjoyable, but relatable.  Docter and Del Carmen have created a beautiful film that returns to the height not seen since 2010's \"Toy Story 3\". This film will no doubt be a shiny gem in Disney/Pixar's crown!",
  "282": "I love animated films and this one was definitely up to par! I found myself laughing and crying and on the edge of my seat for those \"oh no!\" type moments.  I would definitely have to say this is by far one of my most recent favorite movies. The movie as a whole was a little long (they could have shortened the journey back to Headquarters a bit) but I felt engaged the entire time._x000D_ I think it takes a lot of time and great insight to animate what really goes on inside our brains. It was really interesting to see how Riley's \"Islands\" changed as she grew older and began to \"forget\" things from when she was younger._x000D_ Overall I give this movie a 10, definitely one of the best Pixar films to date.",
  "283": "I was very please with this Pixar movie. It felt a lot different than the other Pixar movies that I have come to know. They all seemed to have the same story line and it was starting to get old. When I first watched a preview for this film, I was very excited to see what it had in store for the audience._x000D_ I originally was very hesitant about going to see this film because children's movies usually are not my favorite. I was very surprised when I walked out of this movie because it kept me so engaged the whole time that I could not believe it was over. I found myself getting upset and even relating to the film about certain emotions that we all have. I gave this film a 10 because I truly felt like it was a film for all ages. It was a very good film for young children because it gave them a look inside their own head. As young children, they can sometimes be confused by their own emotions because they have never experienced them before. I thought this was a great and new way to teach children about their different emotions and how to deal with them. I also felt like it was a great lesson for adults as well. Not only does it teach them about their emotions, but it shows because how to deal with children's emotions, while putting it into a cute film._x000D_ I was not surprised to see that this movie had great reviews. Everyone I have talked to has absolutely loved it and the message that it displayed. It was something new and not like any of Pixar's other films. I would definitely recommend this film to all ages. It is a cute film that pulls at your heart strings as you can relate to many, if not all, of the emotions that young Riley has.",
  "284": "It's an extraordinarily beautiful movie that can sneak up on even the most cold-hearted of skeptics and touch them beyond tears!_x000D_ Watch it here for free: https://www.primewire.ag/watch-2764486-Inside-Out-online-free",
  "285": "Gorgeously animated, inventive and powerfully moving. It's truly a heart touching story about common problems children face and how their emotions react based on the situation. what an astonishing idea, what an amazing development, what a heart-wrenching drama . It's the Pixar we knew and loved for years. I must admit I've never seen anything quite like this",
  "286": "A Pixar masterpiece. Not by virtue of content matter, but by execution. Not Pixar's funniest film...and maybe that's a good thing, since sometimes humour just gets in the way.",
  "287": "What a Film! What a Lovely film! what a word INSIDE OUT ! again Pixar is on the scene, you never saw something like this! this film learned us happiness and sadness are supplement , definitely this movie will win all the prizes specially Oscar ! but pixar made a bad mistake ! The Good Dinosaur and Inside Out both in one year ? :/",
  "288": "An Awseome unimaginable movie ever made. This film contain comedy, emotions and everything that a movie should contain. Watch this movie and you will cry at last moment",
  "289": "Really funny and  well made, I consider is a great achievement for Pixar. For all childrens is a really good movie, for a major public Im not sure that everybody will love it.",
  "290": "It is great,make sense, the characters are well made, and that hilarious chimerical is the icing on the feelings, and Bing Bong cake,MMMMM delicios. delicious and pixar at there best.",
  "291": "Quite simply a masterpiece. When I saw the poster for this, I expected a MetaScore of about 42. But this film is everything that makes Disney and Pixar good. Humorous, original, witty, and heartfelt are just some of the compliments that this film has more than earned.",
  "292": "Probably one of the best Pixar movies of all time. The emotional coaster that this will put you on is a crazy one. Better than Toy Story imo don't @ me.",
  "293": "Pixar often featured movies encapsulating themes of growing up. Finding Nemo, Toy Story (franchise), Up and many more have been praised by the unconventional encasement of a coming-of-age story mixed with traditional youthful storylines. 2015 had been successful for Pixar as Inside Out presented an intriguing storyline matched with emotional depth._x000D_ Frankly, I've waited for the release of this movie for over a year after seeing a trailer of it from Big Hero 6 and I am deeply ecstatic with the results. The characters were not just one-dimensional and it seemed like  the emotions also had their own persona and just magnify what they are about such as Joy being outwardly \"Joyful\" though can also feel sadness and other emotions as well._x000D_ The casting was superb. Everyone did an incredible job. I am a big fan of SNL and they train comedians well by giving them random roles on their skits._x000D_ Most importantly, the storyline prompted me to give the movie an A+ grade. It is a nice metaphor of what happens inside the head of a child who is in the verge of undergoing the tedious process of puberty. It did not sugarcoat the pain of growing up rather it was brave enough to show what it really feels even if other people would castigate the movie due to its depressing atmosphere. It also explored the best lands we could ever explore--- the mind._x000D_ Overall, this movie deserves a 10 just like other Pixar films which I grew up with. But this one stands out due to its sheer originality and bold overall concept.",
  "294": "An outclass film, crafted perfectly around a marvellous idea. I was very much curious to watch this movie since I heard that the main characters in the movie are human emotions, after all I wanted to get inside my own head for once. From tiny details of memories, dreams and subconscious to the complex behavioural patterns, Inside Out is total knock out. Although physical appearance and motion of Main character Joy, reminded me Penny from The Big Bang Theory, but it was Amy Poehler who stands above all other aspects (except for the idea) of the movie.",
  "295": "First time since Toy Story 3 that I am again excited for a Pixar movie and it delivered. Everything I love about Pixar, gorgeous animation/ visuals, touching story and original ideas on an (I have to give in) already existing concept. Voice acting is superb as well and casted perfectly especially anger. Overall I can just give the recommendation to see this movie. 10/10",
  "296": "Great movie for the whole family, honestly a very thought out idea, Disney is really at the head of the game, but i mean when aren't they? I think their could be sequels to this movie FOREVER because it's about peoples feelings and what your thinking everyday, so they can have a new character every movie for the rest of eternity!!!!!!!!!1",
  "297": "Trama muy original y completamente recomendada para sus familias, ya sean niños o cualquier joven o adulto amante de las películas de animación. Película muy notable.",
  "298": "It deserved a higher score, if it weren't for the constant silliness of some scenes (like Joy's overly-optimistic lines). First off, nicely animated and well scripted, things connect very well, which is a definite plus. Also, the other emotions (specifically Disgust and Anger) are just lovely._x000D_ Secondly, the turning point of the movie, what actually made the leap from mediocre to great was that scene where the imaginary friend is left behind, very emotional, masterfully done. That was memorable, that was a moment we all could relate to (even if we didn't have an imaginary friend). The scene illustrates so well the sacrifice every child has to make when entering adulthood._x000D_ An emotional and delightful movie!",
  "299": "._x000D_\"Inside Out\" was decent, but nothing spectacular. It was somewhat overwritten and somewhat over-produced. Plus, it was too talky and a little too sophisticated for young kids. Pixar has had a few nice features. Their animation is outstanding, But for the most part they are a little overrated. Their story lines are just so-so. Brave, Up, Cars, Cars 2, Monsters University, Ratatouille, were all too slow for kids (and for a lot of adults). Heck, to be honest, I've NEVER been blown away by any of Pixar's features. However, their movies are just good enough to make me want to see the next one.",
  "300": "Pixar hits another homerun here. It's a wonderfully creative and complex concept which is executed really well and it's surprisingly mature compared to other Pixar ventures.",
  "301": "Holly mother of god this movie is the Best and the most awesome Pixar Movie Of all. The story of this movie was great and heartwarming and orignal the cast were amazing Amy, Bill, Mindy, Lewis, Phillis and everyone is awesome. I saw this movie three times i'd laughed three times and Cried Three times. inside Out is indeed the best Pixar movie of all along with Monsters Inc, The Toy Story Movies, Finding Nemo, The Incredibles.",
  "302": "Pixar again heads the class…_x000D_Fittingly for a movie set inside someone’s head, Pixar’s 15th feature is a fireworks display of fizzing ideas and bursts of imagination. By some distance the animation giant’s finest since Toy Story 3 kicked the stuffing from us all in 2010, it shows just why director Pete Docter (Monsters Inc., Up) and the rest of Pixar’s key creatives call themselves the ‘Brain Trust’._x000D_ The heroine/host of Inside Out is 11-year-old Riley (Kaitlyn Dias), whose happy Minnesotan childhood bites dust when her parents (Kyle McLachlan, Diane Lane) decide to up sticks to San Francisco. Until now, the five Emotions that marshal Riley’s thoughts and feelings (they reside inside Headquarters, operating a control panel and looking out through the windows of her eyes) have been captained by Joy (Amy Poehler), a round-faced saucer-eyed cherub dressed in sunny yellow._x000D_ Three of the other four Emotions – needle-thin, purple Fear (Bill Hader), short, square, crimson Anger (Lewis Black) and recoiling, green Disgust (Mindy Kaling) – have been on the periphery of things, while hunched, pouty, blue Sadness (Phyllis Smith) has lurked so deep in the background as to be almost out of sight, out of mind. But now, with Riley hating her new house, unable to make friends and losing her mojo on the hockey ice, Sadness is suddenly working front and centre._x000D_ Riley’s misery in Minnesota is only the outside story. The inner journey sees Joy and Sadness get accidentally locked out of Headquarters, lost in a candy-coloured mindscape of vast dimensions. In order to return and wrestle the controls from Fear, Anger and Disgust, they must navigate a vast zone packed with seemingly infinite memories, each one a glowing sphere, and such distinctive regions as Imagination Land, Dream Production, Subconscious and Abstract Thought. Joy, of course, tries to lead the way, but it is only by accepting Sadness that a solution might be found._x000D_ Even by the standards of the Pixar bods, who make it their business to mix brain with heart in order to entertain adults as much as kids, this is, well, heady stuff, sure to boggle fragile little minds. And there’s more, too, with Personality Islands, a literal Train Of Thought and a prized vault of Core Memories that have shaped and shaded Riley’s spirit._x000D_ This last, especially, is a tricky concept for nippers to grasp, even before it’s revealed that Riley’s increasingly downbeat mood can filter perception to show old events in a different light – Core Memories, forever golden, are suddenly tinged blue for they now represent that which has been lost. As the voices in Keanu Reeves’ head might say in unison, Whoa._x000D_ But even as the bigger-brained concepts pass the little ones by, they’ll be dazzled by the bright animation of the retro-styled interior landscapes, and by the darker, more realistically rendered ‘real world’. Inside Out, like all Pixar movies (yes, even Cars 2), is a technical marvel, and the perilous journey undertaken by Joy and Sadness is sure to command attention, with its collapsing panoramas representing Riley’s crumbling innocence._x000D_ It’s scary stuff, on several levels, which makes the presence of Riley’s former imaginary friend, Bing Bong – part cat, part dolphin, part elephant – a welcome inclusion, his affable bumbling dovetailing with Poehler’s indomitable, sing-song radiance (she makes Dory sound depressed) to add grins to grimaces._x000D_ Also arriving thick and fast are the gags, be it glimpses into the workings of other people’s minds, the dumping of needless memories to make room for new ones (there go the names of all the US Presidents) or a delicious explanation as to the origin of earworms. It’s sterling stuff, with one throwaway gag pertaining to YA vampires providing the biggest laugh you’ll likely hear in a cinema this year. Oh, to peek inside the Brain Trust’s heads – those trains of thought rocketing hither and thither must look like time-lapse footage of Waterloo Station._x000D_ Given Pixar’s recent favouring of sequels, Inside Out deserves applause for bringing such a dazzling original concept to our screens, even if it does harbour a passing resemblance to classic Beano strip The Numskulls. That said, this, more than any other Pixar movie, demands a sequel, trilogy or more, much as Francois Truffaut revisited his The 400 Blows hero, Antoine Doinel, throughout life. Can you imagine what will be going on in Riley’s head when she becomes a teenager, or goes to university and discovers mind-altering substances, or hits middle age? You know that Pixar can; it’s a no-brainer._x000D_ Like the Toy Story trilogy, Inside Out is about leaving childhood behind. It’s not quite as moving as those films but it is A-grade Pixar, full of Sadness and Joy.",
  "303": "Pixar's all-star tour of a preteen girl's head is a flat-out masterpiece_x000D_ An 11-year-old girl wrestles with the bickering emotions inside her head. It sounds like a therapy session. Instead, Pixar's 15th feature is another landmark, an unmissable film triumph that raises the bar on what animation can do and proves that live action doesn't have dibs on cinematic art. Oh, did I say it was funny? It is, uproariously so, when you're not brushing away a tear._x000D_ Riley (voiced by Kaitlyn Dias) is upset that her dad (Kyle MacLachlan) and mom (Diane Lane) have moved her to San Francisco (colored in dull browns) from bright, snowy Minnesota, where she loved playing hockey with her BFFs._x000D_ It's a scary new school and no friends, except for her emotions: Joy (Amy Poehler, perfection) used to be in charge. Now she's on a trip with Sadness (Phyllis Smith, all touching gravity) to recover Riley's best memories. That leaves Fear (a comically hyper Bill Hader), Disgust (Mindy Kaling, mistress of dismissive cool) and Anger (Lewis Black finding the vocal equivalent of a head bursting into flames) in charge over at Riley HQ. Ah, adolescence explained at last._x000D_ The idea has been tried — remember TV's Herman's Head? — but never with the artful brilliance of filmmaker Pete Docter (Up; Monsters, Inc.). Docter gets into our control centers as well as Riley's. We all hear voices in our heads — no, not the kind that get you locked up. As envisioned by Docter, co-director Ronnie Del Carmen and co-writers Meg LeFauve and Josh Cooley, Inside Out isn't so much a tale of emotions at war as it is emotions angling for a truce, reflected in Michael Giacchino's glorious, mood-leaping score._x000D_ Too sophisticated? Maybe so when the film takes us to the dark subconscious, \"where troublemakers go.\" Kids will probably roll with the abstract punches thrown by this burst of pure imagination. Parents and adults will likely be traumatized. You've been warned.",
  "304": "Another pixar classic, inside out remains an emotional, epic, and a funny movie. Pixar has never disappointed, and this is a great example. I would recommend this to anyone who has watched disney.",
  "305": "One of the best animated films I've ever seen. Watched it with great pleasure together with my 4-year-old daughter. She was amazed. All the characters are nice but we especially liked Anger and Joy. I can't but note that Inside Out has some educational elements - all the mental processes in our brains are shown in a simplified manner. That helps children learn more about themselves. How our memory works, how associations appear, what kind of emotions we feel, etc. Strongly recommend Inside Out.",
  "306": "What a Concept, What a presentation, Loved this Movie. I think 2016 Best Animated Movie award will be for sure. Best Movie of the Year in Animation Category.",
  "307": "Pixar évoque avec beauté et justesse le thème des émotions._x000D_Un bijou et un énorme coup de cœur pour ce film. Tellement d'émotion en voyant ce film (c'est le cas de le dire) que j'en avais pas ressenti autant depuis Toy Story 3.",
  "308": "A superb addition to Pixar's extensive catalogue. This film is atypical, unique and original in myriads of different ways via an incredibly refreshing outlook for family animated cinema. Its idiosyncratic approach pays off in dividends with characters who undergo prodigious rates of development. These characters slowly learn that they need to approach problems case by case and they must work both together and interchangeably. The film has a supremely enthralling stance on memory and emotion, despite some oversimplifications - but they are cute oversimplifications which hardly bog the film down. The plot is also very easy to follow, nothing confusing whatsoever. The music is also charming and sweet. Does it have the potential to be a Pixar classic? Yes, it certainly does. Stellar film.",
  "309": "(+) It's a really clever, inventive and interesting movie._x000D_(+) It's a food for thought even for an adult._x000D_(-) It has a few boring scence._x000D_It's one of the best animation movies I have ever seen.",
  "310": "Inside Out is not just a movie based on a great idea, but also a movie that implemented an idea very well. There are scientific explanation for many details of the movie._x000D_Maybe Inside Out won't be the best movie you have ever seen, but it can be one of the most informative ones. It helps you to know yourself more and better._x000D_Only thing that you should do is to try to watch it carefully and enjoy it!_x000D_(I am not good at English! Sorry for any mistakes.)",
  "311": "I could just go on full euphoric mode here, but i won't do that. I will only tell your that this movie is insanely good for every age (maybe not kids under 8 years tho but if its very colorful they will enjoy it as well i guess). Go watch it now, big recommendation!",
  "312": "Seriously guys, best Disney film for a lot of years. The original base, and the very nice story make it assom but, if i just give it a 9, its because the returning its so poor originaly, but its an assom film.",
  "313": "This is actually one of the best films I've ever seen.  This is not any other film I have seen that is as creative or wonderful as Inside Out. I mean come on, who else can create an amazing world of inside the mind? I personally think it should treated as any other great film rather then some other animated film. It has done things live action films can not do.  The reason why I loved it is because unlike most of the Hollywood movies these days, this movie has heart and soul and it actually leaves an impact on yourself rather than just entertaining you. It has to be seen by everyone.",
  "314": "Una película muy buena, me gusto y deja un lindo mensaje. Gran historia y entrañables personajes.",
  "315": "The movie was ok. It was pretty funny and some touching parts, however it was also a bit corny. My dad loved the movie, but some corny parts in the movie were during the journey through Riley's mind with hand-drawn animation and the post-credits scenes with emotions inside other people's heads.",
  "316": "After the release “Cars 2” Pixar has seem to lose its track with critics. Children may still love the films that had come after but adults and critics had some split ideas for the following film “Brave”. That film was enduring as it dived into the relationship between the queen and Merida. However, the story line did rely on some free spirited princess cliches that are a staple of Pixar’s parent company. The “planes” films are “Cars” spin off that have been universally panned by critics and it was very clear that these films were only meant for the youngest of audiences ( i.e. toddlers to six year olds). So when the trailer for Pixar’s latest outing came to theaters, many movie lovers (myself included) people were concerned with how this film was going to turn out. However as soon as the opening credits were over and the film proper had begun, it was very clear to me that Pixar had finally gotten back on its “A” game. “Inside Out” is not only a fun film that can be enjoyed by people of all ages, it is also a great insight on the nature of emotions and how all of them are nessacry in the development of a growing person._x000D_One of the first concerns that I personally had was that the emotions would only have one note personalities. For example, joy would be the generic quirky hero, fear would be the “geek”, Disgust would be the premdomina, sadness would only be able to express sadness and have it be it, and to have anger be the “hot-head” of the group. However, much to my surprise the writers have given the emotions their own distinct personalizes that have other elements of the other emotions. For example, Disgust shows a few instances of happiness when Reilly (their host) would have a chance to be happy with her move to San Francisco. It is only appropriate that the writers would have Reilly go through a move which would cause her to have an emotional breakthrough. Moving is a position that many young viewers could relate and it is an emotional experience for children and adults. Moving is leaving everything that someone loves behind in order to live in a prosperous future. The change is very hard for young Reilly as she struggles to comprehend that the house that her family moves into is not really her dream house. With this drastic change, the emotions start to fight amongst themselves about what is best for Reilly. This makes for a compelling story since the negative emotions like anger and fear and even disgust really want to do what is best for their host._x000D_As the plot progresses, joy and sadness are separated from the rest of the emotions, they meet with Reilly’s old imaginary friend named Bing Bong who was forgotten by her as she grew older. As soon as he had come onscreen, I thought to myself “he is going to find a way to betray Sadness and Joy and then try to take over the mind so that he would be the only friend that Reilly would have. However, the film had made the choice to not throw in a last-minute villain, the film makers had decided to choose a more tragic route for the character. The character disappears towards the end of the film forever which symbolizes the end of childhood and that the emotions need to continue to prosper in the future to maintain Reilly’s emotional balance. It is for the better that the film doesn’t have a main villain, the girl going through her emotions is a strong conflict as it is. The surprise twist toward the end of the film shows the importance of negative emotions as well as positive emotions. The film teaches children (as well as adults) that negative emotions are needed for a balanced life. People cannot experience joy without going through the sadness. A negative experience could be seen as a challenge to help with self- improvement_x000D_There is a running gag in the film about the girl and every character in the film remembering a commercial jingle that keeps popping up in their mind. The gag is not only hilarious but it is also an interesting bit of social commentary. The commercial jingle is a slight reflection of how far people go to promote their product. The jingles were made to be as catchy on purpose so that the target audience could remember their product. Another interesting piece of social commentary was when the cells were dumping the memories that Reilly deems as unimportant. Some of those said memories were the presidents of the United States such as John_x000D_Quincy Adams or Andrew Jackson. This brief segment of the film is a reflection of the ongoing short attention span that the younger generation has towards academia. The newer generations are more prone to being distracted by forms of media and showing less of an interest in studies._x000D_As a final note, “Inside Out” is a proud return to form film by Pixar that not only has a good piece of social commentary but it is also a reflection on hoe all emotions are needed even if they are negative. In a time of extremist opinions that are especially found on the internet, people can learn from this film.",
  "317": "No me senti emocionado cuando vi el trailer pero me di el tiempo de verla y fue una de las mas inespereradas sorpresas que he tenido es sin duda el mejor guion que haya visto en  una pelicula animada, los personajes, la trama, el trabajo visual es simplemente espectacular. Como siempre llore como un nino y eso la hace de mis favoritas",
  "318": "The biggest obstacle for Inside-Out, is that the world it is set in is not well-defined. We are not told if the emotions are controlling the little girl or simply assisting her. The separate islands they venture out to seem like they were arbitrarily created, and the fact that joy exists as the only positive emotion is a little confusing. The girl also seems to young to be undergoing such a large shift into depression, and the fact that she is depressed is never actually highlighted in the movie. The movie lacks as many jokes that are typically seen in a Pixar movie, but several scenes hit very well (ex. The look into the mom's brain). While Pixar succeeds in creating a visually appealing and well-acted film, the plot in itself seems like a reach.",
  "319": "Fantástico,mais uma obra de arte da Disney Pixar,Super criativo e divertido,emocionante e cativante com personagens carismáticos demais,filme essencial de assistir.",
  "320": "Great Pixar movie! It was so creative and there was really so many places they could have gone with it. Loved it! I love how different therapists use the characters in their practices to help children who have been victimized express their emotions. Amazing important fim :)",
  "321": "Innovation is how Pixar has been so great for so long.  But beyond the creativity, Inside Out pulls at your heart strings in a way only, well, emotions can...",
  "322": "Finally! A Pixar Movie That Made Pixar Out Of The Mold! You Would Believe What I Think Of This Movie. This Is My Favorite Movie Of All Time! This Is Also This Is One Of My Most Memorable Movie Of Time!",
  "323": "Inside Out is the first and only Pixar movie of the 2010s worthy of standing alongside the studio’s classics. In comparison to Monsters University or Finding Dory, which seemed so small, tv-like, and insignificant, Inside Out feels like the real deal. A big, theatrical, Pixar event. The movie is not up there in the upper tier of the catalogue, but it comes from approximately the same creative place.",
  "324": "Cutesy and kiddy-friendly, yet with tons of those bits that have the parents exchange knowing looks that they get what the film-makers are up to and what the message is. There is somethign different here to your run of the mill cartoon, but it's over-hyped. Don't expect Citizen Kane and you'll probably enjoy it.",
  "325": "Remember Toy story well Disney really used all their opinions this time and didn't rush it, inside out is the most funniest,Joyful,And most brilliant film ever.",
  "326": "This was a great and funny movie! It takes an abstract concept of emotions and makes them concrete for children.  It is a family movie that opens discussion about deeper emotions and the concept of loss.  Emotions are something that the modern world thinks should be hidden and a brave face should be put on.  This movie shows why emotions change and memories become sad.  The little girl faces many moments of sadness in this movie and she seems to have no hope for happiness again.  One possibility of conversation with children after watching this movie could be about where we get our happiness from.  Is it something that we find for ourselves, from religion, or from others.  These are questions we have to wrestle through with our children and peers.  Not only was this a great movie but it is a great conversation starter for many other topics.",
  "327": "Although the idea is original, and the characters new and familiar at the same time, it suffers from trying to include too many side stories and characters, that ends up in a jumble of plots and a mess of a story. But, fans of Disney and Pixar collaborations, will be sure to enjoy the visuals and the laughs (possibly all the story has to offer?).",
  "328": "The best animated story since Toy Story 3. It is put together amazingly except I wanted to see more of what happened in the normal world. It has sad, happy, and funny moments all in one. It is almost perfect.",
  "329": "This is Pixar's greatest film. A tightly constructed masterpiece of CGI storytelling that manages to condense heady themes in a way that anyone of any age will grasp and understand, all the while maintaining a great sense of fun and visual splendor.",
  "330": "The scenes outside of Riley's head are remarkable, involving the kind of emotional depth always associated with Pixar. But after trudging through the bland and forgettable buddy road trip sections, it just comes down to ..eh.",
  "331": "The concept was risky, but Pixar came out well, one more gem for their wonderful source of ideas, this is Pixar's fort, they should avoid at all costs the sequels and focus on new and original works.Inside Out is entertaining, fun and spectacular, a fable focused on human emotions and connections, a job of immense quality and excellent entertainment.Recommended 100%",
  "332": "Inside Out is an inspiring + entertaining movie, as it shows pride and cares about it's characteristic orbs. Yellow Joy, Blue Sadness, Green Disgust, Red Anger and Purple is Fear. Do not worry.",
  "333": "This effort is one of the most unique and original pieces by Pixar in a long time. It just seems to achieve the balance of simplicity and layering in all departments, with superb precision. Simplicity to cater to the kids and layering to help the grown ups too. The story, the characters and even the delicate music fits every scene like a jigsaw puzzle. A family flick which will surely become a classic within Pixar's catalogue.",
  "334": "Pixar suprises  us jet again with a animation movie that will go down in history as one of the best. It's beautiful story, clever plot points and visually stunning, this one will not disappoint. Even though the film is only 1h30m, you grow to care about most of the characters. This one is for sure one for the whole family to enjoy.",
  "335": "Inside Out is the full-circle, straight-to-the-gut feature of their sensational run thus far. From toys to bugs, from fish to cars. Emotions might just be their most complex narrative and premise to date, but it also makes it the most resonant and most real of stories. As you would expect, it makes you laugh, it makes you cry, it makes you scream and makes you sigh. But more than anything Inside Out makes you reconnect, relive and remember what's most important in what we live for and why we life for.",
  "336": "This animated film is undoubtedly one of the most original and creative I've seen in a long time, and all because of the script, portraying the way emotions (transformed into the characters Joy, Sadness, Disgust, Anger and Fear) influence the actions and behaviors of a young girl who has just moved with her parents to a new city. Intelligent, even intellectual, this film explains in a fun and light way how our emotions, memory and consciousness work, among other complex topics associated with our behavior and psyche, such as nightmares, dreams, traumas, etc.Not much to say about voice actors, and I don't even know most of them. Amy Poehler, who gives voice to Joy, is the one that stands out but everyone did an excellent job. All the characters had their time to shine, but the focus of the film is on the five emotions (with a strong emphasis on Joy and Sadness) and Riley herself. There are truly moving moments throughout the film, which I don't think are intended for children, but rather for a teenage audience and young adults, able to understand what the movie is showing. Before finishing, I just want to leave a word for the well-written dialogues, with some humor in between.From a technical point of view, the movie is flawless, as expected from a Pixar movie. Animated through advanced CGI features, it's the state of the art. Vibrant colors, good brightness, safe and realistic drawings ensure aesthetic and visual beauty, while attention to detail is visible, for example, in the way scenery and everyday objects are carefully designed. As sometimes happens in the movies of this studio, the soundtrack is not the strong dish here.I was truly delighted with this movie because of the way it addresses complex and intellectual topics. But this film is not only that: it is, above all, a good story about how we deal with our dreams, longings and emotions and how they can shape, or even redefine, our character at key moments in our lives.",
  "337": "After i saw Inside Out, i wanted to see what others thought. Critics were praising it, however, the users were disliking it. I  wondered why. Inside out is an wonderful film. You would expect that the emotions would behave exactly how they would (Anger would be angry, Fear would be afraid) and that's the only thing going against it. Everything else is perfect: the animation, plot and so on. Go see it.",
  "338": "yet to come -----------------------------------------------------------------",
  "339": "Inside out you know nothing about movie when you look at just the name without knowing anything strange but beautiful,it makes you wonder. I watched this comment the second time I watched after winning the oscar prize for this movie.the first word to say about the movie is a super idea that people are entering into the brain, memories and their perfect emotions that control them. Happiness,Anger, Sadness, Fear, Disgust can not live without them, filmin is trying to tell us all together a wonderful message to everyone, not just children, everyoneeeefrankly I am very satisfied with the inside out BRAVO",
  "340": "A light and sensible way to convey what we feel so that there is an easy understanding of the public. A film with no age, despite using the colors as an attractive child among others. Now even feelings can be portrayed in a subtle and entertaining way. 8.3/10",
  "341": "\"Inside Out\" brings back the magic that was lacking in previous Pixar films, providing us with an extremely heartfelt tale with plenty of clever jokes and tear-jerking moments.",
  "342": "Inside Out is amazing. The amount of emotion, insight and catharsis on offer in this animation puts most serious adult films to shame. This is a film that truly makes you laugh and cry... Often at the same time. Pixar have set a new bar for themselves with this",
  "343": "Disney had a pretty bad run with Cars 2, Monsters University 2, Inside Out is probably its saving grace. I totally admire the concept and story line of this beautiful movie of Human Emotions. I myself was an adolescent when this came out and I could feel a connect with the characters of this movie. A feel good movie with the ups and downs of growing up and facing changes in one's life and how we go about it. Totally loved it!",
  "344": "Inside Out is definitely a great animated, colorful, comedy and adventurist movie. Its main case and the way of the story are totally new and fresh.. but the storytelling was sometime childish and usual too!As an animated movie, it's so emotional and colorful. The animation was so bright, colorful and details-showing.As a comedy movie, the sense of humor was more than fine, a lot of jokes worked with me very well, and some didn't at all!But as an adventure movie -here's the problem-, the trip, or the journey back to Riley, was sometimes childish and somehow usual.The voices were fitting and amazing.The story is close to every child and young man -such as like me-, it was emotional, enjoyable and joyful!Well, DisneyPixar Inside Out is a truly family, fun and colorful animated movie, that it's totally worth watching!",
  "345": "Esta pelicula es muy innovadora con muchas ideas principales, la parte que mas destaco de la pelicula es la introduccion y alegria como un gran personaje carismatico, te cae bien durante toda la pelicula. Sin embargo, el poco desarrollo de personajes secundarios, una historia densa y con agujeros en algunas ocasiones (que lo entiendo ya que es para todas las edades pero arruinaron una unica oportunidad, ademas de que no se sabe como se originaron los personajes al principio) y el final simple lo critico.Aunque no esta mal, es decepcionante ver que esto fue hecho por mis dos compañias de peliculas favoritas, disney y pixar. Juntas tendrian que haber hecho algo sobresaliente, y si bien la idea fue muy buena y original, y se nota mas que nada en el principio de la pelicula, el resultado final es mediocre.",
  "346": "Such a dumb, vapid and shallow movie. It's so surface level that it's insulting kids' intelligence.",
  "347": "Yeah, I'm sorry. I understand why people like it, but it just really didn't do it for me.",
  "348": "de niñes a adolecencia , es el intenso recorrido que pasaran sus emociones a lo largo de una lucha entre la felicidad y la trizteza que para ella es un cambio de vida , con alluda de recuerdos y del amigo imaginario que le alludara a recordar lo feliz que era y lo feliz que podra llegar a ser .en mi opinion es una pelicula que te deja mucho que pensar una vez que la terminas .",
  "349": "Some of the things I'll mention are a bit spoilery, but, come one, this is a review for a 4 year old movie, I guess that most of the people that are looking at the reviews have already seen this movie and want to read other's opinions, but if you haven't seen it, what are you waiting for? Inside Out is an animated masterpiece, it's hands down the best original Pixar movie of this decade and one of the best animated movies of the decade. Sure, the concept isn't really anything original (Sentient feelings inside the head, all acting according to the emotion they're representing isn't anything new, obviously) but the way it's executed it's what makes it truly unique. The charismatic characters, the great writing, the imagination put into the creation of the world of \"Riley's mind\", the animation, the score, almost every aspect is phenomenal. The plot itself also doesn't sound too original or exciting, like the story is pretty predictable but what happens between point A and point B of the journey of our protagonists is exciting, engaging and truly emotional.The score is one of the best scores in a Pixar movie and probably of any animated movie ever, it's so beautiful and really triggers emotions, it fits perfectly the tone of the movie and makes emotional moments even better and a lot more emotional and tear-jerking.I loved the character development, specially from the main lead: Joy. I thought that maybe they'll act the same the entire movie leaving no room for development, but the good boy director Pete Docter found a way to not make that a problem: Give feelings to the feelings. Many people don't like Joy but for me it's one of Pixar's best protagonists: At first she seems like a happy and optimistic person but actually she's a selfish person that just worries about making Riley happy all the time, but by the end of the movie we see a completely different Joy, a Joy that learnt so much during the journey back to headquarters, I just love her, I love her character and how well developed was her arc.This movie has a surprising level of depth and the message this movie gives is so beautiful and impactful: It's okay to be sad, everyone wants to be happy and pretend to be happy to hide their real emotions but sadness and other feelings are necessary in order to feel better.I need to mention that I hate when people complaint about the plot holes and that how some things don't make sense, like:-\"Why didn't Joy send the core memories back to HQ through that tube thing that sent memories directly to HQ\"? Well didn't anyone see the movie? Joy, at first was a selfish character, she didn't want anyone to touch the core memories or else they'll turn those memories to other emotion, obviously when they send them the other emotions will have to take the memory down or what? You wanted Joy to send a message saying \"don't touch them until I go back\"?No, the movie doesn't have dumb plot conveniences to make the journey longer as I heard from some place in the internet, if you watch the movie carefully you'll see that everything that happens is for a reason, nothing happens \"just cause\", I find annoying when people nitpick this movie and point out that they didn't like the movie because it has \"things that don't make sense\" come on!!!I love this movie, I truly love it and it's such a rewatchable movie, I think I love it more and more the more times I see it. This is hands-down my favorite animated movie from 2015 and I think its Oscar is really well deserved, like yeah, Anomalisa is amazing but if it was released in 2016 and not 2015, it would've been my #1 animated movie of the year but, as of now, it's my second favorite.",
  "350": "When I first heard of this movie I though the this movie would be pretty cheesy, but no it did not dissapoint at all. The moves and tone of the characters made the film so good and emotional.",
  "351": "Fantastico.Criminosamente sottovalutato tra i film del catalogo Pixar. Certo, non sarà perfetto come una volta dicevo, soprattutto per alcuni punti narrativi poco approfonditi o non troppo sensati e coincidenze forzate, ma l'eccellente reparto tecnico, la caratterizzazione dei personaggi ben congegnata così come il concept della storia e il messaggio di fondo che permea tutto il film ha fatto sì che ne valesse la pena. Sicuramente lo farei vedere ai miei figli nel caso li avessi in futuro.Consigliato? Yup yup yup.",
  "352": "The film has an incredibly unique, creative, and colorful concept that I just adore. They could've cheaped out and made anger and/or sadness the villain, but they did something crazy for an animated film by not having a villain. The characters and their interactions are delightful. It has a fun charm yet still makes you cry at the end. This might just be my favorite Pixar movie.",
  "353": "i have little people in my head but there all horny and depressed all the time.",
  "354": "Inside OUT is AWESOME. This must-see tells us the story of a troubled teenager and a personification of her emotions. Pixar brings the storyline perfectly by sliding disney magic while having emotions while watching this movie. A MUST-SEE.",
  "355": "If you are trying to find the most emotional animated movie out there, this one is it. Every single character is likable and relatable. Top quality animation, I love how Joy has light shining around her, and there is a scene in which 3 characters go into an abstract world. The ending almost had me crying, which is extremely rare. In my opinion, the best animated movie out there. 100% recommend.",
  "356": "A great movie, and a great look at childhood at how it influences us. This movie can bring both children and adults to tears, and can surely be considered as one of pixar's greatest films. After rather mediocre movies like Monsters University and Brave, and a complete flop in Cars 2, maybe this is the revival time for pixar",
  "357": "Inside Out is by far Pixar's best film since Toy Story 3 (2010). It provides an emotional and interesting look into a child's soul. The voice acting is really good and obviously by the standards of pixar the animation is stunning. It's really creative and inventive with twists and turns and surprises combined with a great story. Inside Out had both it's funny and emotional moments and great characters. The screenplay for this film is really good and it packs an incredibly well-made and emotional third act even as it is rather tedious and boring in the middle. But overall, Inside Out is another fine piece of art added to the Pixar cannon.",
  "358": "Anyone that is critical enough to have a problem with this movie does not actually have a favourite movie, and probably doesn't like movies, in my opinion they should just give up on movies because nothing yet will meet their expectations (and quit discouraging others). I mean, what else can be as interesting, meaningful, relatable, agitating and mesmerisingly cute as this. It's simple, well put-together and beautifully told.  This movie tells us a lot about emotions and the consequences for handling each of them and it was a perfect decision to tell it as an animated cartoon. It tells it from a little girl's experiences. I'm pretty sure present day kids can't watch Herman's head or whatever.",
  "359": "Pixar has made movies of all kinds - What if toys, insects, monsters, cars, fishes or rats had feelings. And now they have made Inside Out - what if feelings had feelings? Inside Out is probably one of the most underrated movies that Pixar has made. It was the first original Pixar movie which I didn't get to know about when it released (the first such one was a sequel, Monsters University), and I'm really surprised how this movie gets overlooked so easily.The way I see it, this movie is a social commentary about how we perceive life with our emotions. Riley here is a metaphor of us, how we feel when we move to a new place and are unable to handle the new life. In such situations we either feel scared, angry or depressed. When Riley starts crying in class, Joy tries to stop Sadness from ruining her memory with a vacuum but ends up destroying all her other memories. This is another metaphor from our lives, where we end up forgetting all our happy memories in times of desperation.Later on Joy and Sadness are in her memories, where they see Riley's childhood drawing of Bing Bong whom she considered her friend. The plot has been made with a complete sense of nostalgia. When we feel nostalgic, we feel both happiness and sadness at the same time. We are happy because we got to live those times, the time which was better than what we are living at the moment. We are sad because we know that time never stops, and so everyday we are straying further away from when it happened. We will never be able to live the day again, and it shall only stay in our memory.While Joy and Sadness are not present Fear, Anger and Disgust control her. I don't think I need to explain this. Riley has lost all her happiness and does not feel any sadness. Keep in mind she had previously cried in class, which is something very embarrassing for a ten year old child. As a result she does not want to show her sorrow in front of everyone since she fears people will laugh at her, so instead she tries to cover it with anger and disgust. This is just like how we behave when we are depressed but are also too afraid of what others might think if they learn about it.And then there is the memory dump, the place where the old memories are forgotten. This is one of the deepest messages that the movie gave us. To save Joy and Sadness and allow them to get out of the pit, Bing Bong readily sacrifices himself. This is because he had always considered himself and Riley friends, and he was ready to sacrifice his own life for this. It also shows how Riley has now lost the memory of Bing Bong due to her depression and frustration, and it is something she will never remember again. This is a metaphor of how we forget the small details from our childhood which gave us joy once we grow out of the phase. It also symbolises that although Bing Bong has been lost forever, Riley's joy and sadness will always remember him. This is similar to how we get nostalgic whenever we see our childhood writings and drawings.And finally when Joy and Sadness do make it back, then Joy chooses to let Sadness guide Riley. If she wanted she could have guided Riley and make her feel happy about reuniting with her parents. But in that case the moment would have completely lost the impact. So instead Sadness did it, which is why Riley started crying, something she had not done for a long time. This is yet another metaphor of when we are unable to hold our sorrow for too long and burst out crying. As a result her parents are finally able to understand the situation she is in and give her more love.In the end Riley starts feeling happy, since everyone has understood the value of Joy. She was the first emotion that Riley felt, and the one who guided them all in the time of desperation. All the other emotions came to her afterwards, which is why they are not as emotionally attached to Riley as Joy does. Joy knows what is the best for her, just like how we feel the best thing for our life is what makes us feel happy.The only problem I had with this movie was, well, it looks way too subtle. The reason why this movie is so overlooked is because of how ordinary it looks compared to all the heavyweights that Pixar makes. Riley's face also a little too wrong. It looks like an adult's nose has been put on a child's face. Anger looks like he is made of synthetic sponge. Plus it doesn't make sense that in spite of seeing over and over that he is making mistakes, he still does not let Disgust and Fear do the work which does not give enough balance to all of the characters.But other than that Inside Out is a very good movie for a character study. I have never before seen a family movie with such a deep, hidden philosophy. The only one which comes even close to it is Zootopia, but it was more inclined towards telling the story than giving the message. Inside Out is a definite must-watch in my opinion if you like movies like these. I really hope this one gets a sequel.",
  "360": "Dr. Ryan Stone (Sandra Bullock) is a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalsky (George Clooney) in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The shuttle is destroyed, leaving Stone and Kowalsky completely alone - tethered to nothing",
  "361": "This movie is not amazing. It's ok, it's fine.  You won't claw your eyes out or stop the movie... but unless you're 5 you won't want to watch it again... ever.",
  "362": "Inside Out is another excellent film from the Pixar studio. He has an excellent idea and an overall very interesting story, which, as the name suggests, tells us about what is really going on in our heads. The story is excellent and we have a good soundtrack and of course it's Pixar, so a wonderful animation. Overall, this is an excellent film that I recommend.",
  "363": "Wow...just, wow. Let's forget having to do sequels and just stick to the original \"return to form\" device. The climax leaves me in tears every time. The script is perfect, the acting is great, and once again Pixar reins supreme in the film industry.",
  "364": "Dentro Fuera es una experiencia desafiante no apta para noobs que solo saben jugar al fifa, le recomiendo este juego a todo macho alfa (Si eres mujer lo pasaras muy mal, no tiene arcoíris ni cocinas)Mi personaje favorito de Dentro Fuera fue ESPiderman, porque consiguió superar su minusvalía (Era negro) y recuperar la paz en la grieta del invocador. Conclusión: hay un negro, no me gusta, 0, quieren convertir a nuestros hijos en negros, para probar el 5G, y controlarnos a todos.Horrible.0,",
  "365": "Worst Disney movie ever! I don't know how it doesn't have any negative reviews. The premise is great, but the movie falls way short of its expectations. I think everyone who reviewed this movie only watched the previews.",
  "366": "Pixar yet again hit's one out of the park with this brilliant movie. A story that could of been difficult to tell to kids is done with sensitivity, heart and of course humour.",
  "367": "Animation quality - top of the line, shallow a human to the role of a puppet of his emotions and addressing such a concept to children calls for vengeance to heaven",
  "368": "If Monsters University started to ease back into classic PIXAR, then this movie returned it to its full glory.  Inside Out is easily the best PIXAR movie since Toy Story 3, a shame it took a whole five years to get there.  I remember seeing the first teaser for it and thinking it would be good, but when I first saw the movie I was blown away.  The concept of this movie is absolutely genius.  Inside Out is a lot of fun, but it's also thought-provoking and in a really good way.  I had a lot of fun thinking about what the inside of my head looked like.  By the end of this movie, the emotional payoff was really big and got me to cry again even after watching it several times.  This movie is another film in PIXAR's catalog that is enjoyable for everyone.  It's a quality that the best PIXAR films (and animated films in general) share.  In a couple of years, this will easily be another PIXAR classic, and I already know some people that consider it a classic.",
  "369": "inside out from disney onlyprosemotions portrayed in a very good wayspecial characters like bing bong make up the whole moviejoy's quest to save riley's happiness was a true adventureeven the other emotions are capable of more than one thingvery creativeconsmissing the movie",
  "370": "Best movie ever from 2015 along with avengers age of ultron! my favorite character on this movie is joy!",
  "371": "Congratulations to a genius named Pete Doctor who was able to create a very energetic, sad and funny movie that no one has ever seen before!",
  "372": "Pretty interesting premise for a movie. Pretty decent movie overall, at the end of the day.",
  "373": "You know,Inside out is not that bad. It is enjoyable. I like the fact that it is emotional",
  "374": "Beautiful movie, it hit me hard as I am someone who suffers of quite a few mental health disorders. The brain is a crazy thing. This movie made me laugh and cry, and sometimes both at the same time!",
  "375": "Emotions and many colors, Inside out is an unforgettable adventure in the life of a Preteen",
  "376": "In addition to Up, Wall-e, Monsters Inc. and Toy Story 3 (which are obviously Pixar masterpieces of all time), I managed to make the best Pixar movie... playing with feelings from the age of 12 (when they enter adolescence). Very excellent animation, the screenplay is great and the soundtrack is great. Overall, it's one of the best animated movies I've ever seen.",
  "377": "Though a little bit out there at times, Inside Out is a truly inspiring, must-see movie, especially for children. This movie describes emotional intelligence really well, except for forgetting surprise. Good job Pixar!"
}